/*
自我测试 sgf 文件
*/


let g_wqqlzwcs =
[
	[
		//wqqlzwcs_1_1.sgf
		"(;AB[pd][pp][de][cf][dg][fd][fq][fp]AW[ce][cd][dc][dp][eq][cn][dk]LB[qj:a][fb:b][ip:c][kq:d]SZ[19]C[（布局）白先。白棋如欲取得全局的主动，应充分考虑到棋子的配置，再决定下一手棋，请在 a、b、c、d 中选择。](;W[qj]C[图1 方向错误（4分）白棋在右边分投，预先防止黑棋扩张，但是过于消极。]N[图1 方向错误（4分）];B[jp]C[黑棋在下边拆，间隔正确];W[qn];B[np]C[白棋挂，黑棋一间跳，都是可以预见的进行。下边黑棋棋形很理想。])(;W[fb]C[图2 见小（4分）白棋飞，从局部来看，应该是正确的，但在目前的形式下，白棋应该在左上脱先。]N[图2 见小（4分）];B[jp]C[黑在下边拆是绝好点];W[qj];B[ql];W[qf];B[nd]C[进行至此，黑布局领先。])(;W[ip]C[图3 正解（10分）白棋夹攻是正确的选择]N[图3 正解（10分）];B[kq];W[jo]TR[kq]C[黑棋如果反夹，白棋小尖得法，以后黑棋如果处理左下的二子，将决定形势的有利和不利。])(;W[kq]C[图4分投（6分）白在下边分投是不正确的]N[图4分投（6分）];B[iq]C[黑先发制人发动攻击，白棋与图3 相比，差别很大];W[nq];B[eb];W[db];B[oq];W[np];B[pn]C[进行至此是必然的次序，白棋布局不满。]))",

		//wqqlzwcs_1_2.sgf
		"(;AB[qd][od][qj][jq][gq][cd][ed][ec][gb]AW[fd][fe][id][dq][cn][op][qp][lq]LB[kd:a][di:b][lo:c][ql:d]SZ[19]C[（布局）白先。目前白棋虽然有很多大场可以选择，但应考虑何处是最有效益的位置。请在 a、b、c、d 中选择。](;W[kd]C[图1 闲棋（6分）白在上边补棋，几乎是一手闲棋]N[图1 闲棋（6分）];B[qo]C[黑棋靠是正确的手法];W[po];B[qn];W[rp];B[pn];W[on];B[om];W[nn]C[进行至此，黑棋右边得一扩张，而白棋在下边则受到黑棋拆二的限制。])(;W[di]C[图2 方向错误（6分）白棋占左边大场，同样是脱离主战场的棋]N[图2 方向错误（6分）];B[qo];W[po];B[qn];W[rp];B[pn];W[kd]C[右下定型后，白在上边跳];B[nn]C[但黑向中腹跳，右边黑势得意扩张，布局仍是白棋不利。])(;W[lo]C[图3 最差点（4分）白单跳未遵循“金角银边草肚皮”的布局基本原理]N[图3 最差点（4分）];B[qm]C[黑在右边拆二是全盘最大的大场];W[di]C[白在左边扩张];B[kd]C[进行至此时，右边黑势充满活力。])(;W[ql]C[图4 正解（10分）白棋在右边展开是最应优先考虑的]N[图4 正解（10分）];B[kd]C[黑在上边拆三];W[pj]C[白则在右边飞压扩张];B[pi];W[oj];B[qk];W[pl]C[从全局来看，右下白势充满活力。]))",

		//wqqlzwcs_1_3.sgf
		"(;AW[dd][dj][dp][cp][ep][go][hq][rb][qc][rd][qf][qg][qm][rm][pl][oj][qj][qk][ol][om]AB[jd][nd][pd][pb][pc][qb][qh][oh][mi][dq][cq][fq][fr][pq][pm][pn][po][qn][ql][rl]LB[rn:a][of:b][lq:c][fd:d]SZ[19]C[（中盘）黑先。双方彼此势力消长的要点在何处？请在 a、b、c、d 中选择。](;B[rn]C[图1 仅为官子（4分）黑棋在右边打吃白二子，实际上仅为官子行为]N[图1 仅为官子（4分）];W[hc]C[白棋在上边大拆限制黑势，黑棋不满。])(;B[of]C[图2 入不敷出（4分）黑棋单跳阻止白棋向中腹出头，但实际上是黑棋投入过多]N[图2 入不敷出（4分）];W[gd]C[白占据要点之后，黑棋不满。注意与图1 的区别，白棋少拆了一路，且是高拆。])(;B[lq]C[图3 方向错误（6分）黑棋在下边拆三，虽然在实地上是无法忽视的大场，但是方向错误]N[图3 方向错误（6分）];W[gd]C[因为本局的焦点是在上边，所以被白占据上边要点之后，黑棋不利。];B[of];W[rh])(;B[fd]C[图4 正解（10分）黑在左上高挂，是扩张黑势的有力手段]N[图4 正解（10分）];W[df];B[dc];W[cc];B[ec];W[cb];B[ff]C[进行至此，黑棋很充分，上边黑势充满活力。]))",

		//wqqlzwcs_1_4.sgf
		"(;AB[dc][db][cd][de][pd][mc][pq][qo][dm][dn][dp][eo][fp][fq][fn][gl]AW[ec][ed][gd][kc][nq][kq][hq][ho][go][fo][cq][cp][co][cm][cl]LB[qi:a][qc:b][il:c][cg:d]SZ[19]C[（中盘）白先。白棋可以掌握局势主动权的要点在何处？a、b、c、d 中最正确的位置是什么？](;W[qi]C[图1 次选方法（8分）白在右边分投，事先防止黑棋扩张]N[图1 次选方法（8分）];B[il]C[但黑单跳安定自己，并在中腹筑成外势，黑棋可以满意。])(;W[qc]C[图2  最差点（4分）白棋在右上点三三是价值最小的位置]N[图2 最差点（4分）];B[qd];W[pc];B[od];W[nb];B[pj]C[黑棋在右上取得先手后在右边连片，白棋不利。])(;W[il]C[图3 正解（10分）白在中腹大飞镇，攻击黑棋是正确的]N[图3 正解（10分）];B[ek]C[黑防守必然];W[oo]C[白飞镇扩张后，白好。])(;W[cg]C[图4 方向错误（6分）]N[图4 方向错误（6分）];B[il]CR[cg]C[白棋在左边拆逼虽是扩张左边的手段，但其价值不如黑中腹单跳大];W[qi]C[其后白在右边分投];B[qe]C[黑补棋。黑棋形势很充分。]))",

		//wqqlzwcs_1_5.sgf
		"(;AB[cr][dq][co][cp][bn][bm][cm][cl]AW[bo][dn][cn][do][dp][dm][eq][er][fp]SZ[19]C[（官子）白先。白棋如何利用黑棋的弱点，以最大限度地减少黑地？](;W[br]C[图1 正解（10分）白在角上靠是手筋]N[图1 正解（10分）];B[bp]C[黑只好打吃];W[dr];B[cq];W[cs]C[白棋可以渡过。])(;W[cs]C[图2 俗手（4分）白棋托是俗手]N[图2 俗手（4分）];B[br];W[dr];B[cq];W[bs];B[bp]C[白棋虽然取得先手，但在官子上受损。])(;W[dr]C[图3 失败（4分）]N[图3 失败（4分）];B[cq];W[cs]CR[dr]C[白棋打、扳官子便宜不大];B[bs];W[ds];B[ar])(;W[br]N[附图]C[附图 ];B[bq]C[黑棋挡没什么意义];W[dr];B[cq];W[cs];B[ar];W[bs];B[bp]C[黑棋还得回手补，与图1 相比，黑棋走了一个价值不大的后手官子，先手变成白棋的了。]))",

		//wqqlzwcs_1_6.sgf
		"(;AB[bs][br][cq][cp][bo][bn][cn][dn][do]AW[cr][cs][dq][dp][ep][er][fo][gp][en][em][dm][cm][bm][an][bk]SZ[19]C[（官子）白先。在官子阶段，即使是 1 目的差别，也有可能改变胜负。](;W[aq]C[图1 正解（10分）白棋点是收官妙手]N[图1 正解（10分）];B[ap]C[黑补棋。白棋可以脱先占据其他官子，以后黑棋还须补一手棋。白先手，黑地 6 目。])(;W[aq]C[图2 变化图]N[图2 变化图];B[bq]LB[ap:a]C[黑棋补在这里，而不是在 a 位补];W[ao];B[ap];W[am];B[ar]C[白棋先手收官。白先手，黑地 5 目。])(;W[ao]C[图3  失败（0分）]N[图3  失败（0分）];B[ap];W[am]C[白棋单纯爬、接，与图1 相比，白棋损 1 目。白棋后手，黑地 6 目。白损失了一个先手。])(;B[ao]C[附图如果黑棋先下，那么挡下即可，黑地 7 目。如果白棋粘，则黑棋挡下的价值是双先 1 目。如果白棋脱先，黑棋挡下的价值是逆收两目半（按出入法计算）。]N[附图 ]))",

		//wqqlzwcs_1_7.sgf
		"(;AB[ds][dr][dq][dp][eq][ar][bo][co][cm][dl][cj][hr][iq][jp][jn]AW[ap][bp][cp][cr][cq][cs][bs][fr][do][dn][fo][fp][gp][ho][gn]SZ[19]C[（手筋）黑先。黑棋如何才能做到左右联络？](;B[gs]C[图1 正解（10分）黑棋在一路上小尖是渡过的手筋]N[图1 正解（10分）];W[fs]C[白棋如果立下坚决阻渡];B[fq]C[黑棋冲即可];W[gq];B[gr]C[这样局部形成公活，但角上白棋是死棋。])(;B[fs]C[图2 失败（0分）黑棋在底线托是过于偏重于心情的大恶手]N[图2 失败（0分）];W[gs];B[fq];W[gq];B[gr];W[es]C[进行至此，黑已回天乏术。])(;B[fq]C[图3 失败（0分）]N[图3 失败（0分）];W[gq];B[gr]C[黑棋直接冲断];W[es]C[白棋尖是手筋，黑棋由于不入气而被杀。])(;B[gr]C[图4 附图黑棋顶，似乎是手筋的样子，其实这是缺乏计算的表现]N[图4 附图];W[fq];B[fs];W[es]C[白棋扑，黑五子已经接不归。]))",

		//wqqlzwcs_1_8.sgf
		"(;AW[dq][fp][gp][hp][in][hl][gl][fl][dl][cm][bo]AB[bq][cr][co][eo][fo][go][gm]SZ[19]C[（手筋）黑先。黑棋整形的手筋是什么？](;B[dp]C[图1 正解（10分）黑棋尖顶是棋形上的急所]N[图1 正解（10分）];W[dr]C[白只好补棋];B[bn]C[黑棋扳下，已彻底安定，而且得到不少实地。];W[cq];B[br])(;B[dp]C[图2 变化图]N[图2 变化图];W[bp]TR[dp]C[黑棋尖顶时，白棋寻求变化];B[cp];W[cn];B[eq]C[结果仍然是黑棋充分。])(;B[bp]C[图3 失败（0分）黑棋顶]N[图3 失败（0分）];W[dp]C[白占据要点];B[do];W[bn]C[进行至此，黑棋失败。]))",

		//wqqlzwcs_1_9.sgf
		"(;AW[ar][bq][cq][cp][co][cn][cm][bl][bm]AB[cj][bk][cl][dl][dm][dn][do][dp][dq][dr][cr][br]SZ[19]C[（死活）黑先。一线上虽有一个白子，但黑棋仍能使白棋走成死型。](;B[ap]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是死活的急所];W[aq];B[bo];W[al];B[an]C[白棋已没有两眼。])(;B[ap]C[图2 变化图]N[图2 变化图];W[ao]TR[ap]C[黑棋点时，白靠下寻求变化];B[an]C[黑棋打是好棋];W[bo];B[aq]C[白棋依然没有两只眼。])(;B[bo]N[图3 失败（0分）]C[图3 失败（0分）黑棋点这里是过于偏重心情的俗手。受棋形束缚了。];W[al]C[白棋立下扩大眼位，冷静];B[ap];W[an];B[aq];W[ao]C[白棋做活了。]))",

		//wqqlzwcs_1_10.sgf
		"(;AW[br][bq][cp][co][dn][dm][fn][go][fp][gq][hq][iq][ir]AB[dp][do][cq][cr][eq][fr][gr][hr]SZ[19]C[（死活）白先。白棋如果行棋次序准确，完全可以吃住黑棋。](;W[es]C[图1 正解（10分）点是死活的急所]N[图1 正解（10分）];B[ds]C[黑棋抵抗];W[er];B[hs];W[fs];B[fq];W[bs]C[显然，黑棋做不出两个眼来。])(;W[es]C[图2 变化图]N[图2  变化图];B[ds];W[er];B[hs];W[fs];B[ep]C[黑棋有在这里接的变化];W[dr];B[cs];W[fq];B[dq];W[is];B[gs];W[er]C[白棋断打，黑棋依然被杀。]))",
	],

	[
		//wqqlzwcs_2_1.sgf
		"(;AB[pd][nd][qc][kq][nq][pr][dc][fd][bn][cm][dm][en][fn][do]AW[df][qf][qi][rd][pp][pn][qq][dq][ep][eo][dn][cn][co][bo]LB[di:a][gp:b][jd:c][cd:d]SZ[19]C[（布局）黑先。黑棋应充分考虑周边棋子的配置，以决定下一手棋。 a、b、c、d 中，黑棋应先考虑的位置是什么？](;B[di]C[图1 正解（10分）黑棋在左边拆并且攻击白棋一子]N[图1 正解（10分）];W[ff]C[白向中腹逃跑];B[hd]C[黑则在上边捞取实地，同时仍保持对白棋的攻击，黑棋极为满意。])(;B[gp]C[图2 最差点（4分）黑在下边封锁白棋，其缺点是不能对白角施加任何影响]N[图2 最差点（4分）];W[di]C[白棋在左边拆二之后，结果黑棋不满。])(;B[jd]C[图3  方向错误（6分）黑棋在上边防守，是方向错误]N[图3  方向错误（6分）];W[di]C[白在左边拆，是安定自己兼攻击对方的好点];B[fl];W[cd];B[cc];W[hq]C[进行至此，白棋舒服。])(;B[cd]C[图4 次选方法（8分）黑棋防守左上角，并且还伺机攻击白棋左边一子，缺点是过于消极]N[图4 次选方法（8分）];W[di];B[fl];W[fi]C[白棋安定之后，黑棋错失良机。]))",

		//wqqlzwcs_2_2.sgf
		"(;AB[cf][cj][cm][pp][pn][qq][qi][qd][rd][oc][nd][md]AW[dd][fd][dp][fp][nq][kq][pr][qe][pe][ld][mc][kc]LB[ef:a][nh:b][bp:c][cc:d]SZ[19]C[（布局）黑先。黑棋只要能选择正确的要点，就能一手棋控制局面。请在 a、b、c、d 中选择。](;B[ef]C[图1 方向错误（6分）黑棋单跳扩张，并且伺机打入上边]N[图1 方向错误（6分）];W[oh]C[但被白棋成功逃跑后，黑棋错过了掌握局面主动权的机会。])(;B[nh]C[图2 正解（10分）黑棋大封白棋二子是正确的，白棋二子已束手就擒。]N[图2 正解（10分）])(;B[bp]C[图3 收获不大（6分）黑大飞进角虽是实地上无法忽视的大场]N[图3 收获不大（6分）];W[oh]C[但被白成功逃跑之后，黑棋缺少妙味];B[qg]C[其后黑再发动进攻];W[oj]C[白棋单关，黑棋难有收获。])(;B[cc]LB[bd:a]N[图4 时机不成熟（6分）]C[图4 时机不成熟（6分）黑棋点三三与白棋 a 位跳下相比，差别很大，但这一位置应是黑棋处理完右边之后再考虑的。];W[cd];B[bd];W[dc];B[bb];W[cb];B[bc]C[左上角黑棋难免成为后手];W[oh];B[pj];W[qh]C[白棋飞、靠整形，白棋满足。]))",

		//wqqlzwcs_2_3.sgf
		"(;AB[pd][qp][pq][oq][fq][fp][ip][cd][be][ce][de][cf][bf][bg][bh][ch][cj][dj][dk][cl][fj][gj][gk][ed][fd][gd][ge][hg][jg]AW[kd][op][mp][nq][eq][dp][cn][bb][bd][cc][dc][ec][dd][ae][ee][fe][df][dg][cg][fg][fi][gi][hj][ii][bj][bl][bk][ck][fk]LB[fl:a][en:b][md:c][id:d]SZ[19]C[（中盘）黑先。黑棋虽然在实地上落后于白棋，但黑棋可以通过攻击白棋来控制局面。请在 a、b、c、d 中选择。](;B[fl]C[图1 黑棋消极（6分）黑在中腹打吃，虽确实能安定自己，但是过于消极。]N[图1 黑棋消极（6分）];W[ki]C[白棋单跳之后，黑棋很难继续攻击白棋];B[lg];W[nc]TR[lg]C[黑棋跳、白棋挂是预想的进行，黑棋略微不满。])(;B[en]C[图2  大同小异（6分）黑棋飞与图1 大同小异]N[图2  大同小异（6分）];W[nc]C[其后白在上边挂];B[ki]C[黑棋飞攻];W[hk]C[白先手压];B[gl];W[kk]CR[hk]C[白先手压后大跳整形，白棋充分。])(;B[md]C[图3  正解（10分）黑在上边夹攻白棋是正确的作战手段]N[图3  正解（10分）];W[kf]C[白向中腹单跳];B[kg];W[mf];B[ki]TR[kg]C[黑分割白棋，白棋以后不好下。])(;B[id]C[图4  最差点（4分）黑在上边单跳，是最差的一手]N[图4  最差点（4分）];W[nc];B[qf];W[pb];B[qc];W[ne]C[白在上边轻易安定之后，黑棋极为不利。]))",

		//wqqlzwcs_2_4.sgf
		"(;AB[pd][qc][nc][pq][qo][bc][cc][dc][bd][fc][fd][ge][gf][cf][fq][fp][io][ho][gm][iq]AW[be][ce][cd][dd][ed][fe][ff][fg][ch][dp][dn][eq][qf][qi][rd][nq][kq][jo][jn][in]LB[ql:a][jd:b][hh:c][of:d]C[（中盘）黑先。黑棋应以什么方法来进行扩张？请在 a、b、c、d 中选择。]SZ[19](;B[ql]C[图1  次选方法（8分）黑在右边拆二，是仅次于正确答案的大场]N[图1  次选方法（8分）];W[jc]C[但白棋在上边分投，使黑棋左右分割，黑棋略有不满。])(;B[jd]C[图2  正解（10分）黑防守上边，使上边实空确定之后，黑棋可以掌握局势。]N[图2  正解（10分）])(;B[hh]C[图3  最差点（4分）黑棋飞过于贪心]N[图3  最差点（4分）];W[jd]C[白在上边分投是追攻黑棋失手的正确手段];B[hd]C[黑棋虎，防守];W[lc]TR[hh]C[白棋站稳脚根之后，黑棋当初的飞（H12）几乎成为废棋。])(;B[of]C[图4  黑势被削（6分）黑棋右边飞同样贪心]N[图4  黑势被削（6分）];W[ke]C[白棋浅削时，黑棋缺乏攻击手段];B[kc]C[黑棋防守];W[ie]C[白再单跳削黑势。]))",

		//wqqlzwcs_2_5.sgf
		//原文错误，多了 B[jj]
		"(;AB[bs][br][cq][cp][co][dp][bn][bm]AW[bl][cl][cm][cn][do][eo][ep][dq][cr][cs][er]SZ[19]C[（官子）白先。白棋如果利用黑棋的弱点收官？];(;W[ap]C[图1 正解（10分）白棋点三子正中是收官的手筋]N[图1 正解（10分）];B[bp]C[黑棋顶，不得已];W[am];B[ao]LB[al:a][aq:b][an:c][bo:d]C[进行至此，白棋可以保证先手收官。白先手，黑地 5 目。])(;N[图2 变化图 ]W[ap]LB[ao:a][aq:b][bo:c][bq:d]C[图2 变化图 ];B[bq]CR[ap]C[白棋点时，黑棋如果接的话……];W[bo]C[白棋可断];B[bp];W[an]C[这样形成打劫，因此黑棋只能选择图1 的下法。])(;N[图3 失败 （0分）]W[am]C[图3 失败 （0分）白棋单扳是恶手];B[bo]LB[an:a][ao:b][al:c]C[黑棋粘上后，白棋没有后续手段。白先手不变，黑地 6 目，与图1 相比，白损 1 目。])(;W[ap]C[附图1  打劫]N[附图1  打劫];B[bo]CR[ap]C[白棋点时，黑棋粘这里也是错误的];W[bq]C[白棋断];B[bp]C[黑棋只有打];W[aq]C[白棋可接上！];B[ao]C[黑棋只有打];W[ar]C[白多送一子];B[as];W[aq]LB[bq:a][am:b]C[白棋一点，a、b 两点见合，黑被净杀。])(;W[ap]C[附图2  黑棋稍损]N[附图2  黑棋稍损];B[bp];W[am];B[aq]CR[am]LB[ao:a]C[白棋扳时，黑从这里打，图1 黑棋是在 a 位打];W[an];B[bo];W[al];B[ao]C[进行至此，黑地 5 目不变，白棋先手不变，与图1 比较，黑棋梢损，没有了图1 中保留的官子。]))",

		//wqqlzwcs_2_6.sgf
		"(;AB[cr][bq][bp][dq][dp][do][co][eo][fq]AW[dr][ds][eq][fr][gq][fo][fn][en][dn][cn][bn][bo]C[（官子）白先。白棋如何利用黑棋的弱点将外围走干净？]SZ[19](;W[cq]N[图1  正解（10分）]C[图1  正解（10分）白棋扑是绝妙的手筋];B[bs]LB[br:a]C[黑棋补角，必然。];W[ep];B[cp]CR[ep]C[白棋打，黑棋提，白棋先手封住外围。白先手，黑地 6 目。])(;W[cq]C[图2 变化图]N[图2 变化图];B[cp]C[白棋扑时，黑棋提子是大恶手];W[bs]C[白棋点进去，黑棋已回天无术。])(;W[ep]N[图3  失败（0分）]C[图3  失败（0分）白棋单挡];B[cs]C[黑棋也挡，白棋受损。黑地 7 目。白损 1 目。]))",

		//wqqlzwcs_2_7.sgf
		"(;AB[bs][br][bq][cp][dp][ep][cn][go][gp][gq][fr][jq][kq]AW[cs][cr][cq][dq][eq][fq][gr][hq][hp][jp]C[（手筋）白先。目前黑棋来断白棋，白棋应如何同时处理两侧的弱点？]SZ[19](;W[gs]C[图1 正解（10分）白棋下立是同时补左右弱点的形的急所]N[图1 正解（10分）];B[er];W[es]TR[er]C[黑棋长的话，白棋夹即可，白棋安然无恙。])(;W[er]C[图2 失败（0分）白棋打吃黑一子是恶手]N[图2 失败（0分）];B[hr];W[fs];B[ir]C[黑切断外边白棋，白大损。])(;W[hr]C[图3 失败（0分）白棋单接，失手]N[图3 失败（0分）];B[er];W[es];B[fs];W[dr];B[ds]C[这样，难免形成打劫。]))",

		//wqqlzwcs_2_8.sgf
		"(;AW[cr][cq][dq][bp][bo][ep][eo][en][go][gp][hq][hr][jq][dm][cm][dk]AB[cn][dn][dp][cp][eq][er][dr][fp][gq][gr][fr][hp][em][fm][hm]C[（手筋）黑先。下侧黑棋七子已处于危险之中，如果黑棋能发现绝好的次序，可以避免危机。]SZ[19](;B[fo]C[图1 正解（10分）黑棋冲是手筋]N[图1 正解（10分）];W[fn]C[白棋必挡];B[gn]C[黑棋打则是连贯的好棋];W[fq]C[白提子，必然];B[ho]C[黑棋封，进行至此双方必然，可以说是绝对的进行];W[co]CR[go][gp]C[显然，白二子已经接不归了。];B[fp];W[do];B[fo]C[进行至此，下边黑七子已安全连回。])(;B[ho]C[图2 失败（0分）黑棋单挡.这是缺乏计算的表现，左边黑四子只有两气。]N[图2 失败（0分）];W[fo];B[gn];W[co]C[进行至此，黑棋被吃。]))",

		//wqqlzwcs_2_9.sgf
		"(;AW[cq][dr][er]AB[dq][dp][co][fq][gq]C[（死活）黑先。本图是实战中经常出现的棋形。只要能发现第一手棋，以后就比较简单了。]SZ[19](;B[bq]C[图1 正解（10分）黑棋夹是死活的急所]N[图1 正解（10分）];W[br];B[bp];W[ar];B[fr];W[es]C[白棋最大限度地顽强抵抗];B[cs]C[黑棋点后，白棋不能活。])(;B[bq]C[图2 失败（0分）]N[图2 失败（0分）];W[br];B[cp]C[黑棋随手打吃是大恶手];W[cr];B[bp];W[ar];B[fr];W[es]C[进行至此，白棋轻易做活。])(;B[bp]C[图3 失败（0分）黑棋小尖，失误]N[图3 失败（0分）];W[bq];B[br]C[要吃白棋，黑只有夹这一手];W[ar]LB[bs:a][cs:b]C[白棋扳，当然。以下黑 a 则 b，白活。];B[cs];W[cr];B[bs];W[fr];B[gr];W[fs]C[白棋做活。本题正解不难想到，失败图要想全。]))",

		//wqqlzwcs_2_10.sgf
		"(;AB[cs][dr][eq][ep][dp][do][co][bo][bn][fo][go][gp]AW[cr][cp][er][fq][fp][fr][gq][hp][iq][bm][cl][cn][dn][en][eo]C[（死活）白先。现在是黑白相互交错的对杀情形，此时白棋行棋次序正确是极其重要的。]SZ[19](;W[cq]C[图1 正解（10分）]N[图1 正解（10分）];B[dq];W[bs];B[ds];W[ar]C[这是白棋吃黑的正确次序。];B[ap]C[黑棋试图与白对杀];W[bp]LB[aq:a]C[此手非常关键。];B[aq];W[br];B[ao];W[es]C[进行至此，有眼杀瞎。])(;W[cq]C[图2 失败（0分）]N[图2 失败（0分）];B[dq];W[bs];B[ds];W[bp]C[白棋挡是失误];B[br];W[ar]C[白棋只好做劫];B[as]C[进行至此，难免形成打劫。大失败，白棋还是后手劫])(;W[bs]N[图3 失败（0分）]C[图3 失败（0分）白棋打吃];B[cq];W[ds];B[br]C[同样会被黑棋顽强造劫，白棋失败。]))",
	],

	[
		//wqqlzwcs_3_1.sgf
		"(;AB[dc][ce][lc][od][qd][op][oo][oq][pn][pm][pk]AW[dq][do][jq][pq][pr][po][qp][qn][qm][jc][gc]LB[ql:a][lq:b][cj:c][ke:d]C[（布局）黑先。黑棋如何扩张势力是本题的焦点。请在 a、b、c、d 中选择。]SZ[19](;B[ql]C[图1 正解（10分）黑棋在右边虎，是正确的补法]N[图1 正解（10分）];W[je]C[白在上边单跳];B[le]C[黑棋关起，则有将外势变为实地的味道，黑棋充分。])(;B[lq]C[图2 最差点（4分）黑棋在下边拆二，是价值最小的位置]N[图2 最差点（4分）];W[pl];B[ol];W[ql]CR[pl]C[白棋挖、接是追攻黑棋失误的正确方法];B[ok];W[qj]C[进行至此，白棋可在右边出头，白棋非常满足。])(;B[cj]C[图3 次选方法（4分）黑在左边拆，是仅次于正确答案的大场]N[图3 次选方法（4分）];W[pl];B[ol];W[ql];B[ok];W[qj]C[但右边被白棋占据，黑棋不充分。])(;B[ke]C[图4  方向错误（6分）黑棋在上边飞，意图是在攻击白棋二子的同时，扩张自己的势力，但实际上是单方面的设想]N[图4  方向错误（6分）];W[pl];B[ol];W[ql];B[ok];W[qj]C[白棋先在右边动手];B[id]C[黑棋的攻击虽具气势];W[ge];B[ic];W[ie];B[jd];W[gg]C[但进行至此，黑棋在上边收获不大。体会白棋在上边从轻处理的手法。]))",

		//wqqlzwcs_3_2.sgf
		"(;AB[pd][nc][qh][db][fc][hd][ic][hf][do][dn][cn][ci][pp][mq]AW[co][cp][dq][fq][qm][qj][jc][lc][je][jg][cb][cc][dd][cf]LB[qo:a][qe:b][ih:c][jq:d]C[（布局）黑先。黑棋有一非常重要的位置，如果这一位置被白棋占有之后，白棋应掌握了大势的主动权，这一位置在哪里？]SZ[19](;B[qo]C[图1  方向错误（6分）黑棋尖守右下角，并且伺机攻击白棋二子]N[图1  方向错误（6分）];W[hh]C[但白棋飞镇是攻守兼备的好点，黑棋陡然变薄。])(;B[qe]C[图2  次选方法（8分）如果黑棋确实要守角，应首先考虑守右上角]N[图2  次选方法（8分）];W[hh]C[但黑棋守右上角后，被白飞镇占据要点，黑棋不舒服];B[ei];W[rp]C[进行至此，黑棋在实地和外势上均落后。])(;B[ih]C[图3  正解（10分）黑棋飞封，是攻击白棋大龙的要点]N[图3  正解（10分）];W[ki]C[白棋也飞];B[ij]C[黑棋单跳继续追击，黑棋非常满足。与图2 不同的是，图2 中薄弱的黑棋在本图中已大大加强。])(;B[jq]C[图4  最差点（4分）黑在下边拆二是价值最小的位置]N[图4  最差点（4分）];W[hh]C[白棋飞占据要点];B[qo]C[黑棋在右下角小尖守角是黑棋的贪心];W[dl]C[白打入左边极为严厉，黑棋的后续下法极其困难。]))",

		//wqqlzwcs_3_3.sgf
		"(;AB[bc][cc][dc][fc][fb][dr][fq][hp][pq][nq][qp][qo][eh][oc][qd][qe][pf][pg][ph][rh][ri][qi][qk][pl][qm][rl][om][nl]AW[bd][cd][dd][ed][fd][hc][ch][dj][dp][dn][cq][ld][po][pn][pm][qn][rn][ol][ok][pk][pj][pi][qj][rj][qh][qg][qf]LB[kp:a][hh:b][jc:c][mn:d]C[（中盘）黑先。黑棋应首先考虑扩张自己的势力，还是消对方的势力？请在 a、b、c、d 中选择。]SZ[19](;B[kp]C[图1 次选方法（8分）黑棋拆二是防守下边的要点]N[图1 次选方法（8分）];W[gj]C[但白大跳是向中腹扩张的一手很有气势的棋，黑棋对此略有不满。])(;B[hh]C[图2 正解（10分）黑二间跳，牵制中腹白势]N[图2 正解（10分）];W[jq]C[白在下边打入虽具气势];B[iq];W[jp];B[hn]C[但经黑棋这样处理后，黑棋很充分。])(;B[jc]C[图3  最差点（4分）黑在上边打入是价值最小的一手棋]N[图3  最差点（4分）];W[jd];B[kd];W[ke];B[kc];W[id];B[lc]C[进行至此，黑虽可占取实地，但落后手是黑棋的不满];W[gj]C[白争得先手后，抢占中腹大场，白棋有利。])(;B[mn]C[图4  方向错误（6分）同样是防守，本图中的黑棋守方向错误。与图1 相比，本图下边白棋仍有打入的手段]N[图4  方向错误（6分）];W[gj]C[白大跳，形势对黑棋不利。]))",

		//wqqlzwcs_3_4.sgf
		"(;AW[dq][eq][cp][cn][dd][kd][nc][qr][qq][qp][qn][rn][pm][om]AB[ep][fp][fq][em][jp][pp][pq][pr][po][pn][qm][ql][pd][pf]LB[pj:a][mp:b][qi:c][ok:d]C[（中盘）黑先。黑棋如何攻击右边白棋二子是问题的核心，最正确的下法是什么？请在 a、b、c、d 中选择。]SZ[19](;B[pj]C[图1 正解（10分）黑棋在右边飞是正确的手法]N[图1 正解（10分）];W[mm]C[白向中腹单跳];B[nl];W[nm];B[mp]TR[nl]C[黑棋刺、跳又攻又守，黑棋充分。通过进攻，黑棋掌握了局面的主动权。])(;B[mp]N[图2  方向错误（6分）]C[图2  方向错误（6分）黑棋先在下边防守，是方向错误];W[pk]C[白棋跳封很厉害];B[qk];W[pj];B[ri]C[黑只好委屈地在低位行棋];W[ph]C[进行至此，白棋非常满意。])(;B[qi]N[图3 大同小异（6分）]C[图3 大同小异（6分）黑在右边拆二，难免遭受与图2 同样的委屈];W[pk];B[qk];W[pj];B[qj];W[mm]C[进行至此，白棋不再受攻，是黑棋的不满。])(;B[ok]N[图4 黑棋不好（4分）]C[图4 黑棋不好（4分）黑棋飞是最坏的行棋方法];W[mm];B[mp];W[pl]CR[mm]TR[mp]C[白跳与黑棋先手交换后，冲，黑棋无法应。]))",

		//wqqlzwcs_3_5.sgf
		"(;AB[br][cr][dq][dp][er][bp][ak][bk][ck][dl][el][em][en][eo]AW[cq][cp][ao][do][dn][dm][cn][bn][al][bl][cl]C[（官子）黑先。黑棋如何利用白棋弱点而取得官子利益？第一手棋是关键。]SZ[19](;B[bm]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是收官的手筋];W[bo];B[am];W[bq]C[白棋只好做活];B[cm]C[黑提白三子，收获不小。])(;B[bm]C[图2 变化图]N[图2 变化图];W[am]TR[bm]C[黑棋点时，白棋打吃寻求变化];B[bo];W[bq];B[ap];W[aq];B[an]C[进行至此是必然的次序，下成劫活。])(;B[bq]N[图3 失败（0分）]C[图3 失败（0分）黑棋打吃是大恶手];W[bo]C[白只要挡住，里面就成曲四活形。]))",

		//wqqlzwcs_3_6.sgf
		"(;AB[dr][dq][eq][do][cl][el][gl][gp][hp][io][hn]AW[er][fr][hq][iq][ip][kp]C[（官子）黑先。黑棋能先手定型的官子手法是什么？]SZ[19](;B[gr]N[图1 正解（10分）]C[图1 正解（10分）黑棋跨是手筋];W[gq];B[fq];W[hr]C[进行至此，黑棋先手整形。])(;B[es]N[图2 失败（4分）]C[图2 失败（4分）黑棋一路扳是失误];W[fq];B[fp]C[黑落后手])(;B[fq]N[图3 失败（0分）]C[图3 失败（0分）黑棋压是最差的官子手法];W[gr]C[白棋退后，白棋反而得到了一路先手扳粘的机会。]))",

		//wqqlzwcs_3_7.sgf
		"(;AB[cs][cr][dq][eq][ar][fr][fs][aq][ap][bp][co][bn][eo][fo][fp][ho][jp][jq][jr]AW[br][bq][cq][cp][ep][dp][fq][gq][hq][iq][ir][gr]C[（手筋）白先。白棋只有利用被吃住的六子，右侧白棋才能做活。]SZ[19](;W[bs]N[图1 正解（10分）]C[图1 正解（10分）白棋挡下是好棋];B[do];W[er];B[as];W[es]C[白棋可以确保两眼。])(;W[bs]C[图2 变化图]N[图2 变化图];B[dr]CR[bs]C[白棋挡下，黑棋如果粘上……];W[es]C[白棋点是使黑不入子的要点];B[do];W[gs]C[白棋打吃，结果与图1 大同小异。])(;W[gs]N[图3 失败（0分）]C[图3 失败（0分）白棋挡下是大恶手];B[er]C[黑棋粘是好棋];W[ds];B[bs]C[进行至此，白棋被全歼。]))",

		//wqqlzwcs_3_8.sgf
		"(;AW[cr][dq][dp][co][eo][fo][em]AB[cn][dn][do][ep][eq][dr]C[（手筋）黑先。黑棋要不给白棋任何可乘之机，黑棋应如何攻击白棋？]SZ[19](;B[cq]N[图1 正解（10分）]C[图1 正解（10分）黑棋断打];W[cp];B[bp]C[黑反打];W[bq];B[bo]C[黑棋着法紧凑，不给白棋任何机会];W[cq];B[er]C[黑棋粘后，白已被杀。])(;B[er]N[图2 失败（0分）]C[图2 失败（0分）黑棋单接操之过急];W[bo];B[bn];W[bq]C[白在角上已活净，而黑棋被一分为二，处理很困难。])(;B[bo]N[图3 失败（0分）]C[图3 失败（0分）黑棋打吃];W[er]C[白棋断打，结果黑棋失败。]))",

		//wqqlzwcs_3_9.sgf
		"(;AW[bq][bp][co][cn][bn][eo][fo][go][fq][fr][hq][hr]AB[bo][br][cq][cp][dp][ep][fp][er]C[（死活）黑先。在本题中，黑棋求活的次序是什么？如果形成劫活，就意味着失败。]SZ[19](;B[aq]C[图1 正解（10分）黑棋打]N[图1 正解（10分）];W[ao];B[dr]LB[eq:a][cs:b]C[然后退是黑棋做活的正确次序。两点见合，黑棋已活了。];W[eq];B[cs]CR[eq]C[白棋冲时，黑棋做眼即可轻易做活。])(;B[aq]C[图2 失败（0分）]N[图2 失败（0分）];W[ao];B[eq]C[黑棋挡是恶手];W[dr];B[cs];W[ar];B[as];W[cr];B[ds];W[ap]C[进行至此，难免形成打劫。])(;B[aq]C[图3 失败（0分）]N[图3 失败（0分）];W[ao];B[cs]C[黑棋倒虎，自寻烦恼];W[dr];B[eq];W[ar];B[as];W[cr]C[本图结果与图2 大同小异。]))",

		//wqqlzwcs_3_10.sgf
		"(;AB[cs][bs][dr][dq][do][cp][ep][fp][fq][gs][hp][iq][jq][jr]AW[bq][cr][ds][es][er][eq][fr][gr][gq][hr][ir]C[（死活）黑先。黑棋对角上黑子如何利用，结果将大不相同。]SZ[19](;B[aq]N[图1 正解（10分）]C[图1 正解（10分）黑棋托是死活的急所];W[bp]C[白棋如果长……];B[bo];W[ap];B[br]C[进行至此，黑棋可以吃接不归。])(;B[aq]C[图2 变化图]N[图2 变化图];W[bp];B[bo];W[cq]C[白棋打寻求变化];B[dp];W[ap];B[ar]C[黑棋退，轻松吃住白棋。])(;B[bp]N[图3 失败（0分）]C[图3 失败（0分）黑棋单挡];W[aq]C[白棋立下占据急所];B[ap];W[br]C[白可做活。]))",
	],

	[
		//wqqlzwcs_4_1.sgf
		"(;AB[pq][qo][lp][pd][qc][qb][pf][ph][cb][cd][cc][ce][cf][de][be][ed][ec][eb][fb][gd]AW[db][dc][dd][fc][fd][fe][ee][gc][gb][df][dh][dp][fp][jp][pc][oc][nd][nf]LB[kd:a][mi:b][kn:c][co:d]C[（布局）白先。白棋如何扩张上边白势是关键，如再能适当牵制右边黑势，则会锦上添花。请在 a、b、c、d 中选择。]SZ[19](;W[kd]C[图1 最差点（4分）白棋在上边拆，虽确实能防守上边，但上边白子重复。]N[图1 最差点（4分）];B[mi]C[黑棋向中腹大飞，是双方势力消长的要点。])(;W[mi]C[图2 正解（10分）白棋大飞是不可放过的要点，在目前双方均以大模样相对峙的情况下，这样的要点往往谁先抢占到谁就有利。]N[图2 正解（10分）])(;W[kn]C[图3 方向错误（6分）白棋在下边飞，虽不失为扩张的要点，但实际上方向错误。]N[图3 方向错误（6分）];B[mh]C[黑棋大跳是绝好点];W[lg];B[lh];W[kg];B[kh];W[jg]C[白棋重点防守上边];B[mn]C[黑棋抢到下边飞的要点，黑棋满意。])(;W[co]C[图4 白势萎缩（6分）白棋尖守左下角]N[图4 白势萎缩（6分）];B[mh]C[但黑棋跳后，上边白势受到限制，白棋不满。];W[kn]C[其后白棋飞虽具气势……];B[lg];W[le];B[jg]TR[lg]C[黑棋尖、跳以后，白棋势力大幅萎缩。]))",

		//wqqlzwcs_4_2.sgf
		"(;AB[pd][oc][qe][ql][po][pq][ck][cn][cp][cq][fq][gp]AW[dd][jc][mc][qg][qj][dp][eq][fp][fo][go][ip]LB[lq:a][ci:b][fd:c][oj:d]SZ[19]C[（布局）白先。白棋应充分考虑周边棋子的布置，方可找出最有利的位置。请在 a、b、c、d 中选择。](;W[lq]C[图1 正解（10分）白棋在下边展开是全盘最大的大场，与黑棋占据下边相比，差别很大。]N[图1 正解（10分）];B[cf]C[其后黑在左边挂];W[fd]C[白棋则单关应，白棋充分。])(;W[ci]C[图2 方向错误（6分）白棋在左边拦，方向错误。虽可防止黑棋在左边挂角，但……]N[图2 方向错误（6分）];B[kq]C[但黑棋占据下边要点之后，白棋不满。])(;W[fd]C[图3 白地破碎（6分）白棋单关守角同样是方向错误]N[图3 白地破碎（6分）];B[kq]C[黑棋在下边拆是绝好点];W[ci]C[白棋如再次扩张左上势力……];B[gq]C[黑棋接是准备好的手段];W[er];B[iq]C[进行至此，白地被破。])(;W[oj]C[图4 黑棋活跃（6分）白在右边跳起]N[图4 黑棋活跃（6分）];B[kq]C[黑棋在下边拆是好点];W[ir]C[白跳补];B[cf];W[fd];B[ol]C[黑棋左上角与白棋交换一手后，再跳起守右下，黑棋好调。]))",

		//wqqlzwcs_4_3.sgf
		"(;AB[pc][qe][pq][op][fq][hp][ip][io][jo][kn][in][jm]AW[dd][cp][dq][cm][qo][jp][jq][iq][ko][lo][ln]LB[qp:a][lq:b][jc:c][lm:d]C[（中盘）黑先。为确保优势，黑棋应如何攻击白棋棋形上的弱点？请在 a、b、c、d 中选择。]SZ[19](;B[qp]C[图1 错过机会（6分）黑棋尖顶，在捞取实地的同时，攻击白棋一子]N[图1 错过机会（6分）];W[ll]C[但被白跳出之后，黑棋的攻击效果要比预想的差很多。])(;B[lq]C[图2 正解（10分）黑棋在下边点方，问白棋的应手，是正确的攻击要领]N[图2 正解（10分）];W[lp];B[mq];W[ll];B[pn]TR[mq]CR[lp][ll]C[白棋顶、跳，黑棋则退、飞封，在捞取实地的同时，大范围攻击白棋，黑棋满意。])(;B[jc]C[图3 方向错误（6分）黑棋占上边大场，虽令人瞩目，却是脱离主战场的缓棋]N[图3 方向错误（6分）];W[nq]C[这样白棋有了安定的机会。])(;B[lm]C[图4 大同小异（6分）黑棋扳头，同样没有抓住要害]N[图4 大同小异（6分）];W[mm];B[ll];W[nq]C[白与黑交换一手后，占据下边要点，白棋轻易安定。]))",

		//wqqlzwcs_4_4.sgf
		"(;AW[cq][pq][oq][qp][po][qi][oi][og][lg][jf][jd][kd][fc][db][cb][cc][cd][cf]AB[nq][np][op][jp][pl][nl][oc][qd][qg][jc][ic][id][ie][dd][dc][de][ec][eb]LB[on:a][lc:b][eq:c][gp:d]C[（中盘）黑先。黑棋虽无特别急的位置，但最实惠的位置应成为正确答案。请在 a、b、c、d 中选择。]SZ[19](;B[on]C[图1 闲棋（4分）黑封锁白棋几乎是闲棋]N[图1 闲棋（4分）];W[fp]C[白棋大飞，是捞取实地和牵制黑势的正确选点，黑棋不满。])(;B[lc]C[图2 大同小异（4分）黑棋在上边跳出，单纯捞取实地]N[图2 大同小异（4分）];W[hp]C[白棋占据要点之后，黑棋落后。])(;B[eq]C[图3 正解（10分）目前局面的焦点在下边，黑棋挂是最应优先考虑的点]N[图3 正解（10分）];W[co];B[gp]CR[co]C[白补棋时，黑防守下边];W[nn];B[ll]C[黑棋舒服。])(;B[gp]C[图4 次选方法（8分）黑棋在下边高拆二，同样是重视下边的手法，但选点有误。]N[图4 次选方法（8分）];W[eq]C[白棋拆一是确保实地的下法，黑棋略不满。]))",

		//wqqlzwcs_4_5.sgf
		"(;AW[br][cr][dr][cq][cp][bo][ao][do]AB[co][cn][cm][bn][dp][dq][eo][fq][er][ds][es]C[（官子）黑先。黑棋如何借威胁白棋的死活来先手收官？]SZ[19](;B[bs]N[图1 正解（10分）]C[图1 正解（10分）黑棋托是收官的手筋];W[aq];B[cs];W[bp]C[白棋不得不后手做活。白地 2 目，黑先手。])(;B[bs]C[图2 变化图]N[图2 变化图];W[cs]TR[bs]C[黑棋托时，白棋打吃无理];B[aq];W[bp]LB[bq:a];B[ar]C[进行至此，劫活成为白棋的巨大负担。万年劫。对于双方来说都很麻烦。])(;B[cs]N[图3 失败（0分）]C[图3 失败（0分）黑棋单冲];W[bs]C[白棋挡下后，黑棋失败];B[aq];W[bq]TR[aq]C[黑棋再点时，白棋接上即可，白安然无恙。白地 5 目。黑损 3 目，差距很大。])(;B[bs]C[附图1 白棋防守失败黑棋托是官子手筋]N[附图1 白棋防守失败];W[cs]C[白棋打吃无理现在我们来分析以下白棋以后的防守方法];B[aq]LB[bp:a]C[黑棋点，绝对。以下，白棋粘 a 位就成为图2];W[bq];B[ar]C[这样，角上形成紧劫，白的先手劫。与图2 相比，白防守失败，万年劫当然要比紧劫好。])(;B[aq]LB[bp:a]N[附图2 黑损]C[附图2 黑损黑棋直接点又如何？白棋必须紧住黑棋的气，否则黑棋可在 a 位断。];W[ar]C[白棋挡];B[cs]LB[bs:a]C[黑棋直接冲即可，没必要在 a 位玩花哨了，白不能在 a 位挡];W[bq];B[bs];W[ap]C[白地 3 目，与图1 相比，黑损 1 目。])(;B[aq]C[附图3 黑损]N[附图3 黑损];W[bq]TR[aq]C[黑棋直接点，白棋团抵抗];B[bs]C[黑棋托];W[ar];B[cs];W[ap]C[白地 3 目，与图1 相比黑损 1 目。]))",

		//wqqlzwcs_4_6.sgf
		"(;AW[cj][ej][fl][fn][fp][eq][er][es][ds][dp][do][co][bo][bm]AB[ao][bp][cp][dq][dr][cs][br]C[（官子）白先。白棋如能正确利用黑棋形上的弱点，会在收官上取得收获。第一手棋是关键。]SZ[19](;W[ar]N[图1 正解（10分）]C[图1 正解（10分）白棋托是巧妙的官子手筋];B[bs]C[黑棋团是最强抵抗];W[ap];B[aq];W[an]LB[ap:a]C[进行至此，白棋收官得益，以后黑棋仍须补一手棋。黑地 5 目，白棋提大致是先手，扑一子，提回一子，目数不损。])(;W[ar]C[图2 变化图]N[图2 变化图];B[ap]C[黑棋接无理];W[bs];B[cr];W[bq]C[角上形成打劫，这是白的无忧劫。])(;W[an]N[图3 失败（0分）]C[图3 失败（0分）白棋单打];B[ap]C[黑棋接上后，角上已无手段。黑地 7 目，白损 2 目。])(;W[ar]LB[bs:a]C[附图 另法白棋在一线托是巧妙的官子手筋]N[附图 另法];B[aq]C[现在黑棋打];W[an]LB[ap:a]C[以后白 a 位提大致是先手，角上黑得补一手棋。黑地 6 目，白提子得 1 目。与图1 没有差别。]))",

		//wqqlzwcs_4_7.sgf
		"(;AW[bq][cq][dp][eq][eo][en][dn]AB[bp][cp][co][cn][do][dm][dl][fm][hn][hp][gq]C[（手筋）黑先。黑棋一手棋就能破白棋眼位的要点在何出？]SZ[19](;B[er]C[图1 正解（10分）黑棋托极其严厉]N[图1 正解（10分）];W[dr];B[fr]C[进行至此，白棋整体没有两只眼。])(;B[er]C[图2 变化图];W[fr]TR[er]C[黑棋托时，白如果外扳……];B[dr]LB[fq:a][dq:b]C[黑棋长进去是准备好的手段。白棋崩溃。];W[fq];B[dq];W[ep];B[br]C[进行至此，白棋全部被歼。])(;B[fr]C[图3 失败（0分）]N[图3 失败（0分）];W[er]TR[fr]C[黑棋尖，白棋挡，黑棋失败。]))",

		//wqqlzwcs_4_8.sgf
		"(;AW[bq][cq][dr][er][fr][fq][gp][go][ip][dk]AB[bp][dp][dn][eq][fp][fo][gn][gq][hq]C[（手筋）黑先。黑棋如何借攻击白棋谋求出头？]SZ[19](;B[jp]C[图1 正解（10分）黑棋碰是出头的手筋]N[图1 正解（10分）];W[io]C[白棋双];B[iq]C[黑已成功出头。])(;B[jp]C[图2 变化图]N[图2 变化图];W[iq]TR[jp]C[黑棋碰时，白棋挡下];B[hp];W[ho];B[io]C[黑棋冲断];W[hn];B[ir]C[进行至此，白棋二子被吃，黑棋非常满足。])(;B[hp]C[图3 失败（0分）]N[图3 失败（0分）];W[ho];B[io]C[黑棋直接冲断是典型的俗手];W[hn];B[jp];W[in];B[jo];W[gm]LB[iq:a][ir:b]C[进行至此，与图2 的差别很大。图2 白棋多送了一子，白大恶。]))",

		//wqqlzwcs_4_9.sgf
		"(;AB[cr][es][er][eq][fq][gq][gr][fs]AW[bq][cq][dp][ep][fp][gp][hp][hq][hr][hs][gs]C[（死活）白先。白棋如何通过巧妙的次序而吃住黑棋？]SZ[19](;W[cs]N[图1 正解（10分）]C[图1 正解（10分）白棋夹是手筋];B[br];W[ar];B[bs];W[dr]C[白棋打后，显然黑棋已没有两眼。])(;W[cs]C[图2 变化图]N[图2 变化图];B[br];W[ar];B[ds]C[黑棋打寻求变化];W[dq]C[白棋先挤是好次序];B[dr];W[bs]C[结果黑棋只有一只眼。])(;W[br]N[图3 失败（0分）]C[图3 失败（0分）白棋挡下];B[cs];W[dq];B[dr]C[本图白棋失败]))",

		//wqqlzwcs_4_10.sgf
		"(;AB[bq][cp][bo][do][eo][fo][gp][ip][iq][hp][ir][hr][gs][es]AW[cq][dq][dp][ep][fp][eq][fr][gr][gq][hq][fs]C[（死活）黑先。如果黑棋不经过周密计算，肯定会失败。黑棋如何才能吃住白棋？]SZ[19](;B[br]N[图1 正解（10分）]C[图1 正解（10分）黑棋立下是冷静的好棋];W[ds];B[dr];W[cr];B[cs]LB[er:a]C[由于 a 位不入子，白棋被杀。])(;B[cr]N[图2 劫（4分）]C[图2 劫（4分）黑棋扳];W[dr];B[ds];W[br];B[bs]C[黑棋只有做劫了，与正解相比，黑棋大损。])(;B[cs]N[图3 失败（0分）]C[图3 失败（0分）黑棋在底线跳是过于偏重心情的一手];W[br];B[cr];W[dr]C[白棋轻易做活。]))",
	],

	[

		//wqqlzwcs_5_1.sgf
		"(;AB[pd][pj][fq][jp][mp][nq][pq][po][qo]AW[dd][dp][dn][mo][lo][oo][on][pn][qn]LB[nc:a][qf:b][jd:c][ci:d]C[（布局）黑先。黑棋如果忽视下边白棋的外势，则会碰壁。请在 a、b、c、d 中选点。]SZ[19](;B[nc]C[图1 方向错误（6分）黑棋在右上守角，并间接支援右边黑棋，但下侧白棋外势过强，所以黑棋守角的方向错误。]N[图1 方向错误（6分）];W[qh]C[白棋在右边打入后，右边黑棋一子处理不容易。])(;B[qf]C[图2 正解（10分）黑棋在右边小飞守角，间接支援右边黑棋一子是好棋]N[图2 正解（10分）];W[di]C[其后白占据左边大场];B[jd]C[黑则可在上边扩张势力，黑棋舒服。])(;B[jd]C[图3 时机不成熟（6分）黑棋在上边拆，虽是扩张的要点，但……]N[图3 时机不成熟（6分）];W[pf]C[但被白在右上高挂];B[nd];W[nf];B[nj];W[lf];B[ld];W[lj]TR[jd]C[进行至此，黑棋很难处理被白棋包围的两子。这说明了了黑棋当初在上边开拆的时间不成熟。白棋的这招手法值得学习。])(;B[ci]C[图4 大同小异（6分）黑棋在左边分投，结果与图3 大同小异。由于上边和左边都存在大场，因此黑棋分投实际上并不应如此着急。]N[图4 大同小异（6分）];W[pf]C[白在右上高挂之后，黑棋困难。]))",

		//wqqlzwcs_5_2.sgf
		"(;AB[pd][pj][fq][jp][mo][mn][op][po][qo][qp][rp][pq][nq][or]AW[dd][dp][cn][lo][mp][np][no][oo][on][pn][qn][ro][rq]LB[mk:a][qf:b][jd:c][ci:d]C[（布局）黑先。目前的形势是黑棋实地领先，黑棋应对白棋的外势加以限制。请在 a、b、c、d 中选点。]SZ[19](;B[mk]C[图1 正解（10分）黑棋大跳是牵制白棋外势的正确手法，以后黑还可伺机攻击白棋大块，同时也间接补了下边的弱点。]N[图1 正解（10分）])(;B[qf]C[图2 方向错误（6分）黑棋在右上守角，虽同样是牵制白棋外势的一手，但方法错误。]N[图2 方向错误（6分）];W[nj]C[白棋镇，巩固自己的棋形，同时也是扩张的要点，全局白厚。这招很值得学习。])(;B[jd]C[图3 黑薄（6分）黑棋在上边拆是步调快的作战]N[图3 黑薄（6分）];W[ln]C[但白棋占据要点之后，黑棋不满。];B[qf];W[hc]C[黑棋守角、白棋拆之后，黑棋显得薄弱。]TR[qf])(;B[ci]C[图4 最差点（4分）黑棋在左边分投是价值最小的位置]N[图4 最差点（4分）];W[cg];B[cl]CR[cg]C[白棋逼，黑棋拆二，瞄着白角上弱点];W[ln]C[但白占据要点之后，黑棋下边和右边均呈薄形，能否断然对白角地动手将成疑问。白棋厚实，值得好好体会。]))",

		//wqqlzwcs_5_3.sgf
		"(;AB[kc][ke][ne][pd][qd][qc][rd][qf][qp][oq][ge][cg][dg][df][cj][cm][cn][cp][cq]AW[nc][pc][pb][qb][rb][rc][qj][qm][mq][jq][gq][dq][dp][do][dd][ce][cf][fc][ic]LB[fm:a][oo:b][qh:c][ie:d]C[（中盘）黑先。黑棋在考虑周边棋子的布置后，有无发现扩张黑势的要点在何处？请在 a、b、c、d 中选点。]SZ[19](;B[fm]C[图1 正解（10分）黑棋向中腹大跳正确。由于黑棋的跳能与上边黑棋外势形成呼应，全局黑棋充满活力。]N[图1 正解（10分）])(;B[oo]C[图2 方向错误（4分）黑棋关虽然也是向中腹出头，但方向错误]N[图2 方向错误（4分）];W[em]C[白棋飞是势力消长的要点];B[mo]C[黑棋单跳，虽有削白势的作用，但……];W[co];B[bo];W[bn];B[bp];W[dl];B[cl];W[dk]C[进行至此，黑棋左边和上边外势被破坏，黑棋不满。])(;B[qh]N[图3 时机不成熟（4分）]C[图3 时机不成熟（4分）黑棋拆一，伺机攻击右边白棋二子，而且在实地上也很可观，但目前时机不成熟。];W[fl]C[白棋此手在扩张下边白势的同时，也是侵消黑势的要点，黑棋非常不利。注意白棋选点的位置，与图2 比较。])(;B[ie]N[图4 大同小异（4分）]C[图4 大同小异（4分）黑棋在上边封锁，显得过于重复];W[fl]C[白棋占据要点之后，上边黑势几乎无使用价值。]))",

		//wqqlzwcs_5_4.sgf
		"(;AB[pd][qp][qo][kp][mq][iq][hq][gq][hp][fp][ep][dp][eq][cq][cr][bp][bo]AW[dd][qq][rq][pp][op][cp][co][cn][dq][fq][gp][go][fo][ho][io][ip]LB[dj:a][jd:b][ql:c][nr:d]C[（中盘）白先。目前的情况是白棋以外势与黑棋的实地相对抗，白棋应如何利用外势？请在 a、b、c、d 中选点。]SZ[19](;W[dj]C[图1 正解（10分）白棋在左边展开，是充分利用下边白棋外势的手法]N[图1 正解（10分）];B[ql]C[黑棋如果在右边拆……];W[nq];B[mp];W[jd]TR[mq]CR[nq]C[白棋在下边与黑棋交换以后后，白在上边展开，实施连贯的外势作战，全局白棋广阔。])(;W[jd]C[图2 方向错误（6分）白在上边开拆虽是要点，但方向错误]N[图2 方向错误（6分）];B[ql];W[nq];B[ci]TR[ql]CR[nq]C[黑棋在右边与白棋交换一手之后，再在左边分投是好次序。白势上下被分割，不能发挥更大威力。])(;W[ql]N[图3 操之过急（6分）]C[图3 操之过急（6分）白在右边发起攻击操之过急];B[ci]C[黑棋在左边分投正确];W[cg];B[dl]CR[cg]C[白棋拦时，黑棋大飞，下边白棋反而有可能受攻。])(;W[nr]N[图4 最差点（4分）]C[图4 最差点（4分）白棋在下边飞守，只不过是官子行为];B[ci]C[黑在左边分投之后，白棋难以取得好结果];W[cg]C[白棋拦，试图攻击];B[dl];W[bn];B[fm];W[eo];B[ei]C[但进行至此，黑棋不再受攻。]))",

		//wqqlzwcs_5_5.sgf
		"(;AW[bq][cq][dq][dp][do][dn][el][em][ek][dk][ck][bk][ak]AB[al][bl][cl][dl][dm][cn][co][cp][bp]C[（官子）白先。白棋借威胁黑棋死活来先手收官的方法是什么？]SZ[19](;W[ao]N[图1 正解（10分）]C[图1 正解（10分）白棋点是手筋];B[bm]C[黑棋只有求活];W[ap];B[an]LB[bo:a]C[白棋先手收官。黑地 3 目（黑大致是先手，可走到），白先手。])(;W[ao]C[图2 变化图]N[图2 变化图];B[ap]CR[ao]C[白棋点时，黑挡下无理];W[bn];B[bo];W[am]C[白劫杀黑棋。])(;W[ap]C[图3 失败（0分）]N[图3 失败（0分）];B[ao];W[aq]C[白棋简单扳粘];B[bn]C[黑棋补后，白失败。白先手，黑地 5 目，与图1 相比，白损 2 目。])(;W[ao]C[附图 有趣的变化白棋点]N[附图 有趣的变化];B[ap]C[黑棋挡下];W[bn]LB[bo:a][am:b][bm:c]C[白棋尖，绝对。以下，黑 a 则白 b，成劫。黑 c 的话，白可直接在外边紧气走成双活，或者在 b 位扑劫。];B[am]LB[aq:a][bm:b]C[黑棋曲的抵抗很有意思。以下白 a 黑 b，双活，白还是先手，黑地只有 1 目，黑比图1 还要差。显然，白棋不会在里面走棋了，否则黑都简单做活。];W[aq]C[白棋紧气];B[an]C[黑棋打吃];W[cm]C[白棋扑，绝妙，形成双倒扑。]))",

		//wqqlzwcs_5_6.sgf
		"(;AB[bq][cq][er][fr]AW[bp][co][dp][ep][eq][gq][hq][cm]C[（官子）白先。白棋虽不能吃住全部黑棋，但可以取得官子上的便宜。]SZ[19](;W[br]N[图1 正解（10分）]C[图1 正解（10分）白棋夹是手筋];B[ar]C[黑棋扳，绝对];W[dr]C[白棋扳下又是好棋];B[cr]C[黑只得打吃];W[dq];B[bs]C[黑提子无奈];W[ds]C[白棋成功地割掉黑棋二子。])(;W[dr]N[图2 次序错误（4分）]C[图2 次序错误（4分）白棋先扳是次序错误];B[dq]C[黑必断];W[br]C[白棋再夹已经晚了];B[cr];W[aq];B[bs];W[ar];B[gr];W[hr];B[gs]C[进行至此，黑棋安全做活，白棋意思不大。])(;W[aq]C[图3 失败（0分）]N[图3 失败（0分）];B[ar];W[ap]C[白棋简单扳粘是最坏的收官方法。];B[cr]))",

		//wqqlzwcs_5_7.sgf
		"(;AB[cp][dq][eq][fp][ip]AW[ep][fq][ho]C[（手筋）白先。白棋有常用的分断黑棋的手筋，你知道怎样下吗？]SZ[19](;W[fo]C[图1 正解（10分）白从上面打吃是正确的方向]N[图1 正解（10分）];B[gp];W[hp]TR[gp]C[黑棋长后，白棋冲下是好棋];B[gq];W[hq]C[进行至此，白可分断黑棋。])(;W[hp]N[图2 白棋不满（4分）]C[图2 白棋不满（4分）白棋单长的手段虽也可成立……];B[fo]C[但黑棋长后，白棋不满。])(;W[gp]N[图3 失败（0分）]C[图3 失败（0分）白棋打是典型的俗手];B[fo]C[黑棋长后，白棋受损。]))",

		//wqqlzwcs_5_8.sgf
		"(;AB[bp][bo][do][dp][ep][fp][go][gm][gl][hk][gq][gr][hr][kq]AW[bq][cq][dq][eq][fq][hp][gp][hq][fo][eo][em][fl][cn][bm][cl]C[（手筋）黑先。黑棋如不能吃住右侧白棋三子，左侧黑棋数子将会很痛苦地被歼。]SZ[19](;B[io]N[图1 正解（10分）]C[图1 正解（10分）黑棋枷是手筋];W[iq];B[ir];W[jp]C[白棋这样逃跑];B[jq];W[ip];B[ko];W[dn];B[ho]C[对杀黑快一气。])(;B[io]C[图2 变化图]N[图2 变化图];W[jq]C[白棋碰];B[iq]C[黑棋挖是好棋];W[ip];B[jp]C[白棋仍然被吃])(;B[gn]N[图3 失败（0分）]C[图3 失败（0分）黑棋单接];W[dn]C[白棋直接紧气，开始对杀];B[io];W[cp];B[co];W[ap]C[黑棋少一气被吃。])(;B[io]C[附图]N[附图];W[iq];B[ir];W[jq]C[白棋顶，寻求变化];B[jp]LB[ho:a]C[黑棋要紧住气走这样白棋被吃。白棋 a 位的冲并没有意义，请自行验证。]))",

		//wqqlzwcs_5_9.sgf
		"(;AW[bq][dr][co][cp][bo][bn]AB[cq][bm][cl][cn][dn][dp][ep][eq][er]C[（死活）黑先。黑棋应考虑无条件地吃住白棋的方法。]SZ[19](;B[br]C[图1 正解（10分）]N[图1 正解（10分）];W[cr];B[bs]TR[br]C[黑棋扳、立是吃住白棋的正确次序];W[dq];B[ds]C[显然，白棋只能做出一只眼来。])(;B[br]C[图2 参考图]N[图2 参考图];W[cr];B[cs]C[黑棋扳不好];W[ar]C[白棋打，活了。])(;B[cr]N[图3 失败（0分）]C[图3 失败（0分）黑棋挡是最简单的下法];W[br];B[bs];W[ap]C[白棋轻易做活。]))",

		//wqqlzwcs_5_10.sgf
		"(;AB[bq][cr][cp][eq][do][dn][dm][em][fn][gn][gp][hp][io][iq][ir][hr]AW[dp][dq][dr][eo][en][fo][fp][gq][hq][gr][gs][hs]C[（死活）黑先。黑棋如能熟练掌握死活的图形，问题就会简单。]SZ[19](;B[es]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是急所];W[ds]C[白棋挡下];B[er]C[黑棋棒接即可吃住白棋。])(;B[er]N[图2 失败（0分）]C[图2 失败（0分）黑棋夹];W[es]C[白棋扳];B[fr];W[fq]C[双活，黑失败。])(;B[fq]N[图3 失败（0分）]C[图3 失败（0分）黑棋断];W[fr]C[白棋平，黑已无法吃住白棋。]))",
	],

	[

		//wqqlzwcs_6_1.sgf
		"(;AW[dd][dj][dp][dn][qh][qi][qj][oi][oh][pk][ok][qn][pm][rm][po][op]AB[qd][oc][fq][ip][oq][pq][nq][qo][qp][pj][qk][ql][rj][ri][rh][qg][pg]LB[mo:a][dr:b][nf:c][jd:d]C[（布局）白先。白棋如何最大限度地利用右边外势以获取利益？请在 a、b、c、d 中选择。]SZ[19](;W[mo]N[图1 方向错误（6分）]C[图1 方向错误（6分）白棋飞，其意图是限制黑棋下边的同时向中腹扩张，但方向错误。];B[jd]C[黑棋在上边展开正确];W[lp];B[fc]CR[lp]C[白棋尖、黑棋挂是双方具有气势的进行。黑棋心情不错。])(;W[dr]N[图2 大同小异（6分）]C[图2 大同小异（6分）白在左下补角，并且试图打入下边];B[jd]C[但黑占据上边要点之后，白棋难以满足];W[hc]C[白棋阻止黑棋继续发展];B[mn]C[黑棋大飞则又是绝好点。])(;W[nf]N[图3 最差点（4分）]C[图3 最差点（4分）白棋飞是价值最小的位置];B[jd];W[hc];B[nj]C[黑棋以下开始整形];W[oj];B[nn];W[om];B[ln]C[黑棋极为满足，白棋大龙不仅未能变成外势，反而受攻。])(;W[jd]N[图4 正解（10分）]C[图4 正解（10分）白在上边展开是考虑到周边棋子位置的正确下法];B[mn]C[黑如果飞起牵制白棋外势……];W[mc]C[白则占取上边，白棋很充分。]))",

		//wqqlzwcs_6_2.sgf
		"(;AB[pc][qe][op][pq][qp][qo][cf][bd][dh][cn][ck]AW[dd][fc][cc][dq][cp][jq][po][pn][qn][qj]LB[kc:a][mq:b][qg:c][rn:d]C[（布局）白先。就目前来看，最大的大场就是正确的答案。请在 a、b、c、d 中选择。]SZ[19](;W[kc]C[图1 正解（10分）白棋在上边展开是全盘最大的地方]N[图1 正解（10分）];B[lq]C[黑棋取下边大场];W[nc]C[白再在上边拆，白棋完全可以维持局面的平衡。])(;W[mq]C[图2 次选方法（8分）白在下边拆二是除上边以外最大的地方，但缺乏明显的后续手段，是白棋的不满。]N[图2 次选方法（8分）];B[hc]C[黑棋在上边逼是绝好点];W[bc];B[qh]C[黑拆右边，黑棋形势不错。])(;W[qg]C[图3 方向错误（6分）白在右边拆二，右边是三条边中价值最小的]N[图3 方向错误（6分）];B[hc]C[黑棋在上边逼很积极];W[bc];B[kd]CR[bc]LB[ld:a]C[白棋挡角后，黑棋再围上边，黑棋舒服。])(;W[rn]C[图4 最差点（4分）白棋立是全盘价值最小的位置]N[图4 最差点（4分）];B[lq]C[黑在下边拆是有所防备的好棋];W[kc]C[其后白在上边拆];B[mc]C[进行至此，白棋显得薄弱。]))",

		//wqqlzwcs_6_3.sgf
		"(;AB[qc][qb][pd][qf][md][jc][je][jg][qp][oq][cq][br][cr][dr][fq][ei][ek][ci][ch][cf]AW[dc][cd][gc][gf][dh][ck][bq][cp][dp][dq][cn][lc][mc][nc][le][pb][qh][qj][qm]LB[hq:a][jq:b][lg:c][dl:d]C[（中盘）白先。白棋如何采取主动的作战方法以求控制局面？请在 a、b、c、d 中选择。]SZ[19](;W[hq]N[图1 正解（10分）]C[图1 正解（10分）白棋在下边夹是正确的。不容易想到。不过立即动手攻击黑棋一块，似乎也没有好的办法。];B[jq]C[黑棋如果反夹……];W[ho]C[白棋跳是冷静的好棋，以后白可伺机攻击黑棋上边和左边，甚至还可以攻击左下角黑棋，结果白棋充分。])(;W[jq]N[图2 次选方法（8分）]C[图2 次选方法（8分）白棋在下边打入多少有点死板];B[lq]C[黑棋逼];W[hq];B[gq];W[hp]C[白棋虽能安定];B[fo]C[但却给了黑棋成功出头的机会。])(;W[lg]C[图3 方向错误（6分）白棋单跳，虽可攻击黑棋大龙，但……]N[图3 方向错误（6分）];B[fo]C[但黑棋从下边跳起后，左边黑棋已得到安定，下边黑势也得到扩大。上边黑棋虽然受攻，但也不易被吃住。])(;W[dl]N[图4 最差点（4分）]C[图4 最差点（4分）白棋尖是最消极的手法];B[iq]C[黑棋得到了拆边的机会。]))",

		//wqqlzwcs_6_4.sgf
		"(;AB[pd][qe][pb][ic][fc][db][do][dn][cn][dj][pp][qn][qq][qr][kp][iq][hq][gr][fr][er]AW[dd][cc][cf][co][cp][dq][dr][eq][fq][gq][hp][pr][nq][oo][om][ql][qj][qg][nb][kc]LB[nd:a][ch:b][fe:c][og:d]C[（中盘）黑先。一旦抢占了盘上的要点，其好处大概比想象的还要多。请在 a、b、c、d 中选择。]SZ[19](;B[nd]C[图1 黑棋不满（6分）黑棋跳，虽是攻击白棋二子的手段，……]N[图1 黑棋不满（6分）];W[ch]C[但被白占据要点之后，黑棋缺乏明显的后续手段，这是黑棋的不满。])(;B[ch]C[图2 正解（10分）黑棋飞是利益最大的位置]N[图2 正解（10分）];W[cb]C[白棋挡角];B[je]C[黑棋再向中腹飞出，即可主导局面。])(;B[fe]N[图3 方向错误（6分）]C[图3 方向错误（6分）黑棋向中腹单跳，是方向错误];W[ch]C[这样白有机会占据要点];B[cj]C[黑棋并防守左边];W[ke]C[白棋则向中腹跳出，黑棋不满。])(;B[og]C[图4 最差点（4分）黑棋镇完全是方向错误。]N[图4 最差点（4分）];W[ch];B[cj];W[nd]C[白棋一连占据两处要点，黑棋不知道应该下在哪里，白棋对结果极其满意。]))",

		//wqqlzwcs_6_5.sgf
		"(;AW[bq][bp][co][do][eo][fp][gp][hp][hq]AB[cp][dp][ep][cr][fq][gq][hr][iq][jq]C[（官子）白先。白棋如何利用黑棋形的弱点，在官子上占便宜？]SZ[19](;W[dr]N[图1 正解（10分）]C[图1 正解（10分）白棋碰是急所];B[er]C[黑棋无奈退让];W[cq];B[ds];W[dq];B[eq];W[bs]C[进行至此，白棋已获得角地。])(;W[dr]C[图2 变化图]N[图2 变化图];B[cq]C[黑棋接无理];W[eq]C[白棋断，极其严厉];B[er]C[黑棋打];W[fr]C[白棋反打是手筋，黑棋无法收拾。])(;W[cq]C[图3 失败（0分）]N[图3 失败（0分）];B[dr]))",

		//wqqlzwcs_6_6.sgf
		"(;AB[ar][bq][cq][cp][ep][do][en][em][dm][dl]AW[aq][ap][bp][bo][cn][dn][cl][dk][ek][ci]C[（官子）黑先。黑棋以正确的次序，攻击白棋的弱点，会占到很大的便宜？]SZ[19](;B[bn]N[图1 正解（10分）]C[图1 正解（10分）黑棋挤是绝妙的手筋];W[bm]C[白棋如果打的话……];B[an];W[am];B[cm];W[ao];B[bl];W[ck]C[进行至此都是必然];B[co]C[黑棋打吃，冷静];W[bk]C[白棋打吃，绝对];B[bn]C[黑棋提子之后，白五子接不归。本图实际上也是白棋最佳防守。])(;B[cm]C[图2 失败（0分）]N[图2 失败（0分）];W[bm];B[bl]C[黑棋简单冲断];W[ck]C[但白棋接后，黑棋一无所获。]))",

		//wqqlzwcs_6_7.sgf
		"(;AB[br][bq][cq][cp][dr][es][fs][fr][gq][gp][ho][bo][bn][cn][dm][dl][ck]AW[bp][ap][co][dn][do][dp][dq][er][eq][fq][em][fn][gr][hr][iq]C[（手筋）白先。白棋攻击黑棋形上弱点的手段是什么？如能成劫，即大获成功。]SZ[19](;W[bs]N[图1 正解（10分）]C[图1 正解（10分）白在底线托是绝妙的手筋];B[ds]C[黑棋接];W[cr]C[白棋可以扑];B[cs];W[ar]C[这样成劫。黑先手劫，缓一气。])(;W[bs]C[图2 变化图]N[图2 变化图];B[ds];W[ar]C[白棋单扳不好];B[cr]C[黑棋接，白一无所获。])(;W[ar]N[图3 失败（0分）]C[图3 失败（0分）白棋托的方向错误];B[bs]C[黑棋立，冷静。白棋毫无收获。])(;W[bs]C[附图 黑防守失败]N[附图 黑防守失败];B[cr]C[黑棋接这里如何？];W[ds];B[cs];W[gs]C[白棋打后，如果黑棋不弃子的话，……];B[ds];W[ar]C[这样是个紧劫，黑防守失败。]))",

		//wqqlzwcs_6_8.sgf
		"(;AW[ap][bp][cp][dp][eo][en]AB[do][co][bo][bq][cr][ep][eq]C[（手筋）白先。白棋如不能吃住黑棋三子，白棋四子反而会被吃，白棋解决危机的方法是什么？]SZ[19](;W[bn]N[图1 正解（10分）]C[图1 正解（10分）白棋夹是手筋];B[cn]C[黑棋试图逃跑];W[cm];B[bm];W[ao];B[an];W[dn]C[白棋滚打，黑被吃。])(;W[cn]N[图2 失败（0分）]C[图2 失败（0分）白棋走俗手];B[bn];W[bm];B[cm]C[黑棋断后，白棋缺乏后续手段。])(;W[cm]C[图3 失败（0分）白棋飞封。]N[图3 失败（0分）];B[ao]C[黑棋直接紧气即可。白棋四子被吃，大损。]))",

		//wqqlzwcs_6_9.sgf
		"(;AW[bq][cr][cp][dp][ep][eq][er]AB[cq][bp][bo][co][do][eo][fp][fr][fq][hr]C[（死活）黑先。黑棋如能抓住白棋形上的弱点，可以获得成功。]SZ[19](;B[br]N[图1 正解（10分）]C[图1 正解（10分）黑棋打吃是绝妙的手筋];W[aq]C[白棋只有立下];B[cs]C[黑棋反打];W[dq];B[es];W[bs];B[as];W[ar];B[dr]C[进行至此，黑棋以最强手段造劫。])(;B[br]C[图2 正解续]N[图2 正解续];W[aq];B[cs];W[dq];B[es];W[bs];B[as];W[ar];B[dr]C[黑棋以最强手段做劫];W[bs]C[白棋如在打劫中屈服，提子];B[cq]C[黑棋提子后，仍然要打劫。真是不依不饶。白棋没有退让的余地，当然不提子，只有硬着头皮打下去。])(;B[es]N[图3 失败（0分）]C[图3 失败（0分）黑棋单扳];W[dq]C[白棋提子。];B[ds];W[cs]C[黑棋只是官子行为。]))",

		//wqqlzwcs_6_10.sgf
		"(;AB[br][bq][bp][bo][co][do][eo][fp][gp][hq][iq][jp][jr][cs][er]AW[cq][dp][cp][ep][eq][fq][gq][dr][hr][ir]C[（死活）黑先。黑棋无条件吃全部白棋的手筋是什么？第一手棋非常重要。]SZ[19](;B[es]N[图1 正解（10分）]C[图1 正解（10分）黑棋立是死活的急所];W[fr]C[白棋挡];B[cr]C[黑棋卡眼即可，白已没有两眼。])(;B[es]C[图2 变化图]N[图2 变化图];W[cr]C[白棋团眼];B[fr]C[黑棋往里长又是绝妙的一手，白棋束手无策。])(;B[ds]N[图3 失败（0分）]C[图3 失败（0分）黑棋简单连回];W[fr];B[es];W[cr]C[显然，白棋做活没有任何困难。]))",
	],

	[

		//wqqlzwcs_7_1.sgf
		"(;AW[dd][dq][ep][eo][fp][gp][hp][jq][qj]AB[do][dm][en][fo][ho][go][io][pp][pd]LB[qh:a][ql:b][jd:c][cf:d]C[（布局）黑先。白棋在下边得到了实地，而黑棋也筑成了强大的外势，现在黑棋如何利用这一外势呢？请在 a、b、c、d 中选择。]SZ[19](;B[qh]N[图1 黑棋不满（6分）]C[图1 黑棋不满（6分）黑棋拦的意图是通过攻击白棋来主导局面];W[pn];B[np]C[但下到这里时，黑棋变成后手，这是黑棋的不满。争先很重要。];W[cg]C[白棋争得先手之后，在左上守角，黑棋外势无发展前途。])(;B[ql]N[图2 大同小异（6分）]C[图2 大同小异（6分）黑棋从这里拦，与图1 相比，只是方向不同，结果大同小异。];W[qg];B[qe];W[cg]C[白棋大飞守角是绝好点，黑棋不满。])(;B[jd]C[图3 次选方法（8分）上边虽是大场，但不及左边大]N[图3 次选方法（8分）];W[cg]C[白大飞守角是绝好点];B[fc];W[qf]TR[fc]C[黑棋挂、白棋挂都是预想的进行，白棋的速度明显快。])(;B[cf]C[图4 正解（10分）黑棋挂才是正确的]N[图4 正解（10分）];W[fc];B[bd];W[cc];B[dh]C[其后黑棋如何利用自己的外势进行扩张仍是问题的焦点。]))",

		//wqqlzwcs_7_2.sgf
		"(;AB[pd][pp][cq][cp][do][cn]AW[dq][dp][eo][en][fq][dd]LB[ck:a][pj:b][mq:c][jd:d]C[（布局）黑先。黑棋牵制白棋的厚势、还是快步调地扩张？请在 a、b、c、d 中选择。]SZ[19](;B[ck]N[图1 正解（10分）]LB[cl:a]C[图1 正解（10分）黑在左边拆二是冷静的好棋。由于是事先防备白棋企图的要点，所以较难被人考虑到。])(;B[pj]N[图2 方向错误（6分）]C[图2 方向错误（6分）黑棋构成三连星];W[cl]C[但被白封住左下角之后，黑棋不利。])(;B[mq]N[图3 大同小异（6分）]C[图3 大同小异（6分）黑在右下方守角兼牵制白棋外势];W[cl]C[但被白占据左边要点之后，结果与图2 大同小异];B[pj];W[jd]TR[pj]C[黑、白各自占据要点，结果白厚。])(;B[jd]N[图4 黑棋不利（6分）]C[图4 黑棋不利（6分）黑棋在上边占据大场，与图3 大同小异];W[cl]C[白占据要点];B[pj]C[黑连片构成三连星是连贯的手法，但……];W[np];B[pn];W[nn]C[但进行至此，白棋有利。由于白棋已将左下角黑棋全部封锁，下边白势成为实地的可能性颇大。]))",

		//wqqlzwcs_7_3.sgf
		"(;AB[pd][qk][pq][po][cc][cd][bb][de][ef][fe][ge][fc][hc][fg]AW[cb][dc][eb][eg][eh][cg][ff][gf][hf][he][dp][jp][mp]LB[gi:a][dn:b][jd:c][qf:d]C[（中盘）白先。白棋是首先牵制黑棋的外势，还是首先扩张自己的形势？请在 a、b、c、d 中选择。]SZ[19](;W[gi]N[图1 大缓棋（4分）]C[图1 大缓棋（4分）白棋飞封，虽能控制住黑棋一子，但实际上是大缓棋。黑棋一子由于周边白棋过于强大，已经难以逃出。];B[cn]C[黑棋得到左下小飞挂的机会，白棋不满。])(;W[dn]C[图2 正解（10分）白棋守左下角，将白棋的外势逐步转向具体的实地。]N[图2 正解（10分）])(;W[jd]N[图3 过分（6分）]C[图3 过分（6分）白棋飞，在上边扩张，是过分之举];B[cn]C[黑棋在左下角小飞挂以后，白棋不利];W[cl];B[dl];W[ck];B[en];W[fp];B[dk]C[进行至此，白棋已不可能继续攻击黑棋。左上角黑棋实地已成为白棋沉重的负担。学习左下黑棋的处理方法。])(;W[qf]N[图4 方向错误（6分）]C[图4 方向错误（6分）白在右上角挂，是愚蠢的错误];B[qe];W[pf];B[nd];W[qi]C[右上角黑棋先手处理是好步调];B[cn]C[然后黑棋在左下角挂，黑棋极其满足。]))",

		//wqqlzwcs_7_4.sgf
		"(;AB[cq][cp][cn][ci][cf][pp][id][kd][ge][fc][fb][db][dc][cc][bb][ab][mb][nb][oc][pc][pd][qe][re][rf][fq][gp]AW[dp][eq][fp][fo][fr][ip][bc][bd][cd][fd][ed][dd][gd][gc][gb][hc][ef][lc][mc][nc][od][oe][ne][pe][of][qf][pg]LB[qh:a][nq:b][dl:c][jg:d]C[（中盘）黑先。黑棋在实地上遥遥领先，现在只要能正确地限制白棋的势力，黑棋就能有效地控制局面。请在 a、b、c、d 中选择。]SZ[19](;B[qh]N[图1 时机不成熟（6分）]C[图1 时机不成熟（6分）黑棋飞出是眼见的一手大棋];W[jg]TR[kd][id][ge]C[但被白封后，黑棋三子已行动不便，结论是黑棋在右边飞出的时机不成熟。])(;B[nq]N[图2 次选方法（8分）]C[图2 次选方法（8分）黑棋在右下角守，是牵制白棋外势和固守自己角地的好点];W[jg]C[但被白占据扩张上边的要点之后，黑棋多少有点不满];B[qh];W[pi]TR[qh]C[黑棋飞出时，白棋罩又是连贯的作战手法，白棋很厚。])(;B[dl]N[图3 最差点（4分）]C[图3 最差点（4分）黑棋在左边飞，虽能防守左边，但实际上是一手闲棋];W[jg];B[qh];W[nq]CR[jg]TR[qh][dl]LB[pi:a]C[白棋占据两处要点，黑棋非常不利。])(;B[jg]N[图4 正解（10分）]C[图4 正解（10分）黑棋大飞，牵制白棋外势是最佳选择。由于黑棋实地很多，黑棋只要不让上边白空大多，黑棋就很舒服];W[nq];B[pn]CR[nq]C[白在右下挂角，黑单关应，黑棋很充分。]))",

		//wqqlzwcs_7_5.sgf
		"(;AB[ds][er][dq][fq][bj][cj][ck][dl][dm][dn][do][dp][co]AW[cl][cm][cn][bk][bl][bo][cq][cp][dr][cr]C[（官子）黑先。黑棋如何利用白棋弱点，先手处理两侧？]SZ[19](;B[bn]C[图1 正解（10分）黑棋断是官子手筋]N[图1 正解（10分）];W[bp]C[白棋如果在这里粘……];B[ak];W[an];B[al];W[bm]C[则黑棋左边是先手];B[cs];W[bs];B[es];W[br]C[进行至此，黑棋两侧得利。黑先手，白地 8 目。])(;B[bn]C[图2 变化图]N[图2 变化图];W[bm]TR[bn]C[黑棋断，白棋打吃];B[bp];W[an];B[br]C[黑棋靠又是官子手筋];W[bq];B[cs];W[ap]LB[aj:a]C[进行至此，黑棋先手得利。白地  7 目，以后白有 a 位的先手扳。也许白棋应该采用本图的防守方法，看 a 位扳的价值而定。])(;B[cs]C[图3 失败（0分）]N[图3 失败（0分）];W[bs];B[es];W[bq]C[黑棋爬、接是俗手。进行至此，与图1 有很大的差别。黑棋先手，白地 12 目。]))",

		//wqqlzwcs_7_6.sgf
		"(;AW[br][bq][bp][cr][co][cn][dn][en][fn][gn][go][gp][hp][ip][iq][ir]AB[cq][cp][dr][eq][do][eo][fo][fp][gq][hq][hr]C[（官子）白先。白棋能够威胁黑棋死活的方法是什么？]SZ[19](;W[fs]N[图1 正解（10分）]C[图1 正解（10分）白棋点是进退自如的收官手法];B[es];W[hs];B[fr]C[由于顾虑到自己的死活，黑棋只好如此退让];W[gs]C[黑地 5 目，白先手。])(;W[fr]N[图2 失败（0分）]C[图2 失败（0分）白棋点是受棋形束缚的恶手];B[fq];W[ds]C[白棋扳的方向不对];B[es];W[cs];B[er]LB[is:a]C[进行至此，黑空大大增加。])(;W[fr]C[图3 大同小异（4分）]N[图3 大同小异（4分）];B[fq];W[hs];B[gs];W[is];B[es]C[黑棋可成 8 目地，白棋失败。]))",

		//wqqlzwcs_7_7.sgf
		"(;AB[do][cn][en][em][fm][dr][dq][er]AW[cl][dj][eo][ep][eq][fr][gq][fn][gn]C[（手筋）白先。白棋如何利用黑棋形上弱点以占取便宜？]SZ[19](;W[bo]N[图1 正解（10分）]C[图1 正解（10分）白棋点是手筋];B[co];W[bn];B[bp]TR[co]C[黑棋团、扳是最强抵抗];W[cm]C[白棋大占便宜，而且角上黑棋仍未彻底安定。])(;W[bo]C[图2 变化图]N[图2 变化图];B[bn]CR[bo]C[白棋点时，黑棋挡下无理];W[dp];B[cp];W[co]C[白棋冲断的手段成立];B[dn];W[cq];B[bp];W[bq];B[ao];W[cr]C[进行至此，黑大损。])(;W[dp]C[图3 失败（0分）]N[图3 失败（0分）];B[cp]CR[dp]C[白棋先冲与黑棋交换，有害无益];W[bo];B[co];W[bn];B[bp]C[进行至此，与正解的图1 相比，白棋要差很多。]))",

		//wqqlzwcs_7_8.sgf
		"(;AW[cr][cq][cp][dp][bq][eq][er][fs][gs][gr][hq][iq]AB[hr][br][aq][bp][bn][co][do][ep][fp][fq][fr][gq][fn]C[（手筋）黑先。黑棋如何利用角的特殊性而获取利益？]SZ[19](;B[cs]C[图1 正解（10分）黑棋扳是出色的手筋]N[图1 正解（10分）];W[ds];B[hs];W[es];B[as]C[这样，形成打劫。])(;B[cs]C[图2 变化图]N[图2 变化图];W[dr]TR[cs]C[黑棋扳时，白棋接是大恶手];B[es];W[ds];B[hs]C[黑棋扑、叫吃，白已无法应对。])(;B[hs]C[图3 失败（0分）]N[图3 失败（0分）];W[es];B[cs]TR[hs]CR[es]C[黑棋先打，与白棋接交换一手后，再扳，是次序错误];W[dr]C[白棋团后，黑一无所获。]))",

		//wqqlzwcs_7_9.sgf
		"(;AW[br][cr][dq][eq][cp][fp][gp][hp]AB[cq][bq][bo][co][dp][ep][fo][go][ho][io][ip][iq]C[（死活）黑先。黑棋如何才能吃住全部白棋？第一手棋很重要。]SZ[19](;B[fr]N[图1 正解（10分）]C[图1 正解（10分）黑棋大飞是严厉的手段];W[aq];B[bp];W[er];B[es]C[黑棋一定要扳];W[ds];B[fs];W[fq];B[gr]C[进行至此，白棋已被杀。])(;B[fr]C[图2 参考图]N[图2 参考图];W[aq];B[bp];W[er];B[fq]C[白棋断是俗手];W[es]C[角上白棋成功做活。])(;B[gr]C[图3 失败（0分）黑棋飞是受棋形束缚的恶手]N[图3 失败（0分）];W[aq];B[bp];W[fr]C[白棋净活。]))",

		//wqqlzwcs_7_10.sgf
		"(;AB[br][dr][ds][cp][do][cn][fp][gq][hq][hr]AW[cr][dq][eq][er][gr]C[（死活）白先。白棋求活的方法是什么？]SZ[19](;W[es]N[图1 正解（10分）]C[图1 正解（10分）白棋挡是左右逢源的要点];B[gs]C[黑棋打，野心太大];W[bq];B[cq];W[bs]C[进行至此，白棋利用倒扑成功做活。])(;W[es]C[图2 变化图]N[图2 变化图];B[cq]C[黑棋打吃];W[bs]C[白棋扳是好棋，白棋同样做活。])(;W[bs]N[图3 失败（0分）]C[图3 失败（0分）白棋单扳];B[bq]C[黑棋退后，白棋失败。]))",
	],

	[

		//wqqlzwcs_8_1.sgf
		"(;AB[pd][pq][qo][dp][do][cq][cr][ds][er][eq]AW[dd][dn][eo][ep][dq][cp][bo]LB[jd:a][di:b][qi:c][hp:d]SZ[19]C[（布局）白先。白棋如何下才能控制局面？要考虑右下黑棋的无忧角。请在 a、b、c、d 中选择。](;W[jd]C[图1 方向错误（6分）白棋占据上边，在理论上是无可争议的大场，但方向错误。]N[图1 方向错误（6分）];B[hp]CR[jd]C[被黑斜拆整形后，白上边的拆成为疑问。黑 H4 是与右下无忧角想呼应的要点。])(;W[di]C[图2 大同小异（6分）白棋占据左边，同样是方向错误，结果与图1 大同小异。]N[图2 大同小异（6分）];B[hp];W[jd]C[白虽能在上边扩张，……];B[pj]C[但黑占右边大场后，白势落后于黑势。])(;W[qi]N[图3 后手（6分）]C[图3 后手（6分）白棋分投，虽能在右边防止黑棋连片，……];B[qg];W[ql]TR[qg]C[但黑棋逼时，白棋不可避免地要后手拆二];B[hp]C[于是下边的要点被黑棋占据，白棋不利。])(;W[hp]N[图4 正解（10分）]C[图4 正解（10分）白在下边大跳，是攻防要点];B[jd]C[之后黑占上边大场];W[gr]C[白在下边封，白棋很厚。]))",

		//wqqlzwcs_8_2.sgf
		"(;AB[qd][nd][qi][pq][qp][mq][cf][bd][ci]AW[dd][cc][fd][ic][qn][on][qk][dp]LB[ck:a][fq:b][ok:c][lc:d]C[（布局）白先。在布局阶段，具备后续手段的位置就要更大一些。 a、b、c、d 中哪一位置最好？]SZ[19](;W[ck]N[图1 方向错误（6分）]C[图1 方向错误（6分）白在左边拦];B[kc]C[黑棋在上边展开，并补黑棋角上弱点，白棋不满。])(;W[fq]N[图2 次选方法（8分）]C[图2 次选方法（8分）];B[kc]CR[fq]C[白棋在左下守角是仅次于正确答案的大场，但不及 L17 的价值大。];W[ck]C[白虽能以左下角为后援进行扩张，];B[oj]C[但进行至此，白棋不满。])(;W[ok]C[图3 时机未成熟（6分）白棋跳，其目的是安定右边白棋，但目前时机不对。]N[图3 时机未成熟（6分）];B[kc]C[黑在上边展开];W[oi];B[qg]CR[oi]C[白棋镇头虽能张势，但黑棋补后，白棋收获不大。])(;W[lc]N[图4 正解（10分）]C[图4 正解（10分）白棋在上边拆二是针对黑棋右上薄弱处的正确手段];B[nc]C[黑棋并，防守];W[fq]C[白则可以回手左下守角，白棋布局步调快。]))",

		//wqqlzwcs_8_3.sgf
		"(;AW[pb][nc][kc][jc][kd][je][dp][cq][cn][jq][kq][kp][op][oq][cd][ce][dc][ec][fc][fd][ge][ef]AB[pd][qc][qf][pq][qp][qn][dr][fq][iq][ip][jp][cl][cf][df][de][dg][ed][fe][ff][gd][hd][hf][jd]LB[cr:a][jg:b][qj:c][kn:d]C[（中盘）白先。白棋如何下为好？最好还要有后续企图请在 a、b、c、d 中选择。]SZ[19](;W[cr]N[图1 正解（10分）]C[图1 正解（10分）白棋挡价，有关白棋的根据地，应优先考虑。];B[pj];W[kn]TR[pj]C[黑棋围右边时，白棋单跳，棋形很稳。从全局来看，白棋坚实。])(;W[jg]N[图2 最差点（4分）]C[图2 最差点（4分）白棋单跳是不思进取的一手];B[cr]C[黑棋长进角不仅捞取实地，而且还能攻击白棋];W[dl];B[dk];W[dm]C[白棋靠、退是求安定的一种手法];B[ck]C[但进行至此，白棋反而使得黑棋得以巩固，白棋痛苦。])(;W[qj]N[图3 次选方法（8分）]C[图3 次选方法（8分）白棋在右边分投，的确能够限制右边黑棋的扩张，应该予以优先考虑];B[cr]C[但黑攻击左下白棋，白棋不满];W[fp];B[eq];W[ep];B[gp]C[白棋在求安定的同时，势必也要使黑棋顺势走强。])(;W[kn]N[图4 方向错误（6分）]C[图4 方向错误（6分）白棋向中腹单跳，完全是方向错误];B[cr]C[黑棋长进角很重要];W[dl];B[dk];W[dm];B[ck];W[fl]C[白棋为求安定，不得不如此。];B[pj]C[黑棋得以占据最后的大场，白棋形势不利。]))",

		//wqqlzwcs_8_4.sgf
		"(;AB[pd][oc][pf][pj][pp][nq][hq][go][ci][di][dj][dk][eh][cl][cm][cn][dn][do]AW[nc][nb][ne][ng][jd][dq][cp][co][fq][dd][df][bg][ch][bi][cj][ck][bl][dl]LB[ph:a][mj:b][kp:c][qo:d]C[（中盘）黑先。目前的形势是白棋得实地、黑棋得外势。黑棋如何施展连贯的外势作战方针，与白棋的实地相对抗？请在 a、b、c、d 中选择。]SZ[19](;B[ph]C[图1 黑棋消极（6分）黑棋补，虽是局部的正确手法，但缺点是过于消极]N[图1 黑棋消极（6分）];W[mj]C[白棋大飞才是形势要点。])(;B[mj]C[图2 正解（10分）黑向中腹大跳，是扩张黑势的当然一手]N[图2 正解（10分）];W[ph];B[ob]CR[ph]C[白棋飞入虽让黑棋担忧，但黑挡角，黑棋仍很充分。黑棋从左到右筑成了庞大的模样。])(;B[kp]N[图3  黑被削弱（6分）]C[图3  黑被削弱（6分）黑在下边围，虽然获利不小，但缺点是过于消极];W[mj]C[白棋大飞则是形势要点];B[ph];W[ml]TR[ph]C[以后黑棋补、白棋跳各具气势，但黑势毕竟被大幅削弱。])(;B[qo]N[图4 最差点（4分）]C[图4 最差点（4分）黑棋小尖守角，是过于闲散的一手棋。目前全局的焦点在中腹，因此这一闲棋，使黑想赢棋变得困难。];W[mj]C[白向中腹大飞以后，白棋非常满足。]))",

		//wqqlzwcs_8_5.sgf
		"(;AW[cq][dq][fq][cn][dm]AB[dp][co][dn][en][gn][ho][hq][cm][cl]C[（官子）黑先。黑棋要想吃住白棋很困难，但可以通过威胁白棋而取得利益。]SZ[19](;B[er]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是官子手筋];W[eq];B[fr];W[dr]C[白棋只得屈服];B[bp];W[br];B[gq];W[cs]C[进行至此，黑棋大占便宜。])(;B[bp]N[图2 失败（0分）]C[图2 失败（0分）黑棋尖操之过急];W[gr];B[hr]CR[gr]C[被白先手利用后，黑棋痛苦];W[bq]C[进行至此，白地已大大加强。])(;B[gr]N[图3 失败（0分）]C[图3 失败（0分）黑棋换个方向尖];W[fr]C[白棋挡，黑棋失败。与图1 相比，差别很大。]))",

		//wqqlzwcs_8_6.sgf
		"(;AB[br][cq][dq][fq][gq][hr][hq]AW[bq][bp][cp][dp][ep][fp][go][ho][ip][iq][ir]C[（官子）白先。白棋应仔细研究能侵入黑空的方法。]SZ[19](;W[bs]N[图1 正解（10分）]C[图1 正解（10分）白棋夹是官子手筋];B[cr]C[黑棋粘，无奈];W[eq];B[er];W[ar];B[ds];W[hs];B[gs];W[is]C[进行至此，白棋两面得利。])(;W[bs]C[图2 变化图]N[图2 变化图];B[ar]CR[bs]C[白棋夹时，黑棋立下无理];W[cr];B[dr];W[er]C[白棋再发手筋];B[eq];W[ds]C[最后形成打劫。])(;W[ar]N[图3 失败（0分）]C[图3 失败（0分）白棋扳];B[bs]C[黑棋立后，白棋失败。]))",

		//wqqlzwcs_8_7.sgf
		"(;AW[cr][cq][dq][co][bo][dn][en][fn][go][gp][hp][iq][jq][kp][kn]AB[cn][cm][em][dm][fm][gm][im][ho][io][ip][gq][hq][fq][eq][dr]C[（手筋）黑先。黑棋如能下出手筋，不但可以救回五子，还能吃白数子。]SZ[19](;B[do]N[图1 正解（10分）]C[图1 正解（10分）黑棋断是手筋];W[eo]C[白棋从这里打吃];B[gn]C[黑棋再冷静地挤是准备好的手段];W[dp];B[fo];W[fp];B[ep]C[进行至此，黑可吃住白四子。])(;B[do]N[图2 变化图]C[图2 变化图黑棋断];W[dp]C[白棋从这里打寻求变化];B[fo]C[黑棋再嵌是手筋，有侧白三子无法救回。])(;B[gn]N[图3 失败（0分）]C[图3 失败（0分）黑棋先挤是次序错误];W[fo]C[白棋粘后，黑棋已无良策];B[do];W[dp]TR[do]C[黑棋断，白棋打即可，白棋安然无恙。])(;B[do]C[附图]N[附图];W[ep]TR[do]C[黑棋断，白棋扳如何？];B[fp]C[黑棋简单地冲即可。]))",

		//wqqlzwcs_8_8.sgf
		"(;AW[bq][br][bp][do][fn][fp][fq][gp][hp][er][ir]AB[iq][jq][hr][gq][fr][eq][dq][cq]C[（手筋）白先。行棋次序是很重要的问题。如能成劫，即告成功。]SZ[19](;W[ds]N[图1 正解（10分）]C[图1 正解（10分）白棋小尖是手筋];B[dr]C[黑棋打];W[fs];B[gr];W[cs]C[白棋以劫应对。])(;W[ds]C[图2 变化图]N[图2 变化图];B[cs]C[黑棋搭下，寻求变化];W[gr]C[白棋扑是准备好的手段];B[gs];W[hq];B[gr];W[fs]C[白棋扑，此劫成为黑棋沉重的负担。])(;W[fs]N[图3 失败（0分）]C[图3 失败（0分）白棋先打是大恶手];B[gr];W[ds]C[白棋尖，想做劫];B[cs];W[cr];B[dr];W[bs];B[gs]C[进行至此，白棋失败。]))",

		//wqqlzwcs_8_9.sgf
		"(;AB[cr][dq][dr][er][gq][hp][iq][ir]AW[br][cq][bp][dp][ep][eq][dn][go][io][ip][jn][jq][jr]C[（死活）白先。白棋如果次序正确，就能吃住黑棋。应尽量利用黑棋的不入气。]SZ[19];B[jj](;W[hr]N[图1 正解（10分）]C[图1 正解（10分）白棋夹是眼形的要点];B[hs]C[黑棋扳抵抗。（黑棋立下的抵抗完全不行）];W[fr];B[fq];W[gr]CR[fr]C[白棋扳下、接是准备好的手段];B[fs];W[cs]C[进行至此，白棋可以利用黑棋的不入气而吃住黑棋。])(;W[gs]N[图2 失败（0分）]C[图2 失败（0分）白棋点看似急所];B[gr]C[其实黑棋顶住即可];W[is];B[fs];W[hs];B[hr];W[js];B[gp]C[进行至此，白棋无法吃住黑棋。])(;W[is]N[图3 遭到反击（0分）]C[图3 遭到反击（0分）白棋扳如何？];B[hs]C[黑棋必打];W[hr];B[js];W[fr];B[fq];W[gr];B[fs];W[cs];B[kr]C[进行至此，黑棋虽未能做出两个眼，但已成功地进行了反击，在右边找到了出路，白棋再想攻击黑棋已非易事。])(;W[cs]C[附图白棋单扳如何？]N[附图];B[fr]C[黑棋退，冷静。白棋已无法杀死黑棋，请自行验证。]))",

		//wqqlzwcs_8_10.sgf
		"(;AB[br][cr][aq][es][fs][gs][gr][gq][fq][eq]AW[ap][bo][bq][cq][dp][ep][fp][gp][hp][hq][hr][hs]C[（死活）白先。白棋可以利用双倒扑吃住黑棋。]SZ[19](;W[dr]N[图1 正解（10分）]C[图1 正解（10分）白棋扳下是急所];B[dq]C[黑棋必断];W[er]C[白棋长，绝对];B[ds];W[bs]C[白棋托，又是手筋];B[ar];W[cs];B[as];W[cs];B[fr];W[dr]C[进行至此，白棋通过双倒扑的手段，吃住全部黑棋。])(;W[dr]C[图2 参考图]N[图2 参考图];B[dq];W[er];B[ds];W[ar]C[白棋提子是缺乏计算的表现];B[bs]C[黑棋做活。]))",
	],

	[

		//wqqlzwcs_9_1.sgf
		"(;AB[qd][dp][dk][ce][fe][he]AW[dc][gc][id][di][fi][pp]LB[hi:a][fk:b][cg:c][oc:d]C[（布局）黑先。黑棋欲以积极的方法来控制局势，并最大限度地发挥其棋子的价值。请在 a、b、c、d 中选择。]SZ[19](;B[hi]N[图1 正解（10分）]C[图1 正解（10分）从气势上考虑，黑棋也应镇头。虽然白棋在左上角取得了实地，但黑棋可以通过攻击左边白棋二子而维持局势的均衡。];W[fk];B[dm]CR[fk]C[其后白棋曲镇，黑棋跳补，是预想的进行。])(;B[fk]N[图2 次选方法（8分）]C[图2 次选方法（8分）黑棋跳是次选方法];W[hi]C[但白向中腹跳后，黑棋缺少明显的后续攻击手段];B[ie];W[jd];B[je];W[kd]C[其后黑棋在上边连压，白棋上边得以巩固是黑棋的不满。])(;B[cg]C[图3 最差点（4分）]N[图3 最差点（4分）];W[bi]TR[cg]C[黑棋拆一，试图上下联络，但会诱发白棋跳下的强手。因此黑棋拆一是分数最低的位置。])(;B[oc]N[图4 方向错误（6分）]C[图4 方向错误（6分）黑棋守角是方向错误];W[hi]LB[dn:a][ie:b]C[白棋跳是冷静的好手，而且还有伺机占据 a 位或 b 位的手段。黑棋的下一手棋已非常困难。]))",

		//wqqlzwcs_9_2.sgf
		"(;AB[cd][dc][gc][bm][cl][dm][dn][eo][dp][dq][dr]AW[cf][ef][dj][pd][pp][cr][cq][cp][co][do][cn][bn]LB[qj:a][jq:b][nc:c][fn:d]C[（布局）黑先。在布局阶段，抢占急所应比抢占大场更优先考虑。本题中黑棋如何才能将棋走厚，并且保持局势的平稳发展？请在 a、b、c、d 中选择。]SZ[19](;B[qj]N[图1 黑棋困难（6分）]C[图1 黑棋困难（6分）黑棋分投，单纯从大小来看，确是非常大的大场];W[en]C[但左下角黑棋被白断后，黑棋难受];B[fo];W[fn]C[黑棋被一分为二，形势非常困难。])(;B[jq]N[图2 黑棋不利（6分）]C[图2 黑棋不利（6分）黑棋在下边展开];W[en]TR[jq]C[被白断后，证明黑棋开拆是疑问手];B[fo];W[fn];B[gn];W[fm];B[ek];W[gm]C[黑棋战斗不利。结论是黑棋被切断后，黑棋不好。])(;B[nc]N[图3 黑棋愚形（6分）]LB[en:a]C[图3 黑棋愚形（6分）黑棋飞挂，虽能防止被白棋在 a 位切断（白棋断的话，黑棋可征吃了），];W[fo]C[但仍被白棋占据了要点];B[en];W[fq];B[ep];W[ip]C[黑棋愚形。])(;B[fn]N[图4 正解（10分）]C[图4 正解（10分）黑棋虎是当务之急，也是保持厚势的要所。];W[jq]C[其后白在下边展开，以牵制黑棋的外势];B[ch]C[黑则在左边打入取实地];W[dh];B[ci];W[di];B[cj]C[以后黑棋还有伺机攻击白棋左边的手段。]))",

		//wqqlzwcs_9_3.sgf
		"(;AB[pd][nd][jc][de][cf][df][dj][cp][eq][ip][ro][qo][qp][qq][qr][pr][nq]AW[ce][cd][dc][fc][gq][iq][jq][lq][or][oq][pq][pp][po][qn][rn][om][pi]C[（中盘）黑先。在实地上，黑棋已处于领先地位。如何在右边牵制白棋的外势是全盘的关键。请在 a、b、c、d 中选择。]LB[qe:a][hc:b][gp:c][dm:d]SZ[19](;B[qe]N[图1 次选方法（8分）]C[图1 次选方法（8分）黑棋尖确实可以守住角地，但时机不成熟];W[go]C[白棋跳是牵制左边黑势和扩张己势的好点。])(;B[hc]N[图2 最差点（4分）]C[图2 最差点（4分）黑棋拆一，虽在实地上很有收获，但实际上却是一手闲棋];W[go]C[白棋跳是大势上的要点];B[dm];W[qf]TR[dm]C[其后如果黑棋在左边守，白则在右上挂，形势是白棋领先。])(;B[gp]N[图3 正解（10分）]C[图3 正解（10分）从棋形上考虑，黑棋压是当然的一手];W[qf]C[其后白棋飞挂具有气势];B[fq];W[hp];B[ho];W[hq];B[go]C[但进行至此，黑棋在左下构筑成很强的外势，黑棋有利。])(;B[dm]N[图4 消极（6分）]C[图4 消极（6分）黑棋在左边围，缺点是过于消极];W[go]C[白棋跳是扩张势力的绝好点];B[qe]C[其后黑棋尖是很大的棋];W[gl]C[但进行至此，黑棋的实地不及白的势力。]))",

		//wqqlzwcs_9_4.sgf
		"(;AB[bb][bc][cc][db][ca][ea][cd][ao][co][bo][cp][bq][ar][cr][dn][eo][fo][em][cm][cl][dk][ek][cj][gm][gl][gq][fd][gd][jd][kd][ld][jc][jb][ja][lb][me][ne][jf][hg][gg][fg][kg][lg][mg][ob][oc][pc][qc][rc][qd][of][og][oh][ph][pg][qg][rh][qi][rj][si][ni][ok][nm][om][pm][rl][ql][qm][jk][hp][ip][jp][kp][jq][kr][lo][mq][np][oq][pq][pp][qp][rp][id][ml][ll]AW[bd][ce][de][dd][dc][fb][eb][fc][ch][bj][bk][bl][bm][ck][bn][cn][do][dp][dq][cq][eq][br][eh][fh][gh][hh][ih][kh][lh][mh][je][lf][mf][nf][ka][kb][kc][lc][mb][nb][nc][nd][od][pd][oe][qa][qb][rb][sa][sc][rd][se][qe][qf][pf][rg][sh][gr][gp][go][hm][hl][hk][hq][iq][ir][jr][kq][kn][km][mm][mn][nn][on][pn][qn][rm][ro][qo][sp][rq][op][pk][pj]LB[lr:a][qr:b][hc:c][be:d]SZ[19]C[（终盘）白先。如果剩下的后手官子价值差不多，就应尽可能地选择具有后续手段的官子。请在 a、b、c、d 中选择。](;W[qr]C[图1 正解（10分）白棋尖是价值最大的地方]N[图1 正解（10分）];B[ks]C[黑棋出于死活考虑，下立];W[os];B[nr];W[be]CR[os]C[白棋先手飞后，再占左上官子。])(;W[be]C[图2 次选方法（8分）白棋粘，单纯从大小上考虑是非常大的官子]N[图2 次选方法（8分）];B[rr]C[但被黑棋夹后，白棋与图1 相比有很大差别。];W[sr];B[qr];W[lr];B[lq];W[ks];B[mr])(;W[lr]N[图3 操之过急（6分）]C[图3 操之过急（6分）白棋打吃虽是官子手筋，但多少有点操之过急];B[lq];W[ks];B[rr]C[黑棋夹是好手。])(;W[hc]N[图4 最差点（4分）]C[图4 最差点（4分）白棋单跳是价值最小的位置];B[rr];W[sr];B[qr]C[黑棋先收右下];W[be]C[白棋粘];B[ks]C[黑棋立下，在下边走成不小的实地。]))",

		//wqqlzwcs_9_5.sgf
		"(;AB[br][cr][dr][gq][go][fn][dm][dn][do][co][bn][bm]AW[bo][ap][bq][cq][cp][cm][cn][cl][bk]C[（官子）黑先。黑棋如何利用白棋的弱点而取利？黑棋的第一手棋是关键。]SZ[19](;B[ar]C[图1 正解（10分）]N[图1 正解（10分）];W[aq];B[ao]TR[ar]CR[aq]C[黑棋立下，与白棋交换一手后再扑入是正确的官子手段];W[an];B[am];W[ao];B[dp];W[bl];B[dq];W[al]C[进行至此，黑棋先手封挡成功。白地 8 目（提黑 4 子）。])(;B[ao]N[图2 失败（0分）]C[图2 失败（0分）黑棋先扑次序有误];W[an];B[am];W[bl];B[ao];W[bp];B[dp];W[al]C[进行至此，与图1 差别很大。])(;B[ar]C[图3 失败（0分）]N[图3 失败（0分）];W[aq];B[dp]C[黑棋挡是失误];W[dq];B[eq];W[bl]C[与图1 相比，黑棋损 1 目。]))",

		//wqqlzwcs_9_6.sgf
		"(;AB[cr][cq][cp][co][do][dn][en][fn][ep]AW[bo][cn][cm][dm][em][gl][dp][dq][eq][fp][ip][jq]C[（手筋）黑先。黑棋对下边白空有手段吗？]SZ[19](;B[fq]N[图1 正解（10分）]C[图1 正解（10分）黑棋断是手筋];W[gq];B[fr];W[eo];B[er]C[进行至此，黑棋收获很大。])(;B[fq]C[图2 变化图]N[图2 变化图];W[eo]TR[fq]C[黑棋断时，白棋提子];B[gq];W[gp];B[er]TR[gq]CR[gp]C[黑与白先交换一手再扳是次序。])(;B[gq]N[图3 黑棋失败（0分）]C[图3 黑棋失败（0分）黑棋刺];W[gp]C[被白压住，黑棋失败];B[fq];W[er];B[hq];W[hp];B[eo];W[fr]C[黑棋大损。]))",

		//wqqlzwcs_9_7.sgf
		"(;AW[cp][dq][er][fr][gr]AB[co][do][cm][eq][ep][gq][hq][hr]C[（手筋）黑先。目前黑棋虽然不能全部吃住白棋，但是如能运用手筋，会取得很大利益。]SZ[19](;B[cq]N[图1 正解（10分）]C[图1 正解（10分）黑棋掖是手筋];W[cr];B[bq];W[br];B[dp];W[dr];B[bp];W[ar]C[双方必然，黑先手得利。])(;B[cq]C[图2 变化图]N[图2 变化图];W[bq]C[白棋打吃无理];B[cr];W[bp];B[dr];W[dp];B[br]C[白棋全体被吃。])(;B[cr]N[图3 失败（0分）]C[图3 失败（0分）黑棋点，看似急所];W[cq]C[白棋补后，黑棋失败。]))",

		//wqqlzwcs_9_8.sgf
		"(;AB[cr][cq][dp][ep][fp][gp][hp][hq][gr][fr]AW[dr][dq][bq][bp][cp][do][eo][fo][go][ho][io][ip][iq][ir][hr][gq]C[（死活）黑先。黑棋如何利用被白棋吃住的两子做活？]SZ[19](;B[cs]N[图1 正解（10分）]C[图1 正解（10分）黑棋立下是当务之急];W[ds];B[es];W[br];B[er];W[bs];B[gs]C[黑棋利用弃子做活])(;B[er]C[图2 失败（0分）]N[图2 失败（0分）];W[cs]TR[er]C[黑棋顶，白棋打吃后，黑不能活。])(;B[es]C[图3 失败（0分）]N[图3 失败（0分）];W[cs]TR[es]C[黑棋尖，白棋打吃，黑不能活。]))",

		//wqqlzwcs_9_9.sgf
		"(;AB[cq][dq][dr][co][do][eo][ep][fp][fq][fr]AW[eq][bq][cr][cp][dp][bo][bn][cn][en][dn][fn][fo][ho][hq][hr]C[（死活）白先。白棋如果过于受二子正被打吃所束缚，则会把事情搞糟，因此白棋的第一手棋极其重要。]SZ[19](;W[bs]N[图1 正解（10分）]C[图1 正解（10分）白棋虎是吃住全部黑棋的急所];B[ar]C[黑棋点，进行抵抗];W[aq]C[白棋挡，重要];B[bp];W[cp]C[进行至此，黑棋不能活。])(;W[br]N[图2 失败（0分）]C[图2 失败（0分）白棋接是大恶手];B[bp]C[黑棋提，白已不能吃住黑棋。];W[cp]C[白棋扑，试图杀黑];B[ap]C[但黑立下，白棋大损。])(;W[bp]N[图3 失败（0分）]C[图3 失败（0分）白棋如果未能发现图1 的次序，很容易出现接的下法];B[br]C[黑棋打后，做活了。])(;W[bs]C[附图1 变化]N[附图1 变化];B[bp]LB[ar:a]C[黑棋不点 a 位，单提];W[cp];B[ap];W[ar]C[黑棋被吃。])(;W[bp]C[附图2 打劫]N[附图2 打劫];B[br];W[bs];B[ar];W[ds]C[黑棋成打劫活，当然不会净活。])(;W[bp]C[附图3 打劫]N[附图3 打劫];B[br];W[bs];B[cs];W[ar]C[依然打劫。]))",

		//wqqlzwcs_9_10.sgf
		"(;AB[cr][cq][cp][co][bn][cm][cl][em][fn][fp][fq][gr][hq]AW[cn][dn][do][dp][dr][dq][eq][fr][cs][br]C[（死活）白先。白棋如何利用黑棋形上的弱点来做活？]SZ[19](;W[bo]N[图1 正解（10分）]C[图1 正解（10分）白棋断是正确的做活手法];B[bp];W[ap];B[ao];W[aq];B[bm];W[fs]C[进行至此，白棋做活。])(;W[bq]N[图2 失败（0分）]C[图2 失败（0分）白棋单长];B[bo]LB[bp:a][aq:b]C[黑棋单接，冷静。];W[fs];B[bs];W[as];B[aq]C[白棋被杀。])(;W[es]N[图3 失败（0分）]C[图3 失败（0分）];B[bq]C[白棋被杀。])(;W[bo]C[附图 白损]N[附图 白损];B[bp];W[bq];B[ao];W[aq];B[ap];W[fs]C[与图1 相比，白损了 2 目。]))",
	],

	[

		//wqqlzwcs_10_1.sgf
		"(;AB[pd][qf][pq][qp][kq][ce][cn][dn][do][dj]AW[dc][kd][nc][qn][qk][cp][co][dq][fq]LB[ed:a][qh:b][iq:c][pb:d]C[（布局）白先。从全局棋子的布置考虑，目前白棋应优先下的位置是什么？请在 a、b、c、d 中选择。]SZ[19](;W[ed]C[图1 正解（10分）白棋尖是很重要的一点]N[图1 正解（10分）];B[dg]C[黑棋飞防守左边];W[qh]C[白则很温和地在右边展开。])(;W[qh]C[图2 时机不成熟（8分）白棋拆二虽是明显的大棋，但时机不成熟。]N[图2 时机不成熟（8分）];B[ed]C[黑棋立即飞压是好棋];W[ec];B[fd];W[gc];B[gd];W[hc];B[hd]C[进行至此，黑棋形势好。])(;W[iq]N[图3 黑棋顺畅（6分）]C[图3 黑棋顺畅（6分）白在下边拆是疑问手];B[ed]C[黑棋飞压];W[ec];B[fd];W[gc];B[gd];W[hc];B[hd];W[ic]C[白棋上边被压在低位];B[qi]C[进行至此，黑棋顺畅。])(;W[pb]N[图4 大同小异（6分）]C[图4 大同小异（6分）];B[ed]CR[pb]C[白棋飞进角，仍会遭到黑棋的飞压，结果与图3 大同小异。];W[ec];B[fd];W[gc];B[qi]C[黑再占据右边大场，结果黑棋领先。]))",

		//wqqlzwcs_10_2.sgf
		"(;AB[pd][qk][pq][lp][ep][fp][fq][fm]AW[dq][eq][cn][cp][jp][jn][dd]LB[jl:a][dl:b][jd:c][ln:d]C[（布局）白先。白棋应充分考虑目前局势的走向，以确定攻守的要点。请在 a、b、c、d 中选择。]SZ[19](;W[jl]N[图1 正解（10分）]C[图1 正解（10分）白棋单跳是很温和的一手棋，同时也是正确把握局势走向的要点。];B[dm]C[其后黑棋兼冲];W[dn];B[en];W[el];B[em];W[bl]C[白棋飞出，白棋心情不错。])(;W[dl]C[图2 白棋难看（6分）白棋飞是脱离主战场的一手]N[图2 白棋难看（6分）];B[jl]C[黑棋镇是绝好点];W[ln];B[np]CR[ln]C[其后白曲镇时，黑取实空，黑棋形势好。])(;W[jd]C[图3 黑棋满足（6分）]N[图3 黑棋满足（6分）];B[jl]CR[jd]C[白在上边拆虽然很大，但被黑镇头攻击之后，结果与图2 大同小异];W[ln];B[np];W[kl];B[kk];W[ll];B[jm];W[kn];B[jk]C[进行至此，白棋在大体取得安定的同时，黑棋也取得了实地和厚势。])(;W[ln]N[图4 方向错误（6分）]C[图4 方向错误（6分）同样是求安定，本图的白曲镇却是方向错误];B[np]C[黑补棋];W[jl]C[其后白再跳];B[fk]C[黑棋同样跳出，黑棋所获较多。]))",

		//wqqlzwcs_10_3.sgf
		"(;AB[od][pc][qd][dc][fd][ic][cp][do][cl][fp][iq][lq][qh]AW[eq][gq][gp][qq][ce][dg][cj][kc][mc][ob][qj][pm]LB[nq:a][cr:b][bc:c][fn:d]C[（中盘）白先。白棋首先要考虑的是掌握局势的主动。白棋现在最有效的位置是什么？请在 a、b、c、d 中选择。]SZ[19](;W[nq]N[图1 正解（10分）]C[图1 正解（10分）白棋拆二，是扩张自己实地和伺机攻击黑棋二子的好点，白棋形势不错。])(;W[cr]N[图2 白棋消极（6分）]C[图2 白棋消极（6分）白棋飞，为左下白棋生根，但实际上过于消极];B[oq]C[被黑棋拆二后，白棋不满。];W[po];B[cd])(;W[bc]N[图3 方向错误（6分）]C[图3 方向错误（6分）白棋在左上角飞虽然在实地上很大，却是方向错误];B[oq];W[po];B[dq]TR[oq]C[黑棋占据好点之后，白棋无味。])(;W[gn]N[图4 最差点（4分）]C[图4 最差点（4分）白棋跳是价值最小的地方];B[oq];W[po];B[cd];W[de];B[dq]TR[oq][cd]C[进行至此，局势的要点全部被黑占有，白棋需要努力。]))",

		//wqqlzwcs_10_4.sgf
		"(;AW[cb][cd][ce][dd][dc][eb][fc][fd][gc][gb][dp][bp][co][en][fq][rq][qq][pp][qo][rm][rk][on][nc][oe][kc][jc][ld][lf][mf][jf][jg][kg][jh][ih][hg][gg][gh][eh][fi][fj][fk][ek][di][gk][ki][li][mi][ni][nj][nk][jj][jk][kk][ik][ij][hk]AB[db][ec][ed][ee][de][fe][df][cf][dh][ei][ej][dj][cj][dl][el][fl][gl][bo][bn][cn][hq][pq][oq][lq][qr][pd][pc][ob][pf][qg][gd][hd][ie][jd][ke][kf][kh][lh][lg][mh][nh][oi][ok][oj][nl][pm][kj][lj][lk][ll][kl][jl][im][gi][hj][hh][ii][ji]LB[cq:a][gr:b][hr:c]C[（终盘）白先。白棋对左下角已再也不能置之不理了。白棋最有效的处理手法是什么？请在 a、b、c 中选择。]SZ[19](;W[hr]C[图1 正解（10分）白棋托是官子手筋]N[图1 正解（10分）];B[ir];W[gr];B[ip]C[黑棋扳、虎，退让];W[rr]C[白棋争得先手后，占据右下角大官子，白棋非常满足。])(;W[hr]C[图2 变化图]N[图2 变化图];B[gr]CR[hr]C[白棋托时，黑棋外扳寻求变化];W[gq];B[ir];W[hp];B[iq];W[fr]C[进行至此是必然的次序。接着黑棋须提白一子，否则，白棋便在 a 位提黑子，以后还有 b 位长的手段。]LB[gs:a][ip:b])(;W[cq]N[图3 单纯防守（6分）]C[图3 单纯防守（6分）白棋单纯防守则令人感到乏味];B[ri]C[黑棋完全可以去占其他大官子。])(;W[gr]N[图4 最差点（4分）]C[图4 最差点（4分）白棋尖];B[hr]C[黑棋挡，白角上仍留有弱点];W[ri]C[白在左下角脱先];B[cq]C[黑棋以下的手段可以成立。];W[cp];B[bq];W[ap];B[er];W[fr];B[eq];W[ep];B[fp]))",

		//wqqlzwcs_10_5.sgf
		"(;AB[bq][bp][bo][cp][cn][cl]AW[co][do][dp][cq][ep][fp][gp][hq]C[（官子）黑先。黑棋如何才能最大限度侵入白空？]SZ[19](;B[cr]N[图1 正解（10分）]C[图1 正解（10分）黑棋在二路打是正确的官子手段];W[]C[如果白棋在此脱先的话];B[er]C[黑棋跳是很大的一手棋];W[fr]C[白棋如挡，则黑棋先手获得利益。])(;B[dq]N[图2 失败（0分）]C[图2 失败（0分）黑棋断吃失误];W[er]C[白跳是好棋，白棋留有以后救活一子的余味。]))",

		//wqqlzwcs_10_6.sgf
		"(;AB[bs][br][bp][cq][dp][do][eo][fo][gp]AW[cr][cs][ds][er][dq][ep][fp][go][ho][ip][iq][jr]C[（手筋）黑先。黑棋如何利用白棋形上的弱点获取利益？]SZ[19](;B[fr]N[图1 正解（10分）]C[图1 正解（10分）黑棋靠是手筋急所一击，白棋顿感麻痹。请注意白棋的防守方法];W[gq]C[白棋打吃无奈];B[fs]C[黑棋立下是连贯的好棋];W[fq];B[es]C[进行至此，白棋三子被吃。白棋的防守大致如此，真实生不如死。])(;B[fr]C[图2 变化图]N[图2 变化图];W[gq];B[fs];W[es]TR[fs]C[黑棋立下时，白棋团无理];B[fq];W[hp];B[eq]C[白棋损失更大。])(;B[fr]C[图3 失败（0分）]N[图3 失败（0分）];W[gq];B[fq]C[黑棋打是失误];W[eq];B[fs];W[gr]C[进行至此，黑棋一无所获。])(;B[gq]N[附图 黑无谋]C[附图 黑无谋黑棋单立，无谋];W[fr];B[fq];W[eq];B[gr];W[fs]C[什么也没捞着。]))",

		//wqqlzwcs_10_7.sgf
		"(;AB[cq][co][eo][fo][gp][gq]AW[eq][fp][go][ho][iq][kq]C[（手筋）白先。白棋有使左右联络的手段，第一棋是关键。]SZ[19](;W[gr]N[图1 正解（10分）]C[图1 正解（10分）白棋托是手筋];B[fr];W[fq];B[hr];W[gs]C[白棋立下，准备以“大头鬼”来赢得对杀];B[fs];W[hq];B[hs];W[gr];B[gs];W[hp];B[gr];W[er]C[进行至此，白棋成功。])(;W[er]N[图2 失败（0分）]C[图2 失败（0分）白棋立是恶手];B[gr]C[黑棋占据对杀的急所];W[hr];B[ep];W[fq];B[dr]C[对杀黑胜])(;W[gr]N[附图1 需要深算]C[附图1 需要深算白棋托是手筋];B[fr];W[fq];B[hr];W[gs]C[白棋立，准备做“大头鬼”];B[hq]C[黑棋接];W[ir]C[白棋紧气即可];B[fs]C[黑棋必着];W[er]C[对杀白快一气。])(;W[gr]C[附图2 继续计算]N[附图2 继续计算];B[hr]C[黑棋从这里扳];W[fr]C[白棋单退即可];B[hq];W[ir]C[对杀白胜。])(;W[gr]N[附图3  黑棋如何防守？]C[附图3  黑棋如何防守？白棋托，考虑黑棋如何防守];B[fq];W[fr];B[ep]C[这样样子黑棋实在太委屈，可是似乎也没有别的好办法。]))",

		//wqqlzwcs_10_8.sgf
		"(;AB[cr][bq][co][cn]AW[bm][dm][cm][bk][dn][dq][dp][dr][fq]C[（死活）黑先。黑棋如何才能轻松地做出两只眼？]SZ[19](;B[ao]N[图1 正解（10分）]C[图1 正解（10分）黑棋跳是求活的急所];W[bn];B[bo]CR[bn]C[白棋冲，黑棋挡即可做活。])(;B[bn]N[图2 失败（0分）]C[图2 失败（0分）黑棋挡扩大眼位];W[cq];B[br];W[ao];B[an];W[bp];B[cp];W[do]C[但白有本图的手筋，黑被杀。])(;B[bo]C[图3 失败（0分）]N[图3 失败（0分）];W[cp];B[bp];W[ao]C[本图黑也被白轻松吃住。]))",

		//wqqlzwcs_10_9.sgf
		"(;AW[br][bp][cq][co][do][eo][fo][go][ho][hp][hq]AB[cr][dr][dq][dp][ep][fp][gp][fr]C[（死活）白先。目前黑棋形已经很具弹性，白棋要杀死黑棋只有一手棋能行，其余全部失败。]SZ[19](;W[hr]N[图1 正解（10分）]C[图1 正解（10分）白棋立是冷静的好手];B[gq];W[cs]C[白棋扳是连贯的手筋，简单吃住黑棋。])(;W[cs]N[图2 失败（0分）]C[图2 失败（0分）白棋扳是疑问手];B[hr];W[ir];B[gq];W[hs];B[gs]C[黑棋造劫的手段能够成立。])(;W[gq]N[图3 失败（0分）]C[图3 失败（0分）白棋拐是大恶手];B[es]C[黑棋虎，可以确保两只眼。]))",

		//wqqlzwcs_10_10.sgf
		"(;AW[ar][bq][bp][bn][co][do][eo][fo][go][io][in][iq][jq][hr][gq][fq][dq][dr]AB[br][cr][cq][cp][dp][ep][fp][gp][hp][hq][ds]C[（死活）黑先。在目前状况下，黑棋绝对不能放弃做活的努力。只要能劫活，即告成功。]SZ[19](;B[gr]C[图1  正解（10分）]N[图1  正解（10分）];W[fr];B[fs]TR[gr]C[黑棋断、扳是绝妙的手筋];W[gs];B[er];W[bs];B[eq]C[进行至此，黑棋利用白棋接不归成功造劫。])(;B[gr]C[图2 变化图]N[图2 变化图];W[fr];B[fs];W[er]C[白棋粘];B[hs]C[黑棋打，仍然是劫。白棋一般要按图1 进行。])(;B[er]N[图3  失败（0分）]C[图3  失败（0分）黑棋打吃，是不负责任的下法];W[gr]C[白棋接上，冷静];B[eq];W[bs]C[黑棋无法做出两眼。]))",
	],

	[

		//wqqlzwcs_11_1.sgf
		"(;AB[pd][qp][cq][br][dr][fq][fi][fj][fk][fl][em][dm][cm][cn]AW[dc][cf][oq][bp][co][dp][dq][dn][en][fn][fm][gl][gk][gj]LB[iq:a][ch:b][po:c][jd:d]C[（布局）黑先。黑棋如何牵制白棋的势力是成败的关键。黑棋目前最应考虑的位置是什么？请在 a、b、c、d 中选择。]SZ[19](;B[iq]N[图1 正解（10分）]C[图1 正解（10分）黑棋在下边拆二是正解，也是黑棋最应先下的位置];W[ci]C[其后白棋在左边拆二];B[gi]C[黑棋曲是厚实的一手，也削弱了白棋的外势。])(;B[ch]N[图2 方向错误（6分）]C[图2 方向错误（6分）黑棋在左边拆虽可关门，但实际上是方向错误];W[hq]C[白棋逼是很严厉的手段];B[fr]C[黑棋补不得已];W[po]C[白棋再在右下飞压，白棋势力充满活力。])(;B[po]N[图3 白棋好调（6分）]C[图3 白棋好调（6分）黑棋尖起，从远处限制白势虽很重要，……];W[hq]C[但被白先手利用，黑棋痛苦];B[fr];W[ci]TR[fr]C[黑棋在下边补棋后，白在左边拆二，白棋好调。])(;B[jd]N[图4 黑棋难受（6分）]C[图4 黑棋难受（6分）黑棋在上边展开虽是大场];W[hq]C[但被白利用后，黑上边开拆一子即成疑问手]TR[jd];B[ch]C[黑棋在下边脱先，过于贪心];W[gr];B[fr];W[eq];B[er];W[bq];B[ar];W[fs]C[角上黑棋无法做出两眼。]))",

		//wqqlzwcs_11_2.sgf
		"(;AB[dp][dn][cj][pd][od][qc][pb][op][oo][on][nl][pm][pp][pq][qq]AW[cd][ed][kc][qd][qe][qh][kq][nq][oq][po][pn][qn][qp][ro][rq]LB[ch:a][hd:b][qk:c][hq:d]C[（布局）白先。白棋应占据具有一箭双雕作用的要点，以继续维护实地领先。请在 a、b、c、d 中选择。]SZ[19](;W[ch]N[图1 黑棋广阔（8分）]C[图1 黑棋广阔（8分）白棋在左边拆是眼见的大场];B[iq]C[但被黑攻击右下方白棋后，白棋不好];W[ko];B[io]CR[ko]C[以后白棋跳、黑跳是预想的进行，结果黑棋广阔。])(;W[hd]N[图2 白棋消极（6分）]C[图2 白棋消极（6分）白棋在上边防守，显得过于消极];B[iq]C[黑棋逼是绝好点];W[ko];B[io];W[km];B[cg]C[黑棋再抢占左边大场，黑棋形势领先。])(;W[qk]N[图3 最差点（4分）]C[图3 最差点（4分）白棋在右边拆知识单纯地扩张实地，除此以外，没有任何含义];B[iq]C[黑棋逼是很严厉的一手];W[ch]C[白棋如果在下边脱先……];B[jo]C[则黑棋飞封，白棋不利。])(;W[hq]N[图4 正解（10分）]C[图4 正解（10分）白棋拆二，是最应优先考虑的位置];B[cg]C[其后黑棋占据左边大场];W[hd]C[白则在上边补棋，全局白棋实地占优。]))",

		//wqqlzwcs_11_3.sgf
		"(;AW[dc][ce][ic][ie][dp][fp][jq][mq][oj][mi][pi][qi][ri][rg][qf][pf]AB[kc][pd][nd][nf][qe][re][rf][ck][ch][cn][pq][nk][ok][pk][qj][rj]LB[ke:a][bp:b][np:c][en:d]C[（中盘）黑先。黑棋应一眼就能发现这样的位置，这一位置必须能最大限度发挥所投入棋子的价值。请在 a、b、c、d 中选择。]SZ[19](;B[ke]C[图1 最差点（4分）黑在上边跳，是与正解相距千里的一手棋]N[图1 最差点（4分）];W[po]C[白棋高挂是绝好点，结果白棋将黑棋上下分开，白棋非常满意。])(;B[bp]C[图2 时机不成熟（6分）黑棋飞角，在实地上很大，但时机不成熟]N[图2 时机不成熟（6分）];W[po]C[白棋高挂是绝好点];B[np]C[黑棋飞，试图向中腹出头];W[qq];B[qr];W[oq];B[op];W[pp];B[pr];W[nq]C[白棋强断黑棋，白棋成功。])(;B[np]C[图3 正解（10分）黑棋飞，围右下是当务之急]N[图3 正解（10分）];W[mp]C[白棋长];B[nq]C[黑棋挡];W[mo]C[白棋继续长];B[on]C[黑飞补，黑棋实地很坚固。])(;B[en]C[图3 方向错误（6分）黑棋跳，虽具有牵制白棋势力的意味，……]N[图3 方向错误（6分）];W[po]TR[en]C[但被白高挂后，黑棋跳即成为疑问手];B[qo];W[qn];B[qp]TR[qo]C[黑棋如果托、退的话……];W[nn]CR[qn]C[白棋扳、飞，轻松应对，白棋形势很充分。]))",

		//wqqlzwcs_11_4.sgf
		"(;AB[db][ec][ed][ee][fe][de][df][cf][dh][ei][ej][dj][cj][dl][el][fl][gl][cn][bn][bo][gd][hd][ie][jd][ke][kf][gi][hh][hj][ii][ji][im][jl][kl][ll][lk][lj][kj][kh][mh][lh][nh][lg][oi][oj][ok][nl][pm][pq][oq][mq][qr][iq][jq][jr][hr][is][pd][pc][ob][pf][qg]AW[cb][dc][dd][cd][ce][eb][fc][fd][gc][gb][di][eh][fi][gh][gg][hg][ih][jf][jg][jh][kg][ki][li][mi][ni][nj][nk][ij][jj][jk][ik][kk][hk][gk][fk][ek][fj][co][bp][dp][en][gq][gr][hq][ip][pp][on][qo][qq][rq][rm][rk][jc][kc][ld][nc][oe][lf][mf]SZ[19]LB[bf:a][ri:b][rr:c]C[（终盘）白先。目前在全盘中，大官子仍有好几处，白棋的首选位置是什么？白棋应该考虑到一处官子以后的后续手段。请在 a、b、c  中选择。](;W[ri]C[图1 正解（10分）白棋单跳是全盘价值最大的地方]N[图1 正解（10分）];B[rr]C[黑棋在右下角长也很大];W[rg]C[但白棋托];B[rf];W[qh];B[sg];W[rh];B[pg]C[白棋先手收官。])(;W[ri]C[图2 后续手段]N[图2 后续手段];B[rr];W[rg];B[rf];W[qh];B[sg];W[rh];B[pg];W[oh]C[白棋如有机会，断的手段可以成立];B[ng];W[ph];B[nf]C[黑补棋];W[ol]C[白棋再断，黑三子被吃。])(;W[rr]N[图3 白棋单纯（6分）]C[图3 白棋单纯（6分）白棋拐，单纯从大小来看是价值最大的地方];B[ho]C[黑棋刺，先手利用];W[hp];B[ri]C[然后黑棋占据要点，白棋不满。])(;W[bf]C[图4 大同小异（6分）]N[图4 大同小异（6分）];B[bg];W[be]LB[bh:a]C[白棋在左边扳粘，伺机在 a 位夹];B[ri]C[但被黑占据要点之后，结果与图3 大同小异。]))",

		//wqqlzwcs_11_5.sgf
		"(;AB[br][bq][cp][dp][dn][eo][fo][go][ho][hp]AW[cq][dq][ep][fp][gp][hq][iq][jp][kq]C[（官子）黑先。黑棋如何利用白棋的断点来获取官子利益？]SZ[19](;B[er]N[图1 正解（10分）]C[图1 正解（10分）黑棋刺是官子手筋];W[eq];B[fr]CR[eq]C[白棋接后，黑棋往里长是好棋];W[dr];B[ds];W[gr];B[cr];W[gq]C[进行至此，黑棋先手便宜。])(;B[dr]C[图2 失败（0分）]N[图2 失败（0分）];W[er]TR[dr]C[黑棋夹，被白棋挡后，黑棋失败。];B[cr];W[eq];B[es];W[fs];B[ds];W[fr]C[与图1 相比，黑棋损 3 目左右。])(;B[fr]N[图3 失败（0分）]C[图3 失败（0分）黑棋点是形状上的急所];W[er]C[但被白棋挡后，黑棋一无所获];B[cr];W[es]C[进行至此，黑棋反而损失一子。]))",

		//wqqlzwcs_11_6.sgf
		"(;AB[br][cr][dr][dq][ep][fp][gp][hp][fq][ip][kp][jq][ir]AW[ar][aq][bq][cp][dp][do][cm][eq][er][fr][gq][hq][hr][hs]C[（手筋）黑先。黑棋四子已肯定无法生还，但黑棋可以利用这四子获取额外的利益，这里的手筋是什么？]SZ[19](;B[ds]C[图1 正解（10分）黑棋立是绝妙的手筋]N[图1 正解（10分）];W[es]C[白棋必挡];B[gs];W[bs];B[is];W[cq];B[iq]C[进行至此，黑棋割掉白棋四子。])(;B[es]N[图2 失败（0分）]C[图2 失败（0分）黑棋扳失手];W[fs];B[cs]C[黑棋做劫];W[cq];B[gr];W[gs];B[is];W[bs];B[as];W[ds]C[但白棋有循环劫的防守手段。])(;B[gs]N[图3 失败（0分）]C[图3 失败（0分）黑棋点是次序错误];W[ds]C[白棋扳后，黑棋一无所获。]))",

		//wqqlzwcs_11_7.sgf
		"(;AW[bs][br][bq][cp][co][do][cm][ep][fp][fo][fq][fr][er][gr]AB[dr][dq][dp][eq][es][eo][en][fn][gn][go][hq][hr][jr]C[（手筋）黑先。现在黑白双方形成攻杀局面，黑棋如果能发现一第一手棋，以后就很简单了。]SZ[19](;B[ds]N[图1 正解（10分）]C[图1 正解（10分）黑棋单接是对杀的手筋];W[cq];B[gs];W[fs];B[gp];W[hs];B[gq]C[黑棋可简单吃住白棋。])(;B[gp]N[图2 失败（0分）]C[图2 失败（0分）黑棋先从外围紧气黑棋气显然不够，白棋简单收气即可吃住黑棋];W[ds]C[白棋扑是急所简单收气就行了。];B[cs];W[cr];B[gq];W[cq]C[黑棋气短被杀。])(;B[gs]N[图3 失败（0分）]C[图3 失败（0分）黑棋扳缺乏计算];W[ds]C[白棋扑是急所];B[cs];W[cr];B[fs];W[cq]C[白棋在对杀中取胜。]))",

		//wqqlzwcs_11_8.sgf
		"(;AB[cr][eq][fq][gr][fr]AW[dp][cp][fp][ep][gq][hq][hr]C[（死活）白先。白棋如何诱使黑棋进入死亡之途很重要。如果白棋过于拘泥于棋形，则很容易失败。]SZ[19](;W[bq]N[图1 正解（10分）]C[图1 正解（10分）白棋小尖，冷静];B[br];W[ar]C[白棋扳后，黑不是活形];B[dq];W[gs]C[黑棋被杀本题是常识，不过只要熟悉基本死活形状，应该不难。])(;W[dr]N[图2 失败（0分）]C[图2 失败（0分）白棋跨似是而非];B[dq];W[br];B[ds];W[gs];B[er]C[黑棋已经做活。])(;W[br]N[图3 失败（0分）]C[图3 失败（0分）白棋靠];B[dr]C[黑棋老老实实地拉回，仍是白棋失败。]))",

		//wqqlzwcs_11_9.sgf
		"(;AB[br][dp][dq][dr][cp]AW[bo][do][co][eo][ep][eq][er][gr]SZ[19]C[（死活）白先。行棋的次序非常重要。应尽可能利用黑棋的不入气，才能获得成功。](;W[ds]N[图1 正解（10分）]C[图1 正解（10分）白棋扳，冷静];B[cs]C[黑棋必挡。黑棋挡是最强抵抗];W[bq]C[白棋跳是要领];B[bp];W[ap];B[ar];W[aq]C[白棋利用黑棋的不入气而吃住黑棋。])(;W[bq]N[图2 失败（0分）]C[图2 失败（0分）白棋单跳要失败];B[bp];W[ap];B[cq]C[黑棋只有打这一手];W[ar]C[劫杀，白棋失败。])(;W[bq]C[图3 变化图]N[图3 变化图];B[bp];W[bs]C[白棋夹虽是手筋];B[cs];W[ar]C[仍然要打劫。]))",

		//wqqlzwcs_11_10.sgf
		"(;AB[ds][dr][dq][cp][br]AW[bo][co][do][ep][eq][er][es]C[（死活）白先。这里白棋蕴藏着妙手，而首先压缩黑棋的做活空间是必要的条件。请问应如何下？]SZ[19](;W[bp]C[图1 正解（10分）]N[图1 正解（10分）];B[bq];W[aq]CR[bp]C[白棋冲、扳，缩小黑棋眼位，简单明了];B[ar];W[bs]C[白棋点是死活的急所];B[dp]C[黑棋团，扩大眼位];W[cr]C[白棋挖入是妙手，黑棋必死。])(;W[bp]C[图2 变化图]N[图2 变化图];B[bq];W[aq];B[ar];W[bs];B[cs]CR[bs]C[白棋点时，黑棋打吃];W[cq]C[白棋扑即可，黑棋没有两只眼。])(;W[bq]N[图3 失败（0分）]C[图3 失败（0分）白棋跳，缺乏计算];B[bp]C[黑棋冲，当然];W[ap];B[ar];W[cq];B[cr];W[dp];B[bs]C[黑棋弃掉两子，在角上做活，黑棋满足。]))",
	],

	[

		//wqqlzwcs_12_1.sgf
		"(;AB[qd][pe][pq][bc][cc][bd][bg][cg][df][de][dd][ed][fd][ec][gc]AW[dc][db][eb][fb][fc][cd][ce][cf][dg][eg][ch][gd][hc][dq][oc]LB[qn:a][do:b][nd:c][jq:d]C[（布局）黑先。左上角的定式告一段落之后，黑棋应怎样争取局势的主动权？请在 a、b、c、d 中选择。]SZ[19](;B[qn]N[图1 时机不成熟（6分）]C[图1 时机不成熟（6分）黑棋大飞守角，虽是理论上的大场，……];W[ne]C[但被白飞起扩张上边势力之后，白棋势力充满活力，因此黑缔角的时间不成熟。])(;B[do]N[图2 最差点（4分）]C[图2 最差点（4分）黑在左下高挂，实际上不应急于考虑];W[ne]C[白棋飞是大势要点];B[qn];W[fp]C[进行至此，白棋领先。])(;B[nd]N[图3 正解（10分）]C[图3 正解（10分）黑棋飞压是关键所在];W[mc]C[白如果补棋];B[qn]C[黑则守角，全局黑棋活跃。])(;B[jq]N[图4 方向错误（6分）]C[图4 方向错误（6分）黑棋在下边开拆方向错误];W[ne]C[白飞起];B[qo]TR[jq]C[黑棋缔角是考虑到下边开拆一子的体面的一手];W[ng]C[白棋跳后，白棋外势充满活力。]))",

		//wqqlzwcs_12_2.sgf
		"(;AB[qd][oc][qj][qo][cq][cp][do][cl]AW[dc][ce][dq][cr][er][fp][pq][jc]LB[ci:a][lc:b][op:c][mq:d]C[（布局）黑先。黑棋从全局的棋子布置上考虑问题，目前不能放过的要点是什么？请在 a、b、c、d 中选择。]SZ[19](;B[ci]C[图1 次选方法（8分）黑棋左边拆二在实地上非常大]N[图1 次选方法（8分）];W[op]C[但白尖起];B[lc]C[黑再在上边拆];W[pn];B[qm];W[jq]C[白可扩张下边，黑棋略有不满。])(;B[lc]C[图2 方向错误（6分）黑棋在上边拆二是方向错误]N[图2 方向错误（6分）];W[op]C[而白棋尖是好棋];B[pm]C[其后黑棋如果补];W[cj]C[则白棋拦，白棋充分可下。])(;B[op]C[图3 正解（10分）黑棋飞压是扩张势力的好棋]N[图3 正解（10分）];W[oq];B[np];W[mq]C[白棋只得如此];B[lc]C[黑棋获先手后再占取上边要点，黑棋很充分。从上边到右边，黑棋势力明显。])(;B[mq]C[图4 黑棋贪心（6分）黑棋夹攻是重视下边的手法，但过于贪心]N[图4 黑棋贪心（6分）];W[op]C[白尖出];B[jq]C[黑拆二];W[qp]C[白棋再取角地];B[lc]C[白棋形势充分。]))",

		//wqqlzwcs_12_3.sgf
		"(;AB[dd][fd][dj][cn][pd][qc][nc][qk][qm][pm]AW[dp][fp][jq][pq][po][qn][qi][qf][rd]LB[bp:a][nn:b][cd:c][jc:d]C[（中盘）白先。目前白棋是首先扩张自己的势力，还是首先牵制对方的势力？请在 a、b、c、d 中选择。]SZ[19](;W[bp]C[图1 时机不成熟（6分）白棋跳下，在防守左下角的同时，还可伺机打入左边，但目前时机不成熟]N[图1 时机不成熟（6分）];B[nn]C[黑棋飞是牵制白棋势力的好点。])(;W[nn]C[图2 正解（10分）白棋飞，扩张下边白势是全局的要点，而且还兼有攻击黑棋三子的作用]N[图2 正解（10分）];B[nl];W[lm]TR[nl]C[黑棋补时，白再飞，白棋掌握了主动权。])(;W[cd]C[图3 疑问手（4分）白棋托角是疑问手]N[图3 疑问手（4分）];B[ce];W[be];B[de];W[cc];B[bf];W[eb];B[fb];W[ec];B[fc];W[bd]C[黑棋在左上角下得很稳];B[ph];W[qh];B[pf]C[然后黑棋在右边先手扩张，黑棋非常有利。])(;W[jc]C[图4  大同小异（4分）白棋分投仍是疑问手]N[图4  大同小异（4分）];B[hc]C[黑棋拦];W[lc];B[ph];W[qh];B[pf]TR[ph]C[之后黑棋点、靠，攻击白棋，绝好。]))",

		//wqqlzwcs_12_4.sgf
		"(;AB[de][dg][cf][ck][dq][dr][do][eq][ep][fq][gq][gr][fn][em][el][fl][gj][gi][fh][ff][gf][if][hf][ie][jd][jc][jb][ib][kb][ha][ke][le][ld][me][nd][nf][oc][pd][qe][jg][jh][lh][kh][mh][nh][og][nj][oj][kj][jk][ip][io][jo][ko][lo][mq][lr][kr][on][pn][qn][qm][ql][rl][pq][pr][pp][po][qr]AW[qq][qp][qo][rr][rs][rn][rm][ce][cd][dc][eb][ec][ed][fc][fa][gb][hb][ia][ka][ef][fe][ge][he][hd][id][ic][kd][kc][lc][lb][mc][md][nb][je][jf][kf][kg][lg][mg][ng][ig][ih][hj][ij][hl][il][fm][gm][hn][ho][hp][hr][hq][iq][jp][jr][kq][fr][cr][cq][cp][co][cn][dp][mk][nk][ok][pk][qj][pm][om][qg]LB[be:a][ob:b][sl:c]C[（终盘）黑先。目前对局即将结束，白棋处于优势，但是黑棋却有挽回劣势的要点。请在 a、b、c 中选择。]SZ[19](;B[sl]C[图1  正解（10分）黑棋立是官子手筋]N[图1  正解（10分）];W[ro]C[白棋补角必然];B[qi]LB[rj:a]C[黑棋靠下是连贯的好棋，白棋有 a 位的弱点];W[ri];B[qh];W[sj];B[pj];W[qk];B[rh]C[黑棋拐下，割掉白一子。])(;B[sl]C[图2   变化图]N[图2   变化图];W[rj]TR[sl]C[黑棋立时，白棋立无理];B[sp]C[黑棋在白角存在手段];W[ro];B[rq];W[rp];B[sr]LB[so:a]C[白角被劫杀。注意白棋只能打劫，如在 a 位打，黑棋可粘，白被净杀。])(;B[be]C[图3  不负责任（6分）黑棋扳是不负责任的一手棋]N[图3  不负责任（6分）];W[ri]C[白棋补后，黑棋无法挽回逆势。])(;B[ob]C[图4  大同小异（6分）黑棋挡]N[图4  大同小异（6分）];W[ri]C[被白补棋后，结果与图3 大同小异。]))",

		//wqqlzwcs_12_5.sgf
		"(;AW[cr][cp][dq][eq][bo][bn][cm][cl]AB[co][cn][dp][ep][en][fr][fq][er]C[（官子）黑先。黑棋如何利用白棋的弱点捞取便宜？]SZ[19](;B[cs]N[图1 正解（10分）]C[图1 正解（10分）黑棋托是官子手筋];W[br]C[白棋只好退让];B[dr];W[cq];B[bs]C[进行至此，黑棋成功收官。])(;B[cs]C[图2 变化图]N[图2 变化图];W[bs]TR[cs]C[黑棋托时，白棋打吃无理。];B[br]C[黑棋断打];W[ds];B[bq];W[cq];B[bp]C[进行至此，白棋损失惨重。])(;B[br]N[图3 失败（0分）]C[图3 失败（0分）黑棋靠是俗手];W[bq]C[白棋虎是好棋];B[dr];W[cs]TR[dr]C[黑棋打时， 白棋立下即可。])(;B[br]C[附图1 ]N[附图1 ];W[cq]TR[br]C[黑棋靠时，白棋接，黑棋并没有手段];B[cs];W[ds];B[bs];W[dr]C[这里实在看不出黑棋有什么手段。])(;B[dr]N[附图2 黑损]C[附图2 黑损黑棋直接打吃收官];W[bq]C[白棋虎是好棋];B[cq];W[dq]LB[cs:a]C[这样黑棋 a 位的扳不是先手。]))",

		//wqqlzwcs_12_6.sgf
		"(;AW[cq][bq][bo][bn][cn][cl][dm][fm][en][eq][fq][gp][hq]AB[dn][do][dp][dq][co][bp][ap][fp][fo]C[（手筋）黑先。目前黑棋需同时处理被切断和白棋扳渡这样两个问题，黑棋二者兼顾的手筋是什么？]SZ[19](;B[br]N[图1 正解（10分）]C[图1 正解（10分）黑棋夹，是能够同时处理两侧的手筋];W[cr];B[dr];W[ar];B[bs]C[黑棋安然无恙。])(;B[dr]N[图2 失败（0分）]C[图2 失败（0分）黑棋下立考虑不周];W[cp]C[白棋可断，黑棋大损。])(;B[cp]N[图3 失败（0分）]C[图3 失败（0分）黑棋接仍然失败];W[dr]C[白棋渡过后，黑棋整体成为浮棋。]))",

		//wqqlzwcs_12_7.sgf
		"(;AB[br][cr][dq][eq][fr][fp][gp][hp][eo][en][cn][co]AW[ar][bq][cq][dp][ep][cp][go][fo][ho][io][ip][fq]C[（手筋）白先。白棋如何才能救活角上白子？]SZ[19](;W[er]N[图1 正解（10分）]C[图1 正解（10分）白棋打吃是手筋];B[dr]C[黑棋如果反打的话……];W[gq]C[白再长出];B[hq];W[gr];B[hr];W[fs]C[双方对杀，白胜。])(;W[er]C[图2 变化图]N[图2 变化图];B[gq]CR[er]C[白断打时，黑棋提子];W[dr]C[白棋打即可，白可在角上做活。])(;W[hq]N[图3 失败（0分）]C[图3 失败（0分）白棋从这里打吃是恶手];B[gq];W[gr];B[fq]C[黑棋粘上后，白棋一无所获。对杀黑胜利。]))",

		//wqqlzwcs_12_8.sgf
		"(;AW[cq][cp][bp][do][ep][fq][fr][hr]AB[bq][cr][dq][er][fs]C[（死活）黑先。黑棋应该无条件做活，劫活就是黑棋的失败。]SZ[19](;B[aq]C[图1 正解（10分）黑棋立是做活的要点]N[图1 正解（10分）];W[bs];B[br]CR[bs]C[白棋点时，黑棋要接];W[eq];B[as]C[黑棋可以做出两只眼。])(;B[bs]N[图2 失败（0分）]C[图2 失败（0分）黑棋虎];W[aq];B[ar]C[这里形成劫活。])(;B[br]N[图3 黑棋失败（0分）]C[图3 黑棋失败（0分）黑棋单粘仍是恶手];W[aq];B[ar];W[eq]C[白棋挤，冷静];B[bs];W[ds]C[白棋点，黑棋被杀。]))",

		//wqqlzwcs_12_9.sgf
		"(;AB[cr][bq][dq][dp][do][co]AW[bn][cm][el][en][ep][eo][eq][er][dr]C[（死活）白先。白棋有擒杀黑棋的妙手，第一手和第三手棋是关键。]SZ[19](;W[bs]C[图1 正解（10分）]N[图1 正解（10分）];B[cs];W[bp]CR[bs]TR[cs]C[白棋点，黑棋挡后白棋再跳是正确的次序，黑棋不杀。])(;W[bs]C[图2 变化图]N[图2 变化图];B[bo]CR[bs]C[白棋点，黑棋换个方向挡];W[cs]C[白棋连回，冷静];B[br];W[cp];B[ar];W[ap]C[白棋仍然吃住黑棋。])(;W[bp]N[图3 失败（0分）]C[图3 失败（0分）白棋立即跳入];B[bo];W[ao];B[ap];W[aq];B[ar]C[黑棋成功做活。]))",

		//wqqlzwcs_12_10.sgf
		"(;AW[br][cs][ds][cq][dq][cp][co][do][eo][fo][go][ho][hp][hq][ir][is][jq][fq]AB[bq][cr][dr][eq][er][ep][dp][fp][gp][gq][gr][hr]SZ[19]C[（死活）白先。白棋有吃住黑棋的方法，只要能发现第一手棋，下面就简单了。](;W[as]C[图1 正解（10分）白棋虎是杀黑的要点]N[图1 正解（10分）];B[hs];W[fs];B[fr];W[es]C[黑棋不活。注意黑棋气紧])(;W[as]C[图2 变化图]N[图2 变化图];B[fr]C[黑棋如果提子……];W[hs]C[白棋单冲，冷静];B[gs];W[es]C[黑棋不活。])(;W[bp]C[图2 失败（0分）白棋直接打吃是恶手]N[图2 失败（0分）];B[es]C[黑棋打吃，成功做活。]))",
	],

	[

		//wqqlzwcs_13_1.sgf
		"(;AB[df][dd][cc][ci][dq][cp][jp][nq][qi][oi][pf][qf]AW[db][fc][ic][pd][nd][qe][qk][pp][pn][cn][ck]LB[kd:a][en:b][pr:c][rf:d]SZ[19]C[（布局）白先。白棋现在有不能放过的急所。如果站在对方的立场上考虑一下，便可轻易找到答案。请在 a、b、c、d 中选择。](;W[kd]N[图1 时机不成熟（6分）]C[图1 时机不成熟（6分）白棋守上边，虽能围住上边，但由于其右上角的三三空虚，白空并不完整。];B[en]C[黑棋镇是扩张和攻击左边白拆二的要点];W[ek]C[白棋跳是绝对的一手];B[no]C[黑棋跳起后，黑棋优势。])(;W[en]C[图2 正解（10分）白棋跳是限制黑势和照顾自己安全的好棋]N[图2 正解（10分）];B[gp]C[黑棋补];W[pr]C[白再守右下角，白棋可平和地控制局面。])(;W[pr]N[图3 方向错误（6分）]C[图3 方向错误（6分）白棋跳下，虽可既补角又可伺机打入下边，……];B[en]C[但被黑棋镇先手利用后，白棋痛苦];W[ek]C[白棋跳是必然的];B[no]C[黑棋也跳，黑棋布局领先。])(;W[rf]C[图4 最差点（4分）]N[图4 最差点（4分）];B[rg];W[re]C[白棋扳粘脱离主战场];B[en]C[黑棋镇头是绝好点];W[pr]C[其后白棋在左边脱先守右下角的话，……];B[ek]C[黑棋再镇，黑棋绝对有利。]))",

		//wqqlzwcs_13_2.sgf
		"(;AB[pd][nd][kc][qc][ep][fp][fq][em][qp][qo][pq][pr][or][op][nq][mp][no]AW[dc][cp][cn][dq][eq][on][oo][po][pp][qn][pm][qq][rq][qi][qf][rd]LB[jp:a][de:b][cl:c][nm:d]C[（布局）黑先。黑白双方必争的大势要点在何处？如果被白棋占据此位，黑棋将在大势上落后。]SZ[19](;B[jp]N[图1 最差点（4分）]C[图1 最差点（4分）黑棋在下边守过于消极];W[mm]C[白棋飞是形势的要点，白棋在布局阶段就已处于领先地位。])(;B[de]N[图2 次选方法（8分）]C[图2 次选方法（8分）黑棋高挂是理论上的大场];W[mm]C[但白棋飞，黑棋挂角的价值没有白棋飞的大];B[fd]C[黑棋飞封虽具气势];W[ce];B[cf];W[cd];B[dg];W[km]C[但白先手处理好左上角后，先在中腹跳，白棋有利。])(;B[cl]N[图3 方向错误（6分）]C[图3 方向错误（6分）黑棋飞封无疑也是好点，但方向错误，因为其缺点是不能对白角地施加任何影响];W[mm]C[白棋飞是大势要点];B[kn];W[kl]C[进行至此，白棋心情很好。])(;B[nm]N[图4 正解（10分）]C[图4 正解（10分）从全局棋子的布置分析，扩张下边黑势是当务之急。黑棋跳不仅可以扩张黑势，而且还能限制右边白势，因此黑棋跳是绝好点。]))",

		//wqqlzwcs_13_3.sgf
		"(;AB[fc][hd][jd][pc][pd][pe][nc][og][qh][pq][qo][lp][bs][br][cp][cq][cn][bn]AW[dd][df][cj][cl][em][do][dp][dq][dr][cr][jp][ge][pb][qb][qc][qd][qf]LB[kn:a][if:b][db:c][jj:d]C[（中盘）白先。 现在黑白双方均以大模样相对，如果白棋的方向选择错误，白棋可能失败。请在 a、b、c、d 中选择。]SZ[19](;W[kn]C[图1 正解（10分）白棋飞是大势要点]N[图1 正解（10分）];B[ig]C[黑棋大飞];W[mn]C[白棋跳，白棋心情很好。])(;W[if]C[图2 方向错误（6分）白棋在上边飞方向错误]N[图2 方向错误（6分）];B[kn]C[黑棋占据大势要点];W[in]C[白防守];B[jl]C[黑棋再飞，黑势很大，而且充满活力。])(;W[db]N[图3 最差点（4分）]C[图3 最差点（4分）白棋跳只不过是官子行为];B[kn]C[黑棋飞是当然的大势要点];W[jj]C[白棋牵制黑势];B[in]C[进行至此，白势被削弱，黑棋有利。])(;W[jj]C[图4  黑棋优势（6分）]N[图4  黑棋优势（6分）];B[kn]CR[jj]C[白占天元虽是势力扩张的要点，但不如黑棋飞重要];W[in];B[kl];W[il];B[lj]C[双方对围，但黑势更明显。]))",

		//wqqlzwcs_13_4.sgf
		"(;AB[de][dg][cf][ck][dq][dr][do][eq][ep][fq][gq][gr][fn][em][el][fl][gj][gi][fh][ff][gf][if][hf][ie][jd][jc][jb][ib][kb][ha][ke][le][ld][me][nd][nf][oc][pd][qe][jg][jh][lh][kh][mh][nh][og][nj][oj][kj][jk][ip][io][jo][ko][lo][mq][lr][kr][on][pn][qn][qm][ql][rl][pq][pr][pp][po][qr][sl][pj][qh][qi][rh][rg][cl][bl][cm][bg][cg][eh][eo]AW[qq][qp][qo][rr][rs][rn][rm][ce][cd][dc][eb][ec][ed][fc][fa][gb][hb][ia][ka][ef][fe][ge][he][hd][id][ic][kd][kc][lc][lb][mc][md][nb][je][jf][kf][kg][lg][mg][ng][ig][ih][hj][ij][hl][il][fm][gm][hn][ho][hp][hr][hq][iq][jp][jr][kq][fr][cr][cq][cp][co][cn][dp][mk][nk][ok][pk][qj][pm][om][qg][ro][ri][sh][sj][qk][bm][dm][bf][df][eg][fo][gn][jm][kl]SZ[19]LB[pa:a][qa:b][pb:c][sg:d]C[（终盘）白先。白棋如何处理右上角是收官的关键。在 a、b、c 中，白棋如何下最为有利？](;W[sg]N[图1 正解（10分）]C[图1 正解（10分）白棋先爬];B[sf];W[si];B[rf];W[pb]C[然后白棋再跳是正确的次序];B[ob];W[oa];B[qb];W[qa];B[pc];W[pa];B[ra];W[na];B[rb]C[进行至此，白棋两面先手得利。])(;W[pa]N[图2 次序错误（6分）]C[图2 次序错误（6分）];B[oa]CR[pa]C[白棋先飞，黑棋有搭的手段];W[ob];B[pb];W[qa];B[qb];W[ra];B[rb]LB[sg:a]C[进行至此，a 位已不是白棋的先手。])(;W[qa]N[图3 大同小异（6分）]C[图3 大同小异（6分）白棋大飞];B[oa];W[ob];B[pb];W[pa];B[qb]C[结果与图2 大同小异。])(;W[pb]N[图4 白棋受损（6分）]C[图4 白棋受损（6分）白棋跳仍是次序错误];B[ob];W[oa];B[qb];W[sg];B[sf];W[si];B[rc]C[进行至此，与图1 的差别很大。]))",

		//wqqlzwcs_13_5.sgf
		"(;AW[br][cr][ds][er][fq][fo][hq]AB[cq][dq][dr][dp][do][cj][dm][dn]C[（官子）黑先。黑棋应寻求先手封空的方法。]SZ[19](;B[ar]N[图1 正解（10分）]C[图1 正解（10分）黑棋顶是官子的手筋];W[bq];B[bp];W[aq];B[ap];W[as]C[白吃黑一子，黑先手封空。白棋提子必要，防止黑棋做劫。])(;B[bq]N[图2 失败（0分）]C[图2 失败（0分）黑棋单挡];W[ar];B[aq]C[黑棋后手。])(;B[bq]C[图3 参考图]N[图3 参考图];W[ar];B[]C[黑棋这里脱先的话];W[aq]C[白棋爬的官子很大];B[bo];W[ao];B[an];W[ap];B[bn]C[有先手 7 目之多。]))",

		//wqqlzwcs_13_6.sgf
		"(;AW[aq][bp][cq][cr][dr][eq][fq][fn][gn][ho][io][hq][iq]AB[cp][dp][ep][dq][bo][cn][en][em][gl][il][km][ko][kq][gp][gq]C[棋力测试第 13 轮（手筋）黑先。黑棋如何能既补自己的断点，又分断左右白棋？]SZ[19](;B[er]N[图1 正解（10分）]C[图1 正解（10分）黑棋断是绝妙的手筋];W[fr];B[gr]CR[fr]C[白棋打，黑顺势冲下切断白棋。])(;B[fr]N[图2 失败（0分）]C[图2 失败（0分）黑棋扳失误];W[er];B[hr]LB[fp:a][gr:b]C[黑 a 的话，白可 b 打吃，联络没问题。];W[fp];B[ir];W[fo]C[黑棋有所收获，但白棋全部连回。])(;B[gr]N[图3 失败（0分）]C[图3 失败（0分）黑棋直接立下更是失误];W[fp]C[白棋冲断后，黑三子被吃。]))",

		//wqqlzwcs_13_7.sgf
		"(;AB[eq][fq][gp][go][hq][fn][fm][dm][gl]AW[dq][dp][dn][fp][fo][cm][dk][gn][hn]C[（手筋）黑先。黑棋如何利用白棋形上的弱点获取利益？]SZ[19](;B[cn]N[图1 正解（10分）]C[图1 正解（10分）黑棋断是绝妙的手筋];W[co]C[白棋从这里打];B[en];W[do];B[cl];W[bn];B[dl]C[黑棋可以分断黑棋。])(;B[cn]C[图2 变化图]N[图2 变化图];W[dl]TR[cn]C[黑棋断时，白棋外打];B[do];W[em];B[en]C[白棋角地被破坏。])(;B[cl]N[图3 失败（0分）]C[图3 失败（0分）黑棋立即扳是失误];W[dl];B[em];W[cn]C[黑棋一无所获。]))",

		//wqqlzwcs_13_8.sgf
		"(;AB[cr][dr][eq][fq][gq][hq][hs][hr]AW[fr][br][bp][cq][dp][fp][ep][gp][hp][ip][iq][ir]C[（死活）黑先。这是黑棋可成功求活的一种图形。第一手棋是要点。]SZ[19](;B[er]N[图1 正解（10分）]C[图1 正解（10分）黑棋团是死活的急所];W[es];B[gs];W[fs];B[cs]C[双活。])(;B[fs]N[图2 失败（0分）]C[图2 失败（0分）黑棋夹失败];W[es];B[gr];W[gs]C[黑棋劫活。])(;B[cs]N[图3 黑棋失败（0分）]C[图3 黑棋失败（0分）黑棋立下扩大眼位是恶手];W[es];B[gs];W[er];B[dq];W[fs]C[黑棋被杀。])(;B[dq]C[附图 黑失败。黑棋扩大眼位，也不行。基本死活形状]N[附图 黑失败];W[es]C[白棋尖是急所];B[gs];W[cs];B[ds];W[fs]C[黑棋被杀。]))",

		//wqqlzwcs_13_9.sgf
		"(;AB[bs][br][cq][dq][eq][fq][fs][gr]AW[ar][bq][bp][cp][dp][fp][ep][gp][gq][iq][hr][hs]C[棋力测试第 13 轮（死活）白先。白棋应利用在一线上的白子杀死黑棋。]SZ[19](;W[ds]N[图1 正解（10分）]C[图1 正解（10分）白棋点是死活的急所];B[dr];W[cs];B[es];W[fr]C[黑棋被杀。相当基本的死活。])(;W[gs]N[图2 失败（0分）]C[图2 失败（0分）白棋直接打吃，失败];B[ds];W[fr];B[er]C[黑棋可以下成劫活。])(;W[gs]C[图3 失败（0分）]N[图3 失败（0分）];B[ds];W[cr]C[白棋点如何？];B[er]C[同样是打劫。]))",

		//wqqlzwcs_13_10.sgf
		"(;AB[cs][cr][dq][dp][ep][fp][gp][gq][gr]AW[es][br][bq][cq][co][do][eo][fo][go][ho][hp][hq][hr]C[（死活）黑先。如果黑棋过于贪心，则会全部被杀死。因此黑棋必须做出部分牺牲，才能救活大棋。]SZ[19](;B[gs]N[图1 正解（10分）]C[图1 正解（10分）黑棋下立是做活的唯一方法];W[dr]C[白棋必断。白棋走其他地方，黑棋粘上，双活。];B[er];W[bs];B[fs];W[ds];B[fq]C[黑棋简单做活。])(;B[fs]N[图2 黑棋失败（0分）]C[图2 黑棋失败（0分）黑棋尖顶不行];W[fr]C[白棋可打吃];B[gs];W[dr];B[er];W[eq];B[fq];W[er]C[黑棋虽然努力做眼，但还是被杀。])(;B[er]C[图3 失败（0分）]N[图3 失败（0分）];W[gs]TR[er]C[黑棋虎，白棋连回后，黑棋简单被杀。]))",
	],

	[

		//wqqlzwcs_14_1.sgf
		"(;AB[pd][nc][qc][jq][cd][cc][de][ch][ck][ql][pn][on][om][oo][op][pp][qp]AW[cb][dc][eb][fd][co][dq][qf][of][rd][qj][pl][pm][qm][qn][qo][po]LB[lc:a][hq:b][cm:c][nk:d]C[（布局）白先。白棋如何牵制黑棋的势力是问题的关键，应寻找最有利的位置。请在 a、b、c、d 中选择。]SZ[19](;W[lc]C[图1 次选方法（8分）白棋逼，是针对右上角黑棋弱点的手段，但实际上白棋首先选择的不应是上边，而是下边]N[图1 次选方法（8分）];B[fq]C[黑在下边展开是绝好点];W[eo];B[fo];W[fn];B[go]C[进行至此，下边的黑棋构成理想形。])(;W[hq]C[图2 正解（10分）白棋在下边展开是当务之急]N[图2 正解（10分）];B[jo];W[ho]TR[jo]C[其后黑棋跳，白棋也跳，如此可以维护局势的均衡。])(;W[cm]C[图3 最差点（4分）白在左边拆一是价值最小的位置]N[图3 最差点（4分）];B[eq]C[黑棋靠是正确的选择];W[ep];B[fq];W[dr];B[fp];W[eo];B[gn]TR[eq]C[黑棋靠以下到飞出整形是正确的选择。])(;W[nk]C[图4 方向错误（6分）白棋飞看似急所，但实际上是方向错误]N[图4 方向错误（6分）];B[fq]C[黑棋展开是要点];W[eo];B[fo];W[en];B[kc]C[黑棋在下边争得先手后，再在上边拆二，黑棋有利。]))",

		//wqqlzwcs_14_2.sgf
		"(;AB[qd][nc][qg][nq][kq][pr][dq][ep][dc][cb][eb]AW[qj][pp][pn][qq][co][dm][ci][cc][cd][de]LB[jp:a][oj:b][fc:c][gd:d]C[（布局）白先。白棋应该利用黑棋的弱点，以掌握局势的主动权。请在 a、b、c、d 中选择。]SZ[19](;W[jp]C[图1  时机不成熟（6分）白兼冲是削黑势的急所，但时机不成熟]N[图1  时机不成熟（6分）];B[jq];W[ip];B[lo];W[jm]C[黑棋在下边循序渐进定形];B[fd]C[黑能够得到上边的补，黑棋心情不错。])(;W[oj]C[图2  最差点（4分）白棋在右边跳是一手无为的闲棋]N[图2  最差点（4分）];B[fd]C[黑棋补后，白棋布局在速度上落后。])(;W[fc]C[图3 次选方法（8分）白棋追攻脱先的黑棋，以掌握局势的主动权]N[图3 次选方法（8分）];B[ed];W[gd];B[ee];W[gf];B[gg];W[hf];B[ff];W[df];B[fh]TR[ed]C[黑棋尖出后，进行至此，黑棋整形。白棋左边势力被削弱，白棋略不满。])(;W[gd]C[图4 正解（10分）白棋大飞扩张势力是正确的]N[图4 正解（10分）];B[fc]C[其后黑棋虎整形];W[fd]C[白棋左边的阵形非常理想。]))",

		//wqqlzwcs_14_3.sgf
		"(;AB[dq][dr][er][cp][do][cj][dh][cf][jc][je][nd][oc][pc][qb][pp][nq]AW[cd][ec][hc][cl][el][ep][eq][fr][gp][jq][qn][qj][pd][qc][qe][pg]LB[rp:a][rc:b][he:c][lq:d]C[（中盘）黑先。目前有一个要点，对黑棋来说急须去抢占。请在 a、b、c、d 中选择。]SZ[19](;B[rp]C[图1  正解（10分）黑棋跳守角是最佳选择]N[图1  正解（10分）];W[on];B[rc]CR[on]C[其后白棋补右边时，黑在右上打吃，黑棋可以确保实地优势。])(;B[rc]C[图2  次选方法（8分）黑棋打吃虽也是一种感觉，……]N[图2  次选方法（8分）];W[qq]TR[rc]C[但被白棋点三三后，黑棋打吃一子即成为疑问手];B[qp];W[rp];B[ro];W[rq];B[qo];W[or]C[进行至此，黑棋实地被破，而且右下方黑棋全部变成浮棋。])(;B[he]C[图3  闲棋（4分）黑棋不让白棋向中腹出头，实际上是闲棋]N[图3  闲棋（4分）];W[qq]C[白棋点三三是正确的选择];B[qp];W[rp];B[pq];W[rr];B[qr];W[rq];B[lq];W[rc]C[黑棋右下安定自己，白棋得到先手在右上立下，白棋有利。])(;B[lq]N[图4  方法错误（4分）]C[图4  方法错误（4分）同样是补棋，但本图中黑棋拆一却是错误的方法];W[qq]C[白棋同样点三三是好棋];B[qp];W[rp];B[ro];W[rq];B[qo];W[or];B[oq];W[nr];B[mr];W[pq];B[pn]C[进行至此，黑棋变成空壳];W[rc]C[白再占据右上的要点，白棋有利。]))",

		//wqqlzwcs_14_4.sgf
		"(;AB[qb][qc][pc][pd][qe][qf][qi][ri][nf][oj][nj][mj][om][nm][ml][ll][kk][kj][ki][li][lh][mh][nn][no][oq][pq][pp][qo][ro][mp][mq][lr][lo][ko][jo][io][in][jm][hp][fo][en][fm][gm][hm][dm][cm][cn][bn][bo][bp][cp][cq][cr][dr][ck][cj][bi][ch][di][cg][ei][eh][ej][fh][ef][gg][gf][ge][gd][ec][eb][hd][id][jd][kd][ic][ib][jc][kb][ha][ke][kf][kg][ne]AW[bf][cf][db][dc][dd][ed][fd][gc][hb][fb][bj][bk][bm][am][cl][dl][el][fl][gl][jl][il][hl][kl][im][em][dn][do][dp][dq][co][er][eq][fp][gp][fr][gr][hq][iq][kq][jn][kn][ln][fi][gi][ii][jh][kh][jg][jf][ie][kc][lc][le][ld][lg][lf][nc][oc][pb][od][oe][pe][og][nh][ni][mi][mg][rj][rk][pk][nl][pm][qn][rn][sn][po][oo][op][np][on][lk][lj]LB[mb:a][qj:b][so:c][jr:d]C[（终盘）黑先。在 a、b、c、d 中，黑棋应以什么样的次序进行收官最佳？]SZ[19](;B[mb]C[图1  正解（10分）黑棋跳是正确的收官手段]N[图1  正解（10分）];W[lb];B[la];W[mc];B[pa];W[nb];B[ma];W[na];B[ka];W[me];B[nq]C[黑棋争得先手后，再回到右下角，是正确的次序。];W[pn];B[so]C[以后黑棋还有a 位破白棋眼位的手段。]LB[nd:a])(;B[so]N[图2  次选方法（8分）]C[图2  次选方法（8分）黑棋挡是逆收官子，其价值仅次于正确答案];W[lb]C[但白棋也同样逆收，黑棋收获不大。])(;B[jr]N[图3  后手（6分）]C[图3  后手（6分）];W[jq];B[kr]TR[jr]C[黑棋跳、连回虽然很大，却是后手];W[rq]C[白棋取得先手后，点入收官，白棋满足。])(;B[qj]C[图4  最差点（4分）]N[图4  最差点（4分）];W[qk];B[sj]TR[qj]C[黑棋冲、扳威胁到白棋的死活，但……];W[rq]C[但却给了白棋点入收官的机会];B[nq];W[pn];B[qq];W[rp];B[qp];W[so];B[rr];W[sr];B[rs];W[rm]C[进行至此，白棋再补活，白棋非常满足。]))",

		//wqqlzwcs_14_5.sgf
		"(;AB[br][bo][bp][bn][cp][cm][cl][dq][eq][er][fr][gr]AW[cq][cr][cn][co][dp][en][ep][fq][gq][hq][hr][go][gs]C[（官子）黑先。黑棋如何吃角上白棋二子最有利？]SZ[19](;B[ds]N[图1  正解（10分）]C[图1  正解（10分）黑棋尖是正确的官子手段];W[fs];B[cs];W[hs];B[es]C[进行至此，黑棋已很干净。])(;B[cs]N[图2  失败（0分）]C[图2  失败（0分）黑棋扳是恶手];W[ds];B[dr];W[bs];B[bq];W[fs]C[白棋渡过了。])(;B[dr]N[图3  失败（0分）]C[图3  失败（0分）黑棋直接紧气是失手];W[fs];B[bq]C[与图1 相比，黑棋损失 2 目左右。]))",

		//wqqlzwcs_14_6.sgf
		"(;AW[do][bo][bq][cq][eq][er][fp][fo][fn][go][bl][cl][dl][dm]AB[dn][cm][bm][em][fm][gm][gn][ho][io][gp][gq][fq]C[（手筋）黑先。左边的黑棋有两处断点，如能正确运用手筋，可同时把两处断点都补上。]SZ[19](;B[ep]C[图1 正解（10分）黑棋断是手筋]N[图1 正解（10分）];W[eo];B[co]C[黑棋再挖是好手，黑棋成功连通。])(;B[ep]C[图2 变化图]N[图2 变化图];W[cn]TR[ep]C[黑棋断时，白棋打吃];B[eo]C[黑棋打吃即可吃住白棋四子。])(;B[en]N[图3 失败（0分）]C[图3 失败（0分）黑棋单接是失手];W[cn]C[白棋断后，黑棋大损。]))",

		//wqqlzwcs_14_7.sgf
		"(;AW[br][cq][cp][dr][er][eq][fq][do][eo][fm]AB[cr][dq][dp][ep][fp][fo][hp][co][ck]C[（手筋）黑先。黑棋如能吃住中腹白棋二子，则万事大吉。其中行棋次序很重要。]SZ[19](;B[bq]N[图1 正解（10分）]C[图1 正解（10分）黑棋断打];W[bp];B[bo]C[黑棋再打];W[aq];B[en]C[黑棋争得先手后，征吃白二子。])(;B[bq]C[图2 变化图]N[图2 变化图];W[cs]TR[bq]C[黑棋打时，白提子无理];B[bp];W[cr];B[en];W[dn];B[dm];W[cn];B[bo];W[cm];B[dl];W[bn];B[cl]C[与图1 相比，白棋损失更大。])(;B[en]N[图3 失败（0分）]C[图3 失败（0分）黑棋先打失误];W[dn];B[dm];W[cn];B[bo];W[cm]C[白棋曲可以成立];B[bq];W[cs];B[bp];W[dl];B[cr];W[hr]C[白棋飞出，黑棋整体仍是浮棋。]))",

		//wqqlzwcs_14_8.sgf
		"(;AW[br][cs][ds][cq][cp][co][do][eo][fo][go][ho][hp][hq][hr][hs]AB[cr][dr][er][dq][dp][ep][fp][gp][gq][gr]C[（死活）黑先。黑棋应该谨防自己瞎撞气，目前净活已不可能，只要能劫活即告成功。]SZ[19](;B[ar]N[图1  正解（10分）]C[图1  正解（10分）黑棋夹是唯一的活路];W[bq]C[白棋接最善];B[fq]C[黑棋先做一眼];W[fs];B[gs];W[es];B[bs]C[进行至此，黑棋形成劫活。])(;B[ar]C[图2 变化图]N[图2 变化图];W[aq]TR[ar]C[黑棋夹时白棋打吃];B[es]C[黑棋也打，黑棋将净活];W[gs]C[白试图破眼];B[bs]C[但黑棋提子即可。])(;B[bq]N[图3  失败（0分）]C[图3  失败（0分）];W[as]TR[bq]C[黑棋断时，白有一一的妙手];B[fq];W[fs];B[gs];W[es]C[黑棋不活。本题黑棋气紧。]))",

		//wqqlzwcs_14_9.sgf
		"(;AW[br][bq][bp][co][cn][dn][fn][en][gn][go][gp][gq][gr][ir]AB[cr][cq][cp][dp][do][eo][fo][fp][fq][fr]C[（死活）白先。次序和方向都是重要问题，白棋应尽量利用黑棋气紧的弱点。]SZ[19](;W[fs]C[图1  正解（10分）白棋扳]N[图1  正解（10分）];B[es]C[黑棋必挡];W[cs]C[白棋再扳即可杀黑。];B[eq];W[dr]TR[eq]C[黑棋团眼，白可扳入。])(;W[cs]C[图2 失败（0分）白棋扳次序错误]N[图2 失败（0分）];B[ds]C[黑棋挡后，白已不可能再吃住黑棋];W[fs];B[er]CR[fs]C[白棋再扳的话，黑可轻易做活。])(;W[eq]C[图3 失败（0分）白棋点眼是恶手]N[图3 失败（0分）];B[cs]C[黑棋立下扩大眼位];W[fs];B[es];W[er];B[gs];W[dr];B[dq]C[双活。]))",

		//wqqlzwcs_14_10.sgf
		"(;AW[br][bq][bp][bo][cn][dn][en][fn][go][gp][gq][gr][ir][es]AB[cr][cq][cp][co][do][eo][fo][fp][fq][fr]SZ[19]C[（死活）黑先。白棋似乎已夺取了黑棋眼位，但黑棋仍有做成两个眼的绝妙手法。](;B[fs]N[图1  正解（10分）]C[图1  正解（10分）黑棋立下是唯一的活棋方法];W[cs]C[白棋渡];B[ds]C[黑棋扑];W[dr];B[dq]C[黑棋再曲];W[bs];B[er];W[ds];B[ep]C[进行至此，黑棋可以确保两眼。])(;B[ds]N[图2  失败（0分）]C[图2  失败（0分）黑棋尖顶要失败];W[fs]C[白棋连回];B[er];W[dq]C[白棋点后，黑不能活。])(;B[er]N[图3  黑棋失败（0分）]C[图3  黑棋失败（0分）黑棋曲];W[ds]C[白爬入是好棋，黑棋不能活。]))",
	],

	[

		//wqqlzwcs_15_1.sgf
		"(;AW[cc][cf][dp][jp][pc][qc][nc][nb]AB[fd][lc][pd][qd][od][me][qk][pq]LB[ff:a][lp:b][po:c][cn:d]SZ[19]C[（布局）黑先。考虑到周围棋子的布置，目前黑棋最优的点只有一个。应最大限度地利用“中国流”布局的优点。请在 a、b、c、d 中选择。](;B[ff]N[图1  黑棋失算（6分）]C[图1  黑棋失算（6分）黑棋单跳，试图扩展上边，但由于上边两侧都漏风，因此黑棋失算];W[mp]C[白在下边拆二限制黑势];B[po];W[dn]C[然后再守角是好棋，结果白棋满意。])(;B[lp]N[图2  正解（10分）]C[图2  正解（10分）黑棋展开是贯彻“中国流”布局的下法];W[cn]C[白守左下角];B[kn]C[黑棋飞贯彻势力作战的方针，右边黑势充满活力。])(;B[po]C[图3 次选方法（8分）黑棋缔角虽是理论上的大场，但却限制了自己的规模]N[图3 次选方法（8分）];W[cn]C[白在左下守角];B[lp];W[kn]TR[lp]C[黑棋展开时，白飞起，黑棋势力被大幅削减。])(;B[cn]C[图4 方向错误（6分）黑棋挂是方向错误]N[图4 方向错误（6分）];W[fp];B[bp];W[cq];B[ck];W[mq]C[进行至此，黑棋自动放弃了势力作战的方针，结果白棋全局下起来很舒服。]))",

		//wqqlzwcs_15_2.sgf
		"(;AW[pd][pf][pj][pq][qo][dr][cr][cq][cp][cn][fq]AB[dd][dj][jp][mp][dp][do][dq][eq][er][jd][md]LB[fp:a][dn:b][fd:c][mf:d]C[（布局）黑先。黑棋目前有很重要的位置，可继续实施外势作战的方针。请在 a、b、c、d 中选择。]SZ[19](;B[fp]C[图1  黑势被分割（6分）黑棋虎虽然很厚，但缺点是过缓]N[图1  黑势被分割（6分）];W[fc]C[白棋飞挂之后，黑势被分割。])(;B[dn]N[图2  正解（10分）]C[图2  正解（10分）黑棋压，封锁白棋向中腹的出头，是正确的选择。];W[cm];B[dm]CR[cm]C[白棋长时，黑棋继续构筑外势，黑棋从上边到下边，几乎连成了一片。])(;B[fd]N[图3  次选方法（8分）]C[图3  次选方法（8分）黑棋守角的目的是欲使黑棋构成立体化的模样];W[fo]C[但白棋将跳出];B[dn];W[cm];B[dm];W[hq]C[白棋跳后初具眼形，黑棋已不可能继续强攻。])(;B[mf]N[图4  最差点（4分）]C[图4  最差点（4分）黑棋跳是价值最小的地方];W[fo]C[白棋跳，出动的时机选择很好];B[gp];W[fp];B[dn];W[cm];B[gr]C[黑棋进攻];W[gq];B[hr];W[fm]C[进行至此，白棋成功逃跑。黑棋在大势上落后于白棋。]))",

		//wqqlzwcs_15_3.sgf
		"(;AB[pd][pf][qc][qb][qi][cp][dp][ep][go][hq][dj][dd][ed][fc][fb][fe][ce][cc][bc]AW[cb][dc][ec][eb][fd][gd][gc][gb][cd][cq][dq][fq][fr][oq][qp][pc][oc][nd][nf]LB[ef:a][qn:b][lp:c][dl:d]C[（中盘）黑先。如果能一眼发现正确答案所在，则证明已有较出色的感觉。黑棋如何把棋走厚？请在 a、b、c、d 中选择。]SZ[19](;B[ef]N[图1  正解（10分）]C[图1  正解（10分）黑棋虎整形，是黑棋的最佳选择，不仅可以固守左边，而且也是牵制上边白势的好点。])(;B[qn]N[图2 次选方法（8分）]C[图2 次选方法（8分）黑棋大拆，如果单纯从大小来看，是全盘最大的地方];W[fg]C[但被白棋占据要点之后，黑棋不满];B[dg]C[其后黑棋防守左边];W[fi]C[白棋跳，左边黑棋势力大幅萎缩。])(;B[lp]N[图3 方向错误（6分）]C[图3 方向错误（6分）黑在下边展开是方向错误];W[fg]C[白占据要点后，抢得了大势的主动权];B[dg]C[其后黑守左边];W[fi];B[qn];W[fk]CR[fi]C[白棋连跳，白棋领先。])(;B[dl]N[图4 最差点（4分）]C[图4 最差点（4分）黑棋在左边防守过于消极，是价值最小的地方];W[fg];B[dg];W[qk]CR[fg]C[白棋跳，争得先手后占据右边要点，白棋领先。]))",

		//wqqlzwcs_15_4.sgf
		"(;AW[cd][ce][dc][ec][fc][gc][hb][jb][hd][id][jd][je][ke][le][kf][jg][qb][rb][rc][sd][re][qf][qg][rg][sf][rh][ii][kj][mh][nh][oi][pi][nj][mj][oj][nk][nl][ok][pk][qk][rk][ql][qm][rn][ro][qp][qq][qr][rq][sp][pq][op][nq][il][km][kn][ko][lp][ip][gp][fo][do][en][fm][fl][ej][di][dj][dk][dh][ck][al][bl][bm][an][ao]AB[cj][bj][ch][cf][dg][eg][de][ed][gd][ge][he][ie][if][jf][ei][fi][hj][cm][dm][em][bn][bo][co][ap][dp][dq][gr][oq][pp][nm][ol][on][pm][qn][qo][rm][rl][sn][lm][ln][jk][jl][jm][kl][lk][mk][lj][li][lh][kg][ki][mi][ni][lf][mf][ph][oh][qh][qi][qj][pj][ib][kc][nc][pb][qc][qd][qe][rd][pd][oe][pf]LB[lb:a][be:b][ir:c][fr:d]C[（终盘）白先。白棋在官子阶段，争得先手是最重要的。a、b、c、d 中最好的下法是什么？]SZ[19](;W[fr]C[图1 正解（10分）白棋搭下，在下边先手定型是非常重要的]N[图1 正解（10分）];B[fq];W[gq];B[er];W[hr];B[fs];W[lb]C[然后白棋再转向上边跳，是正确的收官次序。])(;W[lb]C[图2 次序错误（6分）白棋先跳是次序错误]N[图2 次序错误（6分）];B[hr];W[jr]TR[hr]C[下边黑黑棋先手利用，白棋痛苦];B[lc];W[kb];B[mb]C[进行至此，白棋与图1 相比差别很大。])(;W[ir]C[图3 后手（6分）白棋跳下是后手，这是白棋的不满]N[图3 后手（6分）];B[kb];W[ic];B[be];W[bd]C[黑棋先手收官。])(;W[be]N[图4 最差点（4分）]C[图4 最差点（4分）白棋立是价值最小的地方];B[hr];W[jr]C[黑棋在下边争得先手];B[kb]C[然后黑再转至上边。]))",

		//wqqlzwcs_15_5.sgf
		"(;AW[dr][dq][dp][co][kp][lq][hp][hq][hr][is]AB[er][gr][fq][fp][fo][eo][fm][hs]C[（官子）黑先。黑棋有先手两侧得利的手段，你能看出来吗？]SZ[19](;B[ds]C[图1 正解（10分）]N[图1 正解（10分）];W[cs];B[fs]TR[ds]C[黑棋扳、虎，是正确的收官手段，以后黑可以利用打劫，在两侧得利。])(;B[ds]C[图2 变化图]N[图2 变化图];W[cr]TR[ds]C[黑棋扳时，白棋退];B[gs];W[jr];B[cs];W[bs];B[es];W[br]C[这样黑棋先手两边便宜。])(;B[gs]N[图3 失败（0分）]C[图3 失败（0分）黑棋单粘失误];W[jr];B[ds];W[cs];B[es];W[cr]C[与图2 相比，黑棋损失两目左右。]))",

		//wqqlzwcs_15_6.sgf
		"(;AW[cq][cp][cn][dp][ep][gp][gq]AB[dq][eq][fo][go][ho][ip][iq]C[（手筋）黑先。黑棋如何才能救回二子？]SZ[19](;B[gr]N[图1  正解（10分）]C[图1  正解（10分）黑棋托是手筋];W[hr]C[白棋如果扳下的话……];B[fp]C[黑棋冲];W[fq];B[fr];W[hq];B[ir]C[对杀黑胜。])(;B[gr]C[图2  变化图]N[图2  变化图];W[fr]TR[gr]C[黑棋托时，白换个方向扳];B[fq]C[黑棋断是要领];W[fp];B[er];W[hr];B[fs];W[hq];B[cr]C[黑棋可做活，收获很大。])(;B[fq]N[图3  失败（0分）]C[图3  失败（0分）黑棋先顶次序错误];W[fp];B[gr];W[hr]C[黑棋连不回去，只能劫活。]))",

		//wqqlzwcs_15_7.sgf
		"(;AW[hq][gp][fq][eq][dr][cq][bo][bn][cn][cl]AB[co][do][dp][dq][dn][el][fo][fp][dj][bj]C[（手筋）黑先。黑棋切断白棋四子的手筋是什么？]SZ[19](;B[cr]C[图1  正解（10分）黑棋断是绝妙的手筋]N[图1  正解（10分）];W[br];B[bq]C[之后黑棋断打是准备好的手段];W[cs];B[bp]C[黑棋成功地分断白棋。])(;B[bp]N[图2  失败（0分）]C[图2  失败（0分）黑棋扳下无谋];W[bq]C[白棋夹，即可上下联络。])(;B[bq]N[图3  失败（0分）]C[图3  失败（0分）黑棋夹];W[cr]C[白棋接后，黑棋一无所获。]))",

		//wqqlzwcs_15_8.sgf
		"(;AB[ar][br][bq][cq][dr]AW[aq][ap][bp][cp][dq][eq][fq][gq][hq][hr][hs]C[（死活）白先。白棋要无条件吃住黑棋很困难，但只要最大限度地利用周边的棋子，可以造成劫杀。]SZ[19](;W[ds]N[图1 正解（10分）]C[图1 正解（10分）白棋夹是急所];B[er]C[黑棋只得长];W[bs]C[白棋托是准备好的手段];B[cs]C[黑棋只好扑劫];W[cr]C[劫杀是正解。])(;W[ds]C[图2 变化图]N[图2 变化图];B[cs]CR[ds]C[白棋夹时，黑棋打吃不行];W[es];B[er];W[fs]C[白棋可连回，黑被净杀。])(;W[cs]N[图3 失败（0分）]C[图3 失败（0分）白棋点缺乏计算];B[bs];W[ds];B[er];W[es];B[fs]C[黑棋轻易做活。])(;W[ds]C[附图  黑被杀]N[附图  黑被杀];B[es]CR[ds]C[白棋夹时，黑棋从外面打吃也不行];W[cs]C[白棋长进去即可，黑做不出两眼。]))",

		//wqqlzwcs_15_9.sgf
		"(;AW[cr][cq][cp][dp][ep][eo][en][fn][gn][hn][io][ip][iq][ir][hq][kr]AB[fp][fo][go][ho][hp][gq][fq][hr][gs]C[（死活）白先。白棋应无条件吃住黑棋，如果打劫即是失败。]SZ[19](;W[es]C[图1 正解（10分）白棋飞是好棋]N[图1 正解（10分）];B[fs]C[黑棋顶];W[is]C[白棋立，冷静];B[er];W[ds]C[白棋吃住黑棋。])(;W[is]N[图2 失败（0分）]C[图2 失败（0分）白棋先立次序错误];B[er]C[黑棋做眼];W[es]C[白棋托试图破眼];B[ds];W[dr];B[fs]C[但进行至此，黑棋简单做活。])(;W[is]C[图3 失败（0分）]N[图3 失败（0分）];B[er];W[gr]C[白棋扑];B[fr];W[hs];B[dr]C[这里形成劫活，与图1 相比，差别很大。]))",

		//wqqlzwcs_15_10.sgf
		"(;AB[bq][br][bs][cq][dq][dp][co][cs][fp][gp][hp][ip][iq][jr][kq]AW[cr][dr][eq][fq][gq][hq][ir][is]C[（死活）白先。白棋应首先决定一下，是否要把所有白子都救活。](;W[gs]N[图1 正解（10分）]C[图1 正解（10分）白棋跳是做活的要点];B[er]C[黑棋打吃];W[fr]C[白棋反打，弃掉二子];B[ds];W[hr]C[至此白棋简单做活。])(;W[es]N[图2 失败（0分）]C[图2 失败（0分）白棋虎，企图全体做活，过于贪心了。];B[gs]C[黑棋点，急所一击，白死。];W[gr];B[hs];W[fs];B[er]C[白棋无法活。])(;W[er]C[图3 失败（0分）白棋单接失败];B[gr];W[gs];B[fs];W[hr]C[白棋只能劫活。]))",
	],

	[

		//wqqlzwcs_16_1.sgf
		"(;AW[dc][fd][jd][lc][di][cp][dn]AB[pd][nc][qk][pq][po][jp][fp]LB[qe:a][ok:b][fn:c][mp:d]C[（布局）黑先。当前黑棋有黑白双方必争的要点。黑棋如何才能掌握局势的主动？请在 a、b、c、d 中选择。]SZ[19](;B[qe]C[图1 方向错误（6分）黑棋尖脱离主战场，在目前情况下，扩张中腹势力最为重要]N[图1 方向错误（6分）];W[fn]C[白抢占要点之后，黑棋不好。])(;B[ok]C[图2  黑棋消极（6分）黑棋单跳扩张右边]N[图2  黑棋消极（6分）];W[fn];B[hp];W[im]CR[fn]C[但白跳、大飞之后，黑势不能和白势相比较。])(;B[fn]C[图3  正解（10分）黑棋跳是势力扩张的要点]N[图3  正解（10分）];W[dl]C[白棋补];B[gk]C[黑棋继续扩张，黑棋布局成功。])(;B[mp]C[图4 最差点（4分）黑棋守是缺乏气魄的棋]N[图4 最差点（4分）];W[fn];B[hp]CR[fn]C[白向中腹跳时，黑还得防守，黑棋下边有重复的感觉];W[im]C[进行至此，白棋势力很明显。]))",

		//wqqlzwcs_16_2.sgf
		"(;AW[dd][dp][fp][jp][nq][pc][qc][nc][mc]AB[cn][ck][pj][pq][qo][ld][md][oe][pd][qd]LB[oo:a][kc:b][ci:c][bp:d]C[（布局）白先。白棋如果过于偏重于局部，则很难发现正确答案，因此白棋应考虑全局的棋子布置。请在 a、b、c、d 中选择。]SZ[19](;W[oo]C[图1 正解（10分）白棋镇是不可放过的要点，兼有扩张黑侵消黑势的作用。]N[图1 正解（10分）])(;W[kc]C[图2 最差点（4分）白棋跳过于偏重于局部，是的恶手]N[图2 最差点（4分）];B[oo]C[黑棋跳];W[no];B[nn];W[mo];B[mn]CR[kc]C[进行至此，黑棋筑成右边的厚势。因此白棋在上边跳是价值最小的地方。])(;W[ci]N[图3  次选方法（8分）]C[图3  次选方法（8分）白棋拦是伺机攻击黑棋二子的积极下法];B[oo]C[但黑可以脱先占据右边大势要点];W[lp];B[ln]CR[lp]C[白棋补后，黑大飞扩张，黑棋阵形很理想。])(;W[bp]N[图4  时机不成熟（6分）]C[图4  时机不成熟（6分）白棋跳守角，并且伺机攻击左边黑棋两子];B[oo]CR[bp]C[但黑棋跳仍是绝好点，从而也说明了了白守角的时机不成熟];W[ci];B[mp]CR[ci]C[白棋在左边逼攻，黑棋则飞压，黑棋势力得意加固。]))",

		//wqqlzwcs_16_3.sgf
		"(;AB[cp][eq][gq][dd][ce][fd][jc][po][qp][ql][ck][mc]AW[cf][df][ci][iq][io][oq][qr][mp][qj][ph][pe][pc]LB[ol:a][go:b][bf:c][me:d]C[（中盘）黑先。对黑棋来说，哪一位置具有攻守兼备的作用？请在 a、b、c、d 中选择。]SZ[19](;B[ol]C[图1  时机不成熟（6分）黑棋跳，意在安定自身的同时牵制白棋的势力，但实际上时机不成熟]N[图1  时机不成熟（6分）];W[cc]C[白点三三之后，黑棋很可能实地不足。])(;B[go]C[图2  大同小异（6分）黑棋在下边跳的结果与图1 大同小异]N[图2  大同小异（6分）];W[cc]C[被白棋点入后，黑棋缺少手段];B[bf];W[ec];B[ed];W[fc];B[dc];W[db];B[cb];W[bb];B[gc];W[ca];B[gb]C[进行至此，白棋先手抢得实地];W[ei]C[然后白再跳，白棋心情不错。])(;B[bf]C[图3  正解（10分）]N[图3  正解（10分）];W[bg];B[be]C[黑棋扳粘是正确的选择，不仅可以确保角地，而且还可伺机攻击白棋二子];W[ei];B[ek]CR[ei]C[白棋跳，黑棋也跳，黑好。])(;B[me]N[图4  方向错误（6分）]C[图4  方向错误（6分）黑棋跳是方向错误];W[cc]C[白点三三是正确的选择];B[dc];W[be];B[cd];W[fi]C[白争得先手后，二间跳出，白棋易下。]))",

		//wqqlzwcs_16_4.sgf
		"(;AW[cd][dc][ed][gd][gc][ic][id][he][hf][je][jf][ig][ih][hh][cj][ck][di][bi][fi][ek][fk][fl][gl][dl][dm][em][en][eo][cn][bm][bn][bo][hm][ho][jo][kh][ki][pa][pb][qc][rc][rb][rf][qg][pf][of][og][mf][me][mh][nh][ni][nj][mk][ml][lm][km][ln][pl][ql][rl][qk][rj][sk][pq][qo][op][np][mq][lq]AB[be][ce][ch][cg][ee][fe][ge][fg][gg][hg][gh][gi][gj][gk][hi][hl][il][jj][lj][lk][jm][bk][bl][cl][cm][dk][dn][do][co][dp][ep][bp][ao][gp][go][gn][gm][hp][jq][kp][lp][mp][mn][no][hd][hc][jd][kc][ke][ld][lf][lg][nd][ob][oc][pc][pe][qe][qd][qf][rd][rg][pg][ph][oh][oi][ri][qj][pj][pk][ok]LB[jn:a][bd:b][jb:c][jr:d]C[（终盘）白先。目前全盘仍有几处大棋，白棋应如何决定先后次序？请在 a、b、c、d 中选择。]SZ[19](;W[jr]C[图1  正解（10分）]N[图1  正解（10分）];B[ir];W[kr]CR[jr]C[白棋在下边托、退是正确的收官次序];B[ip];W[bd]C[然后白再转左上角];B[jb];W[ib];B[ko];W[kq];B[jp];W[is];B[hs];W[js];B[hr];W[on]C[进行至此，是双方最佳进行。])(;W[bd]C[图2 次选方法（8分）白棋先挡次序错误]N[图2 次选方法（8分）];B[kr]C[黑棋尖价值很大];W[jn];B[jb];W[ib];B[lr];W[mr];B[pn]C[与图1 相比，白棋的差别很大。])(;W[jn]C[图3 次序错误（6分）白棋顶，过于看中中腹数子]N[图3 次序错误（6分）];B[kr]C[被黑棋抢收下边官子之后，白棋不满];W[lr];B[kq];W[bd];B[ls];W[nr];B[ns];W[os];B[ms];W[or];B[jb]C[进行至此，黑棋舒服。])(;W[jb]C[图4  最差点（4分）白棋尖是价值最小的官子]N[图4  最差点（4分）];B[kr]C[黑棋抢收下边官子之后，白棋当然不满];W[jn];B[bc]CR[jn]C[白棋顶和黑棋跳是同样价值的对应官子。大小差不多。]))",

		//wqqlzwcs_16_5.sgf
		"(;AW[br][cq][dq][eq][fq][er][gr][gs]AB[bq][bp][cp][dp][ep][fp][gq][hq][hr][es]C[（官子）黑先。黑棋如何攻击白棋的弱点以取得利益？]SZ[19](;B[cs]C[图1 正解（10分）]N[图1 正解（10分）];W[cr]TR[cs]C[黑棋先跳，与白棋接交换一手];B[hs]C[然后黑从外侧挡是好次序];W[ds]C[白棋必扑];B[dr];W[bs];B[fr]C[这样黑棋可以吃住白棋二子。])(;B[cs]C[图2 变化图]N[图2 变化图];W[dr]TR[cs]C[黑棋跳时，白棋寻求变化];B[bs];W[ar];B[cr];W[fs];B[aq]C[黑棋吃住白角上二子。])(;B[ds]N[图3 失败（0分）]C[图3 失败（0分）黑棋单长失败];W[cs];B[ar];W[bs]C[黑棋一无所获。]))",

		//wqqlzwcs_16_6.sgf
		"(;AB[br][cq][ap][bp][dr][ds][eq][fq][gq][gr][fs]AW[ao][bo][cn][cp][dp][dq][ep][fp][gp][hp][hq][hr][er][es]C[（手筋）白先。黑棋目前棋形仍不完整，白棋如何利用他的缺陷？]SZ[19](;W[bq]N[图1 正解（10分）]C[图1 正解（10分）白棋先扑];B[aq];W[bs]C[然后白棋再托是手筋];B[cr]C[黑棋接不得已];W[ar]C[白棋再扑，形成劫杀。])(;W[bs]N[图2 失败（0分）]C[图2 失败（0分）白棋先托是次序错误];B[bq]C[黑棋接];W[cr];B[fr]CR[cr]C[白棋再扑时，黑提子即可。])(;W[ar]N[图3 失败（0分）]C[图3 失败（0分）白棋托这里是失误];B[bq]C[黑棋接上即可，白棋没有收获。];W[cr];B[fr]))",

		//wqqlzwcs_16_7.sgf
		"(;AB[br][bq][cp][co][bn][cs][dq][eq][ep][fp][gp][hq]AW[cq][cr][dr][er][fq][gq][hr][dp][do][dn][dl][fo]C[（手筋）黑先。黑棋如何迅速处理中腹的浮棋？应该尽量利用白棋气紧的缺陷。]SZ[19](;B[fr]N[图1  正解（10分）]C[图1  正解（10分）黑棋断打是手筋];W[gr];B[fs]C[黑棋立下是连贯的着法，黑棋巧妙地利用了白不入气的弱点];W[gs]C[白棋打吃过于贪心];B[ir];W[es];B[ip]C[进行至此，白棋损失巨大。])(;B[ir]N[图2  失败（0分）]C[图2  失败（0分）黑棋连扳无谋];W[hp]C[白棋打，当然];B[gr];W[fr]TR[gr]C[黑棋打时，白棋反打，沉着，黑棋不行。])(;B[iq]N[图3  黑棋失败（0分）]C[图3  黑棋失败（0分）黑棋长];W[ir]C[被白棋爬后，黑棋不行。]))",

		//wqqlzwcs_16_8.sgf
		"(;AB[br][bq][cq][co][do][eo][eq][fq][gn][ho][hp][hq][ir][jq][hs]AW[cs][cr][dq][dp][ep][fp][gq][gr][hr]C[（死活）黑先。如果黑棋草率决断，则会招致失败。只有冷静计算，才能解决问题。]SZ[19](;B[es]N[图1 正解（10分）]C[图1 正解（10分）黑棋跳是急所];W[fs]C[白棋尖顶];B[er]C[黑棋可接];W[dr];B[fr]C[白棋被杀。])(;B[es]N[图2  变化图]C[图2  变化图黑棋跳是急所];W[fr]C[白直接打吃];B[dr]C[黑棋断是好棋];W[er];B[bs]C[白棋全体没有两只眼。])(;B[er]N[图3 失败（0分）]C[图3 失败（0分）黑棋立看似急所];W[es]C[白棋可在底线托];B[fs];W[dr];B[ds];W[fr]C[白棋轻易做活。])(;B[fs]C[附图 黑失败黑棋点这里要失败]N[附图 黑失败];W[fr]C[白棋简单冲吃即可。]))",

		//wqqlzwcs_16_9.sgf
		"(;AW[bs][bq][cq][dq][er][fs]AB[ap][bp][cp][dp][eq][fq][fr][hr]C[（死活）黑先。黑棋应利用白棋气紧的缺陷来吃住白棋，同时还应正确地利用一线上的黑子。]SZ[19](;B[ar]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是急所];W[aq]C[白棋必挡];B[br];W[cr];B[ds]TR[br]C[黑棋冲、点是正确的次序，白棋已被杀。];W[es];B[gs]C[黑棋打吃后，白接不归。])(;B[dr]N[图2  黑棋失败（0分）]C[图2  黑棋失败（0分）黑棋直接断打];W[ds]C[白可以顽强做劫，黑棋失败。])(;B[ar]C[图3 失败（0分）]N[图3 失败（0分）];W[aq];B[ds]C[黑棋不冲而先点是次序错误];W[dr];B[br];W[cs]C[进行至此，白棋做活。]))",

		//wqqlzwcs_16_10.sgf
		"(;AB[bs][br][bq][bp][co][cn][dn][en][fo][fp][gq][hp][hr][ir][gs][er]AW[cs][cr][cq][cp][do][ep][eq][eo][fq][fr][gr]C[（死活）黑先。如果黑棋缺乏奇想，则很难发现正确的答案。第一手棋很重要。]SZ[19](;B[dq]N[图1 正解（10分）]C[图1 正解（10分）黑棋挖是急所];W[dr];B[es]C[黑棋立是连贯的好手。由于两侧都不入气，白棋被杀。])(;B[fs]N[图2 失败（0分）]C[图2 失败（0分）黑棋渡过];W[es];B[ds];W[dr]C[白棋利用黑的接不归成功做活。])(;B[es]N[图3 失败（0分）]C[图3 失败（0分）黑棋单立];W[fs];B[dq];W[hs];B[dr];W[dp]C[进行至此，白棋活了。]))",
	],

	[

		//wqqlzwcs_17_1.sgf
		"(;AB[qd][pf][qk][pl][pn][po][nq][oq][pq][op][lq][co][dk]AW[dd][dq][gq][np][oo][no][lo][pp][qp][qq][qo][rm][oc]LB[jq:a][ml:b][pc:c][jc:d]C[（布局）黑先。行棋的方向非常重要，本图黑棋能够控制局势的位置是什么？请在 a、b、c、d 中选择。]SZ[19](;B[jq]C[图1 方向错误（6分）黑在下边拆一，在捞取实地的同时，还伺机攻击白棋四子]N[图1 方向错误（6分）];W[ml]TR[jq]C[但白大飞整形，白棋不再受攻，由此证明黑行棋的方向错误。白基本安定，黑没有明显的后续后段。])(;B[ml]C[图2 正解（10分）黑棋大跳，攻击白棋大龙，才是正确的方向]N[图2 正解（10分）];W[kq]C[白棋靠整形];B[kr];W[lp];B[mr];W[jq];B[jr];W[iq];B[pc]C[黑棋争得先手后，于右上角攻击，黑棋有利。])(;B[pc]C[图3 时机不成熟（6分）黑棋直接在右上角动手，时机不成熟]N[图3 时机不成熟（6分）];W[jq]C[白棋逼];B[kp];W[ml]CR[jq]C[然后白再大飞，是白棋的绝好次序。])(;B[jc]C[图4  大同小异（6分）黑棋在上边分投，结果与图3 大同小异]N[图4  大同小异（6分）];W[jq]C[白棋逼攻];B[kp];W[ml];B[jp];W[iq];B[jn];W[mj]C[进行至此，白棋左下和右下两块棋全部得以处理，白棋满足。]))",

		//wqqlzwcs_17_2.sgf
		"(;AB[pc][jd][gd][po][qn][pm][qh][dp][do][dq][eq][er][hq]AW[dc][de][di][cn][cp][cq][cr][dr][fq][nq][pq][qp][qo]LB[oh:a][kq:b][em:c][pe:d]C[（布局）黑先。扩张自己的势力是黑棋的当务之急。黑棋能主动控制局势的最佳在哪里？请在 a、b、c、d 中选择。]SZ[19](;B[oh]C[图1  正解（10分）黑棋跳，是考虑到周边棋子布置的正确下法，这样从上边到右边，黑棋所筑成的势力很明显。]N[图1  正解（10分）])(;B[kq]N[图2  方向错误（6分）]C[图2  方向错误（6分）黑在下边拆二，虽实地上不小，但实际上是方向错误];W[oh]C[之后，白棋镇是侵消黑棋势力的绝好点，黑势被大幅压缩。])(;B[em]N[图3  方向错误（6分）]C[图3  方向错误（6分）黑棋飞的意图是扩张下边和牵制左边白势，但方向错误。];W[oh]C[其后白棋镇绝好];B[qf];W[oj]TR[qf]C[黑棋守时，白跳，白好。])(;B[pe]N[图4  次选方法（8分）]C[图4  次选方法（8分）黑棋缔角是第一感，但与图1 相比，显得消极。];W[pi]C[之后，白棋肩冲是好棋];B[qi];W[pk]C[进行至此，白棋心情不错。]))",

		//wqqlzwcs_17_3.sgf
		"(;AB[bb][cb][cc][dc][bd][be][ce][cf][ld][qd][pe][oe][nf][ng][og][pj][qn][on][dp][dn][eq][cq][cr]AW[bc][db][ec][fc][cd][dd][de][fe][cm][cp][co][cn][bq][pq][qp][mq][kb][mc][me][ne][oc][of][mf]LB[iq:a][lg:b][ci:c][pb:d]C[（中盘）黑先。黑白双方存在共同的势力要点，如果不能考虑到这一位置，则很难下好围棋。请在 a、b、c、d 中选择。]SZ[19](;B[iq]C[图1  次选方法（8分）黑棋在下边拆，虽实利上很大，却脱离了主战场]N[图1  次选方法（8分）];W[lh]C[白棋飞占据大势要点之后，白势得以大幅扩张。])(;B[lh]N[图2  正解（10分）]C[图2  正解（10分）黑棋飞是不可放过的形势要点];W[kg]C[其后白棋补];B[kh];W[jg];B[ii]TR[kh]C[黑棋压后再飞，黑棋流畅。])(;B[ci]N[图3  最差点（4分）]C[图3  最差点（4分）黑在左边拆二是价值最小的位置];W[lh]C[白棋飞是急所];B[jq]C[其后黑棋抢占下边大场];W[dh];B[ch];W[ej]CR[dh]C[但白棋点、飞之后，白势得以大幅扩张，黑棋落后。])(;B[pb]N[图4  时机不成熟（6分）]C[图4  时机不成熟（6分）黑棋飞虽实地上很大，但在目前情况下仅是官子行为];W[lh]C[白棋飞占据要点];B[eg];W[gg]TR[eg]C[其后黑棋飞、白棋镇是预想的进行，白棋领先。]))",

		//wqqlzwcs_17_4.sgf
		"(;AW[cd][dc][ed][gd][gc][ic][id][he][hf][je][jf][ig][ih][hh][cj][ck][di][bi][fi][ek][fk][fl][gl][dl][dm][em][en][eo][cn][bm][bn][bo][hm][ho][jo][kh][ki][pa][pb][qc][rc][rb][rf][qg][pf][of][og][mf][me][nh][ni][nj][mk][ml][lm][km][ln][pl][ql][rl][qk][rj][sk][pq][qo][op][np][mq][lq][cb][qa][kr][lr][qn][on][jn][ib][ch][ei]AB[be][ce][cg][ee][fe][ge][fg][gg][hg][gh][gi][gj][gk][hi][hl][il][jj][lj][lk][jm][bk][bl][cl][cm][dk][dn][do][co][dp][ep][bp][ao][gp][go][gn][gm][hp][jq][kp][lp][mp][mn][no][hd][hc][jd][kc][ke][ld][lf][lg][nd][ob][oc][pc][pe][qe][qd][qf][rd][rg][pg][ph][oh][oi][ri][qj][pj][pk][ok][oa][jr][kq][bc][pn][jb][kd][dg][eh][jk]SZ[19]C[（终盘）黑先。在目前状况下，黑棋应很容易发现正确答案。a、b、c、d 中哪一位置价值最大？]LB[js:a][bb:b][bg:c][hn:d](;B[js]C[图1  正解（10分）黑棋下立逆收官子，是价值最大的地方]N[图1  正解（10分）];W[bg]C[白棋扳];B[ls]C[黑棋底线跳入是后续手段];W[ms];B[ks];W[nr];B[bb]C[黑棋争得先手后，再在角上长入。])(;B[bb]C[图2  操之过急（8分）黑棋长操之过急]N[图2  操之过急（8分）];W[js];B[is];W[ks]C[白棋立即先手扳粘];B[iq];W[bg]C[然后白再回到左上。与图1 相比，黑差了一手棋。])(;B[bg]N[图3  次序错误（6分）]C[图3  次序错误（6分）黑棋立下是次序错误];W[js];B[is];W[ks]C[白先手扳粘];B[ir];W[bd];B[ad];W[bb]C[进行至此，白比图2 更有利。])(;B[hn]C[图4  最差点（4分）黑棋打吃是价值最小的地方]N[图4  最差点（4分）];W[js];B[is];W[ks];B[iq];W[bd];B[ad];W[bb];B[bg];W[ab]C[这是黑棋最坏的结果。]))",

		//wqqlzwcs_17_5.sgf
		"(;AW[br][bq][cp][dp][ep][fp][gp][hp][iq][jq][jr][js][dq]AB[cq][cr][dr][eq][fq][gq][hq][ir][is][gr]SZ[19]C[（官子）白先。白棋应该利用黑棋形上的弱点获取利益。](;W[es]C[图1 正解（10分）白棋点是官子手筋]N[图1 正解（10分）];B[er]C[黑棋粘最善];W[gs]C[白棋托是连贯的好手];B[fs];W[fr];B[ds];W[hr]C[进行至此，白棋可吃住黑棋两子。白后手，黑地 4 目。])(;W[es]C[图2 变化图]N[图2 变化图];B[fs]C[黑棋尖顶，求变];W[er]C[白棋断];B[fr];W[hs]C[白棋打吃，黑棋全部被吃。])(;W[fs]C[图3 失败（0分）白棋点这里是过于受棋形束缚的棋]N[图3 失败（0分）];B[es]C[黑棋补后，白棋失败。]))",

		//wqqlzwcs_17_6.sgf
		"(;AW[dq][dp][do][dn][co][bp]AB[cq][bo][cn][cm][bm][an][dm][en][fn][eq][fq][gp]SZ[19]C[（手筋）白先。角上白棋已经很危险，但只要能发现手筋，即能解决所有的问题。](;W[br]N[图1 正解（10分）]C[图1 正解（10分）白棋跳是形的急所];B[bq];W[ap]TR[bq]C[黑棋冲时，白棋可以立下。])(;W[bq]N[图2 失败（0分）]C[图2 失败（0分）白棋挡是恶手];B[dr];W[cr];B[br];W[cp];B[cs]C[黑棋可以做劫];W[er]C[进行至此，白棋只能劫活。])(;W[cr]N[图3 失败（0分）]C[图3 失败（0分）白棋扳同样是恶手];B[bq]C[黑棋长];W[ap];B[br]CR[ap]C[白立下时，黑棋曲，白棋不活。]))",

		//wqqlzwcs_17_7.sgf
		"(;AW[br][bp][cq][dq][cn][co][ep][fp][fo][go][gq][hq][hr][iq]AB[dp][do][en][eq][fq][dr][gr][gp][hp][ho][hn]C[（手筋）白先。中腹白棋只剩下三口气了，但只要白棋正确掌握行棋次序，即可在对杀中取胜。]SZ[19](;W[er]N[图1 正解（10分）]C[图1 正解（10分）白棋从这里打吃];B[fr];W[gs]C[白棋再打];B[es];W[hs]C[然后白棋粘是对杀中的手筋];B[fs];W[cs]C[进行至此，白棋快一气。])(;W[ds]N[图2 失败（0分）]C[图2 失败（0分）白棋夹看似手筋];B[gn]C[但黑棋可以直接紧气];W[er];B[fr];W[fs]C[进行至此，不可避免地形成打劫。])(;W[fr]N[图3 失败（0分）]C[图3 失败（0分）白棋从这里打吃是大恶手];B[er];W[gs];B[gn]C[白棋无条件被杀。]))",

		//wqqlzwcs_17_8.sgf
		"(;AB[br][bq][bp][co][dp][fp][fo][gn][io][ip][gq][gr][jq][ir]AW[cr][cq][eq][fq][gp][hp][hq][hr]SZ[19]C[（死活）白先。目前白棋求活好象不容易，但只要能发现第一手棋，即能轻易解决问题。](;W[fs]N[图1  正解（10分）]C[图1  正解（10分）白棋跳是做活的唯一手段];B[hs]C[黑欲渡];W[fr]C[白打吃，黑接不归，白轻易做活。])(;W[gs]N[图2  白棋失败（0分）]C[图2  白棋失败（0分）白棋从底线打吃];B[cs]C[黑棋扳];W[dr];B[ds];W[es];B[fr]C[进行至此，白棋被杀。])(;W[hs]N[图3  失败（0分）]C[图3  失败（0分）白棋立下];B[dr]C[黑棋夹是杀棋的手筋];W[dq];B[cs]C[白不活。]))",

		//wqqlzwcs_17_9.sgf
		"(;AB[br][bq][bp][co][dp][fp][fo][gn][io][ip][gr][jq][ir]AW[cr][cq][eq][fq][gp][hp][hq][hr][fs]C[（死活）黑先。行棋的次序非常重要，应利用白棋的不入气而吃住白棋。]SZ[19](;B[es]C[图1  正解（10分）黑棋靠是手筋]N[图1  正解（10分）];W[er]C[之后白棋试图抵抗];B[dq];W[dr];B[hs]TR[dq]CR[dr]C[黑棋冲与白棋挡交换一手后，黑棋渡过，黑棋可以吃住白棋。])(;B[hs]N[图2  失败（0分）]C[图2  失败（0分）黑棋直接渡];W[gs]C[白棋打吃];B[es];W[is];B[cs]C[黑棋继续破眼];W[jr]C[但白棋打吃，白可从边上逸出。])(;B[cs]N[图3  失败（0分）]C[图3  失败（0分）黑棋扳，无谋];W[ds]C[白棋挡是好棋];B[dr];W[dq];B[es];W[er];B[hs];W[ds];B[gs];W[fr]C[进行至此，白棋做活。])(;B[es]N[附图]C[附图];W[ds]C[白棋从这里打如何？];B[hs]C[黑棋直接渡即可，白棋无法做活。]))",

		//wqqlzwcs_17_10.sgf
		"(;AW[br][cq][dq][fq]AB[fr][gr][bp][cp][dp][fo][ho][hp]C[（死活）白先。目前白棋做活似不太可能，但如能利用黑棋包围网的薄弱环节，即可摆脱危机。]SZ[19](;W[cs]N[图1 正解（10分）]C[图1 正解（10分）白棋倒虎是唯一的做活要点];B[dr]C[黑棋跳入破眼];W[er];B[es];W[eq];B[ds];W[gq];B[hq];W[cr]C[进行至此，白棋成功做活。])(;W[cs]C[图2 变化图]N[图2 变化图];B[es]C[黑棋尖破眼];W[er];B[bq];W[ar]CR[er]TR[bq]C[白与黑交换一手后，冷静地立下];B[ds]C[黑棋用强];W[gq];B[hr];W[fs];B[gs];W[dr]C[进行至此，黑已无法吃住白棋。])(;W[er]N[图3 白棋失败（0分）]C[图3 白棋失败（0分）白棋挡要失败];B[ar];W[aq];B[bq];W[as];B[cs]C[黑棋托、点是死活常识，白棋被杀。]))",
	],

	[

		//wqqlzwcs_18_1.sgf
		"(;AB[cd][dc][oc][qd][ck][cn]AW[dp][fp][pq][qo][qj][ic][fc]C[（布局）黑先。目前全盘还有好多大场，但正确答案只有一个。如果能站在对方的立场上考虑问题，则可轻易发现答案。请在 a、b、c、d 中选择。]SZ[19]LB[kc:a][kq:b][hq:c][dg:d](;B[kc]N[图1 次选方法（8分）]C[图1 次选方法（8分）黑棋在上边拆逼是仅次于正确答案的大场，而且还有以后攻击白棋二子的手段];W[jp]C[但被白占据要点之后，黑棋略有不满。白占下边大场后，形成了以右下角为基础的两翼张开。])(;B[kq]N[图2 正解（10分）]C[图2 正解（10分）黑棋在下边分投是价值最大的地方];W[iq];B[nq]C[黑棋拆二后，阻止了白棋在下边布成理想的阵容。])(;B[hq]N[图3 贪心（6分）]C[图3 贪心（6分）黑棋走在这里，虽是针对角上白棋弱点的手段，但却是黑棋的贪心];W[kq]C[白拆兼夹是好点];B[ho];W[fn]TR[ho]C[黑棋跳、白棋也跳，白棋主动。白棋角上的单关是有弹性的棋形，不能说是弱棋。])(;B[dg]N[图4 最差点（4分）]C[图4 最差点（4分）黑棋守左边是最差的一手棋];W[jp]C[白占据要点之后，黑在大势上落后];B[kc]C[黑棋拆逼虽具气势……];W[ie];B[ke];W[oo]CR[ie]C[但白棋在上边跳补争得先手后，白在右下跳补，白棋有利。]))",

		//wqqlzwcs_18_2.sgf
		"(;AB[qc][qb][pd][pf][pj][pp][np][jp][fp][jj]AW[dd][fd][dj][dp][dn][jd][pc][oc][nd][nf]LB[fn:a][mj:b][qo:c][ph:d]C[（布局）黑先。黑棋有轻易控制局势的要点，应该考虑到周边棋子的布置。请在 a、b、c、d 中选择。]SZ[19](;B[fn]N[图1  次选方法（8分）]C[图1  次选方法（8分）黑棋跳，虽是明显的要点，];W[mj]C[但被白削黑势后，黑棋乏味。由于黑已在右下单关守角，所以白棋侵消的方向正确。])(;B[mj]N[图2  正解（10分）]C[图2  正解（10分）黑棋防守是掌握局面的要领。以右下角为根基，黑棋势力被很理想地加固。])(;B[qo]C[图3   黑棋消极（6分）黑棋尖是时机不成熟的消极防守]N[图3   黑棋消极（6分）];W[mj];B[fn];W[gj]CR[mj]C[被白棋侵消后，黑棋的布置未能充分发挥威力。])(;B[ph]N[图4 最差点（4分）]C[图4 最差点（4分）黑棋守是价值最小的地方，是未能把握大势的缓棋];W[gn];B[hp];W[jm]CR[gn]C[白棋大跳、大飞之后，黑势萎缩，而白势则充满活力。]))",

		//wqqlzwcs_18_3.sgf
		"(;AW[dc][ec][cd][df][dh][dp][co][fq][qb][qc][qd][rf][qf]AB[fc][fd][ed][jd][pc][pd][pe][pf][oh][qh][jp][pp][pn][fg]LB[fi:a][dk:b][qq:c][hq:d]C[（中盘）白先。目前黑白双方均有不可放过的绝好点，应该根据自己的感觉来解答。请在 a、b、c、d 中选择。]SZ[19](;W[fi]N[图1  正解（10分）]C[图1  正解（10分）白棋飞，是彼此势力消长的形势要点。这种位置，白棋应凭感觉就能发现。])(;W[dk]N[图2   次选方法（8分）]C[图2   次选方法（8分）白棋拆边虽是围左边的好点，……];B[gj]C[但黑棋大飞绝好，白棋在大势上落后。])(;W[qq]N[图3  最差点（4分）]C[图3  最差点（4分）白棋点三三，时机并不成熟];B[pq];W[rp];B[rn];W[pr];B[or];W[rr];B[ps];W[qr]C[白棋虽在角上做活，但落了后手];B[fi]C[黑棋占据势力扩张的要点之后，黑棋领先。])(;W[hq]N[图4  缓棋（6分）]C[图4  缓棋（6分）白在下边拆一，虽在实地上不小，但却是缓着];B[fi];W[dj];B[fk]TR[fi]C[黑棋两跳之后，黑在中腹的势力极大，白棋的实地很难和黑势相抗衡。]))",

		//wqqlzwcs_18_4.sgf
		"(;AW[cd][be][ce][dc][ec][fc][gc][hb][hd][jd][id][je][ke][le][kf][md][jg][ii][jb][kb][lb][qb][rb][rc][sd][re][sf][qf][qg][rg][rh][rk][dh][di][dj][dk][ej][ck][bl][al][bm][an][ao][fl][fm][en][fo][do][gp][gq][hr][ip][il][kj][km][kn][ko][lp][nq][op][po][qp][pq][qq][rq][qr][ro][sp][rn][qk][ql][qm][pk][ok][nk][nl][ml][nj][mj][oj][oi][pi][nh][mh]AB[ib][kc][lc][mc][nc][mb][pb][qc][pd][qd][rd][qe][oe][pf][lf][mf][kg][lh][oh][ph][qh][qi][qj][pj][rm][rl][sn][li][ki][mi][ni][lj][lk][ll][lm][ln][ol][nm][pm][pn][on][qn][qo][oq][kl][jl][jk][jm][hj][jf][if][ie][he][ge][gd][ed][de][cf][bg][ch][dg][eg][ei][fi][cj][bj][cm][dm][em][bn][bo][co][ap][dp][dq][er][fq][gr][fs]LB[im:a][hs:b][nd:c][rj:d]SZ[19]C[（终盘）白先。白棋应通过正确的计算来寻找价值对大的官子。 a、b、c、d 中最重要的位置是什么？](;W[hs]N[图1  正解（10分）]C[图1  正解（10分）白棋立下逆收官子，似乎价值最大的地方];B[im]C[黑棋曲];W[pa];B[oa];W[qa];B[oc]CR[pa][qa]C[白棋在上边先手扳粘];W[rj]C[然后白转向右边。])(;W[im]N[图2  次选方法（8分）]C[图2  次选方法（8分）白棋贴是仅次于正确答案的大官子];B[hs]C[但被黑以下先手利用，白棋痛苦];W[ir];B[jn];W[in];B[jo];W[jp];B[lo];W[kp];B[is];W[js];B[gs];W[jr];B[jc];W[ic];B[pa]C[进行至此，黑棋满足。])(;W[rj]N[图3  缓着（6分）]C[图3  缓着（6分）白走这里只不过是单纯渡过的小官子];B[hs];W[ir];B[is];W[js];B[gs];W[jr];B[im];W[hn];B[pa]C[而后黑棋占据了多处好点，白棋太缓。])(;W[nd]N[图4  最差点（4分）]C[图4  最差点（4分）白棋长是价值最小的位置];B[hs];W[ir];B[is];W[js];B[gs];W[jq];B[im]C[而后黑占据多处要点，白棋则一个好点也没占到。]))",

		//wqqlzwcs_18_5.sgf
		"(;AB[bs][br][cq][dq][eq][fq][gr][hr][ir][is]AW[cr][bp][bq][cp][dp][ep][fp][gq][hq][iq][jq][js][jr]C[（官子）白先。白棋有利用黑棋形上的弱点获取利用的手段。]SZ[19](;W[fr]N[图1  正解（10分）]C[图1  正解（10分）白棋断是绝妙的手筋];B[er]C[黑棋打吃当然];W[cs]C[白棋贴];B[fs]C[黑棋提子，绝对，否则白立下就形成“金鸡独立”];W[ar]C[白棋可以吃住黑二子。])(;W[fr]C[图2  白损（4分）]N[图2  白损（4分）];B[er];W[fs]C[白棋立下稍损];B[es];W[cs];B[gs];W[ar]C[与图1 相比，白棋损 1 目。实际上不到一目，但稍损。])(;W[ar]N[图3  失败（0分）]C[图3  失败（0分）白棋单扳缺少计算];B[dr]C[黑棋打吃后，白棋一无所获];W[fr];B[fs]CR[fr]C[白棋再断，黑棋打吃即可。]))",

		//wqqlzwcs_18_6.sgf
		"(;AB[aq][bp][br][cr][cq][dq][co][do][eo][fo][gp][hp][iq][jq][jp][jr]AW[bo][bn][dn][cn][fn][gn][hn][io][ip][hq][gq][cp][dp][ep][eq][dr][ir]C[（手筋）黑先。黑棋中腹六子已经很危险，但只要黑棋正确发现手筋，情况就会逆转。]SZ[19](;B[fq]C[图1  正解（10分）黑棋挖是手筋]N[图1  正解（10分）];W[fr]C[白打吃];B[er]C[黑棋扑，重要];W[es];B[fp];W[er];B[gr];W[hr];B[gs]C[进行至此，白棋两侧都不入气。])(;B[fq]C[图2  失败（0分）]N[图2  失败（0分）];W[fr];B[fp]C[黑棋粘是不负责任的下法];W[er];B[is];W[gr]C[进行至此，黑棋数子已无法生还。])(;B[fr]N[图3  黑棋失败（0分）]C[图3  黑棋失败（0分）黑棋点不过是官子行为];W[fq];B[er];W[go]C[中腹黑棋被吃。]))",

		//wqqlzwcs_18_7.sgf
		"(;AW[br][cq][cp][cm][cn][dn][em][fm][go][gp][gq]AB[cr][dr][dq][dp][en][eo][fp][dm][dl][cl][cj]C[（手筋）黑先。黑棋看似已被吃住，但只要能正确使用手筋，就有紧白棋气的绝妙方法。]SZ[19](;B[co]N[图1  正解（10分）]C[图1  正解（10分）黑棋挖显而易见];W[bo];B[bn]C[黑棋断是手筋];W[bm];B[bp];W[do];B[bq]C[进行至此，白棋全部被吃住。])(;B[co]C[图2  变化图]N[图2  变化图];W[bo];B[bn];W[do]C[白棋如果提子……];B[bm]C[则黑打吃];W[co];B[bs];W[bq];B[ap]C[进行至此，对杀黑胜。])(;B[co]C[图3  失败（0分）]N[图3  失败（0分）];W[bo];B[bp]C[黑棋断打方向错误];W[bq];B[bn];W[do];B[bm];W[co];B[bs];W[ap];B[ar];W[ep];B[eq];W[fr]C[进行至此，由于角的特殊性，对杀白胜。]))",

		//wqqlzwcs_18_8.sgf
		"(;AB[br][bq][bp][cs][ds][co][cn][en][fn][fo][fp][hp][ip][iq][ir][js][kr]AW[cq][cr][cp][do][eo][ep][er][fq][hq][hr][hs][is]C[（死活）黑先。黑棋的行棋次序特别重要，发现第一手棋虽很容易，但其后就不那么简单。]SZ[19](;B[fs]N[图1  正解图（10分）]C[图1  正解图（10分）黑棋点是急所];W[es]C[白棋挡];B[fr]C[黑棋挤是好棋];W[eq];B[gq]C[进行至此，黑棋利用白棋的不入气，吃住白棋。])(;B[fs]C[图2  变化图]N[图2  变化图];W[fr]TR[fs]C[黑棋点时，白棋团求变];B[dq]C[黑棋点是先手];W[dr];B[gq]C[然后黑棋挖，是正确的次序];W[es];B[gr]C[白棋被杀。])(;B[fs]C[图3  失败（0分）]N[图3  失败（0分）];W[fr];B[gq]C[黑棋先挖次序错误];W[dq]C[白棋做眼是求活的要点];B[dr];W[es]C[进行至此，白棋轻易做活。]))",

		//wqqlzwcs_18_9.sgf
		"(;AB[br][bq][co][cn][cl][dm][em][gl][hm][ho][ip][iq][jr][hr][gs][gq][fq][eq]AW[cr][dq][er][do][dn][en][fn][ep][fp][gp][hp][hq]C[（死活）白先。白棋如用普通的方法很难将棋做活，但如果能正确利用弃子，就可以做出两眼。]SZ[19](;W[fr]C[图1  正解（10分）]N[图1  正解（10分）];B[gr];W[fs]CR[fr]C[白棋打吃之后立下扩大眼位是唯一的求生手段];B[ds];W[cs];B[dr];W[es];B[dr];W[cq]TR[dr]C[黑棋扑时，白棋粘是冷静的好手];B[ds];W[er]C[进行至此，白棋通过“倒脱靴”成功净活。])(;W[fr]C[图2  失败（0分）]N[图2  失败（0分）];B[gr];W[fs];B[ds];W[cs];B[dr];W[es];B[dr];W[ds]C[黑棋扑时，白棋提子是恶手];B[cq]C[白被净杀。])(;W[fs]C[附图1 白棋劫活]N[附图1 白棋劫活];B[gr];W[ds]LB[cq:a][fr:b]C[白棋直接做眼，以下黑 a 则白 b，白棋净活];B[fr];W[cq];B[cp];W[dp];B[bs];W[cs];B[es]C[打劫。])(;W[fs]C[附图2 白棋被杀]N[附图2 白棋被杀];B[gr];W[cq]C[白棋走这里不行，连打劫都没有了];B[ds];W[cs];B[fr]))",

		//wqqlzwcs_18_10.sgf
		"(;AB[br][cs][dr][dq][dp][ep][fp][fq][fn][gm][hp][in][jn][jo][jp][kq][kr][jr]AW[ds][er][eq][fr][gq][gp][ho][io][ip][iq][ir][jq]C[（死活）黑先。本题黑棋也要弃子。]SZ[19](;B[gs]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是急所];W[hs]C[白棋尖顶是最强抵抗];B[hr];W[is];B[gr];W[hq];B[fs];W[es];B[gr]C[进行至此，白不能活。])(;B[es]N[图2 失败（0分）]C[图2 失败（0分）黑棋提子不行];W[gs]LB[ds:a][is:b]C[白棋倒虎做眼即可。以下黑 a 则白 b，白是活棋];B[is];W[hr]TR[is]C[黑棋扳，白简单补活。])(;B[hr]N[图3 失败（0分）]C[图3 失败（0分）黑棋夹也要失败];W[gr];B[is];W[hq];B[hs];W[gs];B[js];W[es]C[进行至此，白棋的两个眼看得很清楚。]))",
	],

	[

		//wqqlzwcs_19_1.sgf
		"(;AB[pp][oc][qd][cc][eb][ec][dd][de][df][ce][fd]AW[cb][db][dc][cd][bd][be][dh][qi][dp][ed]C[（布局）白先。白棋有非常重要的位置要占，特别应考虑行棋的方向。请在 a、b、c、d 中选择。]SZ[19]LB[cg:a][jq:b][ql:c][qf:d](;W[cg]N[图1 最差点（4分）]C[图1 最差点（4分）白棋尖是过于顾虑自身安危的消极手法];B[qg];W[ql];B[jd]TR[qg]C[黑先在右边拦，然后在上边展开，这样黑棋在上边筑成理想的阵形。])(;W[jq]N[图2 方向错误（6分）]C[图2 方向错误（6分）白棋拆是重视下边的下法，但是方向错误];B[qg]C[黑拆逼是绝好点];W[pm];B[nq];W[oi]CR[pm]C[白棋二间高挂、而后跳起是一种趣向];B[jd]C[但黑占据要点之后，白棋布局落后。])(;W[ql]N[图3 次选方法（8分）]C[图3 次选方法（8分）白棋重点安定右边一子是正确的，但开拆的方向错误];B[qg]C[被黑棋拦后，白要想再打入上边非常困难，因此白棋多少有些不满。])(;W[qf]N[图4 正解（10分）]C[图4 正解（10分）白棋拆二是目前情况下正确的方向，目前的焦点是白棋如何牵制黑棋上边的势力];B[jd]CR[qf]C[白棋拆二后，黑在上边展开];W[oe]C[白棋可以飞镇，白棋很充分。]))",

		//wqqlzwcs_19_2.sgf
		"(;AB[oc][qd][ce][bc][df][qp][qo][pq][nq]AW[po][pn][qn][qj][jc][dc][fd][dp][dh]LB[qh:a][dk:b][lc:c][iq:d]C[（布局）黑先。黑棋有比大场更重要的好点。请在 a、b、c、d 中选择。]SZ[19](;B[qh]C[图1 正解（10分）黑棋拆逼是全盘最大的地方]N[图1 正解（10分）];W[oj]C[白棋跳补];B[lc]C[黑在上边展开是要点，从全局来看，黑棋不错。])(;B[dk]C[图2 方向错误（6分）黑棋在左边夹攻是方向错误]N[图2 方向错误（6分）];W[qg]C[白在右边拆是绝好点，白棋在右边得到理想的扩张，黑棋不满。])(;B[lc]C[图3 方向错误（6分）黑棋在上边拆，试图打入白阵，但方向错误]N[图3 方向错误（6分）];W[qe]C[其后白棋靠……];B[pe];W[qf];B[rd];W[pf];B[oe]C[进行至此，是白棋的好手法];W[id]C[白棋争得先手后，在上边补，白棋好。])(;B[iq]C[图4  黑棋不满（6分）黑棋在下边拆]N[图4  黑棋不满（6分）];W[qf]C[白棋在右边大拆];B[mn]C[黑棋还要花一手棋占据下边要点];W[mc]C[白棋拆二];B[oe];W[of]TR[oe]C[黑棋跳时，白靠，白棋好。]))",

		//wqqlzwcs_19_3.sgf
		"(;AW[bq][cq][dq][fq][fr][pp][qn][cb][dc][ec][eb][cd][gd][fd][gc][gb][kd][nd][pc][oc]AB[cc][bc][dd][ed][ce][fe][ef][fc][fb][dj][bp][cp][dp][ep][fp][hq][pd][qc][qb][qf]LB[in:a][hf:b][qi:c][nq:d]C[（中盘）黑先。目前棋局已形成白棋实地与黑棋势力相抗衡的局面。黑棋如何扩张自己的势力？请在 a、b、c、d 中选择。]SZ[19](;B[in]N[图1 正解（10分）]C[图1 正解（10分）黑棋大飞扩张是当务之急，虽然白棋实地都很坚实，但很难与左边黑势相比。])(;B[hf]N[图2  方向错误（6分）]C[图2  方向错误（6分）同样是扩张势力，本图中黑棋飞却是方向错误];W[gp]C[白棋扳出作战是好棋];B[gq];W[go];B[jp];W[gm];B[dm];W[jn]C[进行至此，左边黑棋势力被限制，白棋满意。])(;B[qi]N[图3  时机不成熟（6分）]C[图3  时机不成熟（6分）黑棋拆是右边实地的要点];W[gp]C[但却给了白棋扳出的机会，黑棋由此很难取得好结果];B[gq];W[go];B[jp];W[gm];B[dm];W[jn];B[mq];W[oq]C[进行至此都是预想的进行，结果白棋好。])(;B[nq]N[图4  方向错误（6分）]C[图4  方向错误（6分）黑棋挂角意义不大];W[gp]C[其后白棋扳出同样是要点];B[gq];W[hp];B[ip];W[gn];B[jq];W[in]C[进行至此，白棋得以整形，并且限制了左边黑棋势力。]))",

		//wqqlzwcs_19_4.sgf
		"(;AW[cd][dc][ed][gd][gc][ic][id][he][hf][gf][je][jf][ih][ig][hh][kh][ki][mh][nh][ni][nj][mf][me][og][of][pf][qg][rf][pb][qc][qa][rb][rc][mk][ml][nn][mp][mq][pq][qo][pl][ql][rl][qk][rj][sk][fi][ei][di][bi][cj][ck][bl][bm][bo][dl][dm][em][en][eo][ek][fk][fl][gl][hm][ho][kr]AB[be][ce][ch][cg][eh][ee][fe][ge][fg][gg][hg][gh][gi][gj][gk][hi][hd][hc][jd][ld][kd][kc][ke][lf][lg][nd][ob][oc][pc][pe][qe][qd][qf][rd][rg][oh][ph][pg][oi][ok][pk][pj][qj][ri][lk][lj][jj][km][lo][lp][il][hl][gm][gn][go][gp][hp][jq][bk][dk][cl][cm][cn][bn][dn][do][dp][ep][bp]CR[kr]C[（终盘）黑先。目前白棋在下边飞，黑棋最佳收官方法是什么？]SZ[19](;B[lr]C[图1  正解（10分）黑棋跨是官子手筋]N[图1  正解（10分）];W[lq];B[kq];W[jr];B[ir];W[mr];B[mo];W[no];B[bc]TR[lr]C[白棋吃黑一子时，黑争得先手，可以跳入左上角。])(;B[lr]C[图2 变化图]N[图2 变化图];W[lq];B[kq];W[bd]C[白棋如果脱先补左上角……];B[mr];W[nr];B[jr]C[黑棋吃住白一子，收获很大。])(;B[jr]N[图3 后手（4分）]C[图3 后手（4分）黑棋单挡];W[kq];B[kp]CR[kq]C[白棋冲时，黑棋挡不可避免地要落后手，黑棋不满。];W[bd]C[白再在左上角挡，白棋两处得益。])(;B[kq]N[图4 大同小异（4分）]C[图4 大同小异（4分）黑棋压];W[lr]C[白棋退];B[bc]C[黑棋先在左上角跳虽然也可以考虑……];W[hs]C[但被白大飞后，黑棋痛苦。]))",

		//wqqlzwcs_19_5.sgf
		"(;AB[bs][br][cq][bp][dp][do][en][fn][go][fq][io][hp][hq][hr][jp][jq][jr][js]AW[cs][cr][dq][eq][er][ep][eo][gp][gq][gr][hs][is][ir][iq]C[（官子）黑先。黑棋如何通过威胁白棋的死活而取得官子利益？其中行棋次序至关重要。]SZ[19](;B[fp]N[图1 正解（10分）]C[图1 正解（10分）黑棋冲];W[fo]C[白棋必挡];B[es]C[黑棋再托];W[dr]C[白棋接必然];B[gs]C[然后黑棋扑是绝妙的一手];W[fs];B[ip]C[进行至此，黑棋可以吃住白四子。黑提 4 子，成空 2 目，得 6 目。白地 8 目（白棋提子，以后提回一子，粘劫）。白提子后，黑提白四子有可能成为后手。])(;B[es]N[图2 失败（0分）]C[图2 失败（0分）黑棋先托次序错误];W[fs]C[白棋打吃当然];B[fp];W[ds];B[fo];W[fr]C[黑棋先手接回。白提 3 目，黑无目。与图1 相比，白少 5 目，但黑少 6 目，所以黑损 1 目。本图黑是绝对的先手。看来得失还要仔细衡量。])(;B[fp]C[图3 失败（0分）]N[图3 失败（0分）];W[fo];B[ip]C[黑棋打吃也是次序错误];W[gs]C[白棋粘];B[es];W[dr]TR[es]C[黑棋托时，白棋粘即可。黑大损。白成空 9 目，与图2 相比黑损 6 目。]))",

		//wqqlzwcs_19_6.sgf
		"(;AB[dq][cp][co][fq][fo][fm][hq]AW[cn][dn][do][dk][fk][hl][hn][ho]C[（手筋）白先。白棋如何攻击黑棋的薄弱点？只要能发现第一手棋，后续手段就简单了。]SZ[19](;W[fp]N[图1 正解（10分）]C[图1 正解（10分）白棋挖是攻击黑棋形弱点的手筋];B[gp];W[ep];B[go];W[eq]C[白棋冲下，黑形崩溃。])(;W[fp]C[图2  变化图]N[图2  变化图];B[ep]C[黑棋从这里打，寻求变化];W[gp];B[eo];W[gq]C[白棋一样冲下。])(;W[ep]C[图3 失败（0分）]N[图3 失败（0分）];B[fp]CR[ep]C[白棋刺，被黑粘上后，刺成为恶手。]))",

		//wqqlzwcs_19_7.sgf
		"(;AB[dq][dp][cm][em][fm][gm]AW[do][er][fq][fo][fn][ip][ck][ek]C[（手筋）黑先。黑棋目前仍处于不安定状态，如何通过整形，把棋走干净？]SZ[19](;B[eo]N[图1   正解（10分）]C[图1   正解（10分）黑棋挖是整形的手筋];W[en];B[dn];W[ep];B[co]C[进行至此，黑棋可将棋走干净。])(;B[co]N[图2  失败（0分）]C[图2  失败（0分）黑棋扳失败];W[dn];B[cn];W[dm]C[被白棋冲断后，黑棋大损。])(;B[dn]N[图3 黑棋失败（0分）]C[图3 黑棋失败（0分）黑棋夹似是而非];W[co]C[白棋长后，黑棋面临最可怕的结果];B[eo];W[ep];B[en];W[bn];B[bm];W[bq]C[进行至此，黑角被杀，黑大损。])(;B[eo]C[附图 进一步计算]N[附图 进一步计算];W[en];B[dn];W[co]TR[dn]C[黑棋打时，白长出怎么办？这里需要计算清楚。];B[ep];W[bn];B[bm];W[bq]LB[fp:a][bp:b]C[进行至此是必然的次序，现在白棋存在 a 位的弱点了。而且黑 b 位跨也成立。白不能这样下，这是与图3 的区别。]))",

		//wqqlzwcs_19_8.sgf
		"(;AB[bs][bq][cr][dq][eo][ep][eq][fn][gn][ho][io][jp][kp][iq][jr][kr][js]AW[cs][dr][er][fq][fp][fo][go][gq][hq][hp][ip]C[（死活）黑先。黑棋利用手筋可以吃住白棋，应该如何下呢？]SZ[19](;B[fs]C[图1  正解（10分）黑棋点是急所]N[图1  正解（10分）];W[hs]C[白棋跳下最具有迷惑性];B[gr];W[hr];B[fr];W[gs];B[es]C[黑棋多送一子是要领];W[ds];B[fr]C[进行至此，黑吃住白棋。])(;B[gs]N[图2  失败（0分）]C[图2  失败（0分）黑棋点这里是受形状束缚的恶手];W[fs]C[白棋尖顶];B[ds];W[hs]C[白棋简单做活。])(;B[hs]N[图3  失败（0分）]C[图3  失败（0分）黑棋单跳如何？];W[fs]C[白棋倒虎是做活的要点];B[ds];W[gs];B[cs];W[hr];B[fr];W[is]LB[es:a][ir:b]C[进行至此，a、b 两点见合，白棋轻易做活。]))",

		//wqqlzwcs_19_9.sgf
		"(;AB[cr][co][bo][do][ep][fo][fq][gq][gr]AW[br][bq][dp][dq][eq][fr]C[（死活）黑先。黑棋如何利用白棋的气紧是问题的焦点。第一手棋是关键。]SZ[19](;B[ds]N[图1 正解（10分）]C[图1 正解（10分）黑棋尖是死活的急所];W[es];B[cq]CR[es]C[白棋尖顶时，黑棋冲是好手];W[dr];B[cp];W[cs];B[aq]C[进行至此，白棋没有两只眼。])(;B[ds]C[图2 变化图]N[图2 变化图];W[er]C[白棋如果粘的话……];B[es];W[fs];B[cq]TR[es]CR[fs]C[黑棋与白棋交换一手后再冲是好次序];W[cp];B[bp]C[白棋被吃。])(;B[fs]N[图3 失败（0分）]C[图3 失败（0分）黑棋从底线打];W[ds]C[白棋跳下是防守的形];B[cs];W[bs];B[dr];W[er];B[es];W[cq]C[白棋利用黑棋的接不归做活。]))",

		//wqqlzwcs_19_10.sgf
		"(;AB[cp][ep][dq][fp][hp][hq][io][ir][gr][kp][lp][lq][lr]AW[eq][fq][gq][hr][hs][iq][jq][jr][kq]C[（死活）黑先。黑棋应无条件吃住白棋，如果形成劫杀就是失败。]SZ[19](;B[fs]N[图1 正解（10分）]C[图1 正解（10分）黑棋尖是绝妙的手筋];W[fr];B[ds]CR[fr]C[白棋如果打吃，黑棋跳即可，白棋被杀。])(;B[er]N[图2 失败（0分）]C[图2 失败（0分）黑棋扳缺少计算];W[fr];B[fs];W[gs];B[ds]C[这样形成打劫，与图1 相比差别很大。])(;B[ds]C[图3 失败（0分）]N[图3 失败（0分）];W[fs]TR[ds]C[黑棋单跳，白棋跳下即可，白棋简单做活。])(;B[fs]C[附图]N[附图];W[er]TR[fs]C[黑棋尖时，白棋立下如何？];B[dr]C[黑棋挡即可];W[es];B[ds]C[白不入气。]))",
	],

	[

		//wqqlzwcs_20_1.sgf
		"(;AB[pd][nc][qk][pp][mq][ep][gp][fq]AW[dq][eq][cp][cn][dd][qf][qi][rd]LB[jp:a][jd:b][qc:c][em:d]C[（布局）黑先。黑棋应考虑全局棋子的布置，力求掌握局面的主动。请在 a、b、c、d 中选择。]SZ[19](;B[jp]C[图1 最差点（4分）黑棋在下边防守过于消极，并且极易诱使白棋点三三]N[图1 最差点（4分）];W[qq];B[qp];W[pq];B[oq];W[or];B[nr];W[op];B[nq];W[rp];B[ro];W[rq];B[qn];W[pr];B[oo]TR[jp]C[进行至此都是预想的进行，结果说明当初黑棋在下边的拆过于接近自己的势力而使黑棋显得重复];W[qc]C[白棋占据要点之后，白棋满足。])(;B[jd]N[图2 方向错误（6分）]C[图2 方向错误（6分）黑棋在上边占大场];W[lp]TR[jd]C[被白在下边肩冲后，黑棋在上边一手成为疑问手];B[lq];W[jp]C[白棋形势好。])(;B[qc]C[图3 无谋（6分）黑棋尖虽是角上定式，却显得无谋]N[图3 无谋（6分）];W[lp]C[其后白棋肩冲是绝好的侵消手段];B[mp];W[ln]C[白棋好。])(;B[em]N[图4 正解（10分）]C[图4 正解（10分）黑大跳扩张是正确的，这样白棋会很难选择下一步的作战。黑棋以这种大胆的大模样作战方法来控制局面。]))",

		//wqqlzwcs_20_2.sgf
		"(;AB[pd][dp][cq][fq][bb][cb][cc][dd][ed][cf][fe][ge][gc]AW[gd][id][bc][cd][ce][de][df][ch][bp][cn][dl][pp]LB[mc:a][qj:b][jp:c][hd:d]C[（布局）黑先。左边已完全变成了白棋的势力范围，黑棋如何才能维持局面的平衡？请在 a、b、c、d 中选择。]SZ[19](;B[mc]N[图1 正解（10分）]C[图1 正解（10分）黑棋大飞是一箭双雕的要点，不仅可以守角，而且还可有效地攻击上边白棋二子。])(;B[qj]N[图2 方向错误（6分）]C[图2 方向错误（6分）黑棋展开重视右边，但是方向错误];W[nc]C[白棋挂是好点];B[pf];W[pb];B[qc];W[ld]C[进行至此，白棋能够轻易安定，白棋满足。])(;B[jp]N[图3 方向错误（6分）]C[图3 方向错误（6分）黑在下边行棋脱离主战场，此时上边才是局势的焦点];W[nc];B[pf];W[pb];B[qc];W[ld]C[被白棋在上边安定后，黑棋缺少妙味];B[nq];W[qn]C[进行至此，白棋布局很舒服。])(;B[hd]N[图4 最差点（4分）]C[图4 最差点（4分）黑打吃白棋一子是感觉错误];W[hc];B[fd]C[黑棋严重重复];W[nc];B[pf];W[pb];B[qc];W[kc]C[进行至此，黑棋不满。]))",

		//wqqlzwcs_20_3.sgf
		"(;AW[dc][de][di][dp][fq][qc][pc][nc][nb][ng][nh][ni][oi][ok][oj][om][pl][ql][np]AB[hd][lc][me][od][pd][qd][mi][og][oh][of][pi][pj][qk][rl][qm][nn][op][oq][qp][jp]LB[co:a][hq:b][fc:c][ll:d]C[（中盘）白先。白棋有必要沉着冷静地分析局面，找出应优先考虑的要点。请在 a、b、c、d 中选择。]SZ[19](;W[co]N[图1 次选方法（8分）]C[图1 次选方法（8分）白棋尖是大场，但时机不成熟];B[ml]C[黑棋飞攻是急所];W[mj];B[lj];W[li];B[mk];W[mh];B[kj]C[进行至此，黑棋筑成很厚的外势，而白棋仍不安定。])(;W[hq]N[图2 方向错误（6分）]C[图2 方向错误（6分）白棋拆一虽在实地上无法忽视，但是方向错误];B[ml]C[黑棋飞同样是急所];W[mj]C[其后白棋扳整形];B[iq];W[hp];B[in]TR[iq]C[黑棋则尖顶、飞，扩张下边，黑棋有利。])(;W[fc]N[图3 最差点（4分）]C[图3 最差点（4分）白在上边拆是价值最小的位置，由于上边黑棋两侧都漏风，因此上边并不急];B[ml]C[黑棋飞是大势要点];W[mj];B[lj];W[li];B[mk];W[mh];B[kj];W[hq];B[iq];W[hp];B[in]C[到此，是预想的进行，黑棋领先。])(;W[ll]N[图4 正解（10分）]C[图4 正解（10分）白棋大飞整形是当务之急，白棋飞后有打入下边的企图];B[lo]C[黑补棋];W[hq]C[白再在下边拆是好棋，白棋形势不错。]))",

		//wqqlzwcs_20_4.sgf
		"(;AW[bc][ad][be][cd][dc][ed][fb][gc][gd][hd][ic][ie][ig][qb][qc][pd][oc][of][oh][mg][mh][oj][jj][hj][gj][fi][ei][fh][eg][dj][cj][bj][ci][bh][ak][bl][dl][cl][el][ek][fk][cn][dq][cq][bq][eq][fq][fp][iq][ir][kq][lq][np][nq][nr][os][pr][qr][qq][rr]AB[or][oq][pq][pp][qp][rq][pn][pk][pj][pi][qg][qe][qd][rc][gr][hr][hp][gp][jo][lp][go][fo][eo][ep][cp][co][gk][gl][il][bf][ce][de][cg][ch][dh][eh][di][bi][fg][ff][ge][gh][hg][ih][jg][lg][mf][ke][kc][hc][hb][gb][ib][mc]LB[rb:a][nb:b][rp:c][kl:d]C[（终盘）黑先。黑棋可通过正确的计算，寻求价值最大的位置。请在 a、b、c、d 中选择。]SZ[19](;B[rp]N[图1 正解（10分）]C[图1 正解（10分）黑棋粘是价值最大的地方];W[rb]C[白棋曲是次大的官子];B[nb]C[黑棋再尖，这是最佳结局。])(;B[rb]N[图2 次选方法（8分）]C[图2 次选方法（8分）黑棋挡虽是不可忽视的大棋，……];W[rp];B[ro];W[sq]C[但被白吃掉一子后，黑棋损失很大];B[so]LB[rn:a]C[黑棋为防止 a 位夹，立下补棋];W[om]C[白棋点先手利用];B[pm];W[kl]C[然后白再围中腹，白棋非常满足。])(;B[kl]N[图3  黑棋不满（6分）]C[图3  黑棋不满（6分）黑棋单跳重视中腹，但实际上中腹要比想象的价值小];W[rp];B[ro];W[sq];B[so];W[om];B[pm];W[rb]TR[kl]C[黑棋跳后，白棋占据多处要点，结果黑棋不满。])(;B[nb]N[图4  最差点（4分）]C[图4  最差点（4分）黑棋尖是价值最小的位置];W[rp];B[ro];W[sq];B[so];W[rb]C[白在右下提子后，再回到右上角，白棋非常满足。]))",

		//wqqlzwcs_20_5.sgf
		"(;AW[br][bq][cp][co][eo][fo][ho][go][gp][ip][iq][jp][kp][kq][kr][er]AB[cr][cq][dq][ep][fp][fr][gq][hq][hp][ir][jr][jq]C[（官子）白先。白棋有借威胁黑棋死活而占官子便宜的手法，第一手棋是关键。]SZ[19](;W[ds]N[图1  正解（10分）]C[图1  正解（10分）白棋尖是官子手筋];B[fs]C[黑只有退让];W[cs];B[eq];W[dr];B[hs];W[js];B[gr]C[进行至此，黑棋只能后手做活。黑棋两目，白棋没目，白先手，外面官子全部走到。])(;W[ds]C[图2  变化图]N[图2  变化图];B[cs]CR[ds]C[白棋尖时，黑挡下无理];W[eq];B[fq];W[dp]C[黑棋惨败。])(;W[cs]C[图3  失败（0分）]N[图3  失败（0分）];B[ds];W[bs]C[白棋简单扳粘，错过了机会。];B[eq]C[与图1 相比，差别很大。])(;W[ds]C[附图  黑的选择]N[附图  黑的选择];B[cs];W[eq];B[dp];W[fq];B[dr];W[gr];B[es];W[hr];B[fq]))",

		//wqqlzwcs_20_6.sgf
		"(;AW[br][bp][cq][bq][fq][gp][gn][cn]AB[bo][co][cp][dp][eo][dn][dl][io][iq]C[（手筋）黑先。黑棋能否发现白棋形上的薄弱环节？请寻找能够分断左右白棋的方法。]SZ[19](;B[eq]C[图1  正解（10分）]N[图1  正解（10分）];W[er];B[fr]C[黑棋尖、断是手筋];W[dq];B[fp]CR[dq]C[白棋打吃时，黑棋虎成劫。])(;B[eq]C[图2 变化图]N[图2 变化图];W[er];B[fr]TR[eq];W[gr];B[dr]CR[gr]C[白棋打吃时，黑反打，角上白被吃。])(;B[fr]N[图3  失败（0分）]C[图3  失败（0分）黑棋托只不过是官子行为];W[eq];B[gr];W[er]C[进行至此，白棋成功处理，黑棋失败。]))",

		//wqqlzwcs_20_7.sgf
		"(;AW[dq][do][co][en][em][gn][hq][kp]AB[eo][fo][fq][dn][dm][dl][el]C[（手筋）黑先。黑棋被上下分断，形势非常危险。黑棋可以摆脱危机的手筋是什么？]SZ[19](;B[hp]N[图1 正解（10分）]C[图1 正解（10分）黑棋压是针对左右两侧白棋弱点的手筋];W[gm]C[白棋双];B[iq]C[黑棋扳整形即可。])(;B[hp]C[图2 变化图]N[图2 变化图];W[ip]TR[hp]C[黑棋压时，白棋如果扳的话……];B[gm]C[黑棋靠是急所];W[fn];B[hn];W[go];B[gp]C[黑棋吃住白棋棋筋。])(;B[go]C[图3 失败（0分）]N[图3 失败（0分）];W[gm];B[io]TR[go]C[黑棋单纯向中腹出头是恶手];W[jp]C[黑棋是被攻击的棋形，与图1 相比差别很大。]))",

		//wqqlzwcs_20_8.sgf
		"(;AW[cr][cq][dp][co][dm][fr][gr][gq][gp][go][ko][kq]AB[dr][dq][eq][fq][fo][eo][fm][gn][hm][ho][ip][iq]C[（死活）白先。白棋如何救活被包围的五子？如果次序稍有不慎，便会招致失败。]SZ[19](;W[es]N[图1  正解（10分）]C[图1  正解（10分）白棋先尖];B[ds];W[ir]C[然后白再托是正确的次序];B[jr];W[hs]C[白倒虎重要];B[jq];W[hq]C[白棋成功做活。])(;W[ir]N[图2 失败（0分）]C[图2 失败（0分）白棋先托次序错误];B[jr];W[hs];B[jq];W[hq];B[fs]C[黑棋破眼的手段成立];W[es];B[er]C[白被杀。])(;W[ir]C[图3 失败（0分）]N[图3 失败（0分）];B[jr];W[hq]CR[ir]C[白棋托，然后想做劫];B[hs]C[但黑棋一点，白棋动弹不得。]))",

		//wqqlzwcs_20_9.sgf
		"(;AW[br][bq][ap][cq][dq][eq][cp]AB[cr][bp][bo][bn][co][dp][eo][fp][fq][fr]C[（死活）黑先。黑棋要弃掉一子非常容易，但黑棋只要能正确利用白棋气紧的弱点，就能吃住白棋。]SZ[19](;B[ds]N[图1  正解（10分）]C[图1  正解（10分）黑棋尖是急所];W[dr];B[cs]CR[dr]C[白棋打吃时，黑棋粘是要领];W[es];B[aq]C[黑棋扑，重要];W[bs];B[ar]C[白被杀。])(;B[aq]N[图2  失败（0分）]C[图2  失败（0分）黑棋扑次序错误];W[cs]C[白棋打吃，即可简单做活。])(;B[bs]N[图3  失败（0分）]C[图3  失败（0分）黑棋扳是恶手];W[dr];B[cs];W[aq]C[白棋粘，冷静，白棋已活。])(;B[ds]C[附图 变化]N[附图  变化];W[es]C[白棋跨下如何？];B[aq]C[黑棋扑即可]))",

		//wqqlzwcs_20_10.sgf
		"(;AW[br][bq][dq][dp][ep][er][es][fr]AB[dr][fs][gr][fq][fp][eq][fo][eo][hq][bo][cn]C[（死活）白先。白棋三子已被黑吃住，白棋如何利用这三子是关键。]SZ[19](;W[gs]C[图1  正解（10分）白棋提子]N[图1  正解（10分）];B[ds]C[黑棋打吃];W[cr];B[fs]C[进行至此是绝对的次序];W[cs]LB[er:a][bp:b]C[白棋挡的手段成立，以下黑 a 白 b，白简单做活。];B[bp]C[黑棋破眼，野心太大];W[er]C[白棋打吃即可。])(;W[cr]N[图2  失败（0分）]C[图2  失败（0分）白棋简单打吃是恶手];B[ds];W[bp];B[cp]C[黑棋破眼，白被杀。]))",
	],

	[

		//wqqlzwcs_21_1.sgf
		"(;AB[pd][nc][dd][dj][bq][bp][dq][cq][fq][fr][cn][en]AW[bo][co][cp][dp][ep][fp][gq][hq][gn][op][qf][pi]LB[fd:a][qo:b][qp:c][qq:d]C[（布局）黑先。黑棋是优先考虑扩张自身还是优先侵消白势？请在 a、b、c、d 中选择。]SZ[19](;B[fd]N[图1 操之过急（4分）]C[图1 操之过急（4分）黑棋单关守角，虽是扩张下法，但操之过急];W[qp]C[白棋守角];B[jd]C[黑棋在上边展开];W[gk]C[白二间跳是扩张的要点];B[gi];W[ij]C[进行至此，白棋广阔。])(;B[qo]N[图2 白棋满意（6分）]C[图2 白棋满意（6分）];W[qq]TR[qo]C[黑棋挂，白可轻松补角];B[ql];W[qj]TR[ql]C[黑拆二时，白小尖，黑棋以后不好下。])(;B[qp]C[图3 黑棋难受（6分）]N[图3 黑棋难受（6分）];W[pn];B[qn];W[qm];B[pm];W[on];B[ql];W[rm];B[rn];W[rl])(;B[qq]C[图4 正解（10分）]N[图4 正解（10分）];W[po];B[or];W[nq];B[nr];W[mq];B[mr];W[lq];B[ro]))",

		//wqqlzwcs_21_2.sgf
		"(;AW[dp][fp][cq][jp][mp][nc][ld][pb][hc][dd][de][dc][ec][eb]AB[db][cb][cc][cd][cf][fc][cn][bp][dl][pq][po][qk][pd][pf][qc]LB[eg:a][cj:b][ok:c][qm:d]C[（布局）白先。黑棋占据左右两边，白棋则占上下两边。白棋当前面临着是将局势搅乱还是求平和发展的困难选择。请在 a、b、c、d 中考虑。]SZ[19](;W[eg]C[图1 正解（10分）白棋飞，在牵制左边黑势的同时，还可扩张上边白势]N[图1 正解（10分）];B[cg];W[qi]TR[cg]C[黑棋在左边补棋，白打入黑右边];B[ok];W[oi]C[白棋好调。])(;W[cj]C[图2 白棋无理（4分）白立即打入是无理棋]N[图2 白棋无理（4分）];B[ck]C[黑尖顶];W[dj]C[白棋长];B[df]C[黑棋挺头是绝好的次序];W[ef];B[eg];W[ff];B[dh]C[进行至此，白棋难受。])(;W[ok]C[图3  方向错误（6分）白棋镇，重点侵消黑棋右边，但方向错误]N[图3  方向错误（6分）];B[df]C[黑棋长是双方不可放过的绝好点];W[qj]C[白棋靠下破坏黑右边];B[rj];W[rk];B[rl];W[pk];B[ql];W[ri];B[sk];W[ph]C[进行至此，黑占据实地后，白棋未占到便宜。])(;W[qm]C[图4  时机尚早（6分）白棋立即打入时机尚早]N[图4  时机尚早（6分）];B[pl]C[黑棋尖封，让白棋后手做活];W[qp];B[pp];W[qo];B[qq];W[pm];B[om];W[rk];B[rj];W[rl];B[qj];W[rn];B[df]C[白棋做活后，黑可抢占要点，结果黑棋满意。]))",

		//wqqlzwcs_21_3.sgf
		"(;AB[dr][fq][iq][oq][qp][ql][pd][oc][oe][mc][id][fd]AW[cc][df][dj][dp][dn][cq][jo][qj][qg][pc][qc][rd]LB[ho:a][hp:b][io:c][kp:d]C[（中盘）黑先。白棋飞侵消黑棋下边时，黑棋最有效的应法是什么？请在 a、b、c、d 中选择。]SZ[19](;B[ho]C[图1  黑不妥（8分）黑棋飞，攻击白棋，并非可行方法]N[图1  黑不妥（8分）];W[jq]C[白棋靠是手筋];B[jr];W[ip];B[hq];W[lq]C[白棋形富有弹性，完全可以处理。])(;B[hp]C[图2  正解（10分）黑棋尖正确，虽然看似迟缓，却是攻击白棋最有效的手法]N[图2  正解（10分）];W[jq];B[jr];W[kq];B[kr];W[mq];B[in];W[km];B[cl]C[白棋安定自己时，黑棋争得先手，在左边打入，黑棋形势不坏。])(;B[io]C[图3  黑棋无理（4分）黑靠]N[图3  黑棋无理（4分）];W[in]C[白扳];B[jn]C[黑棋断是征子有利时可以考虑的下法，但在本题中，黑棋无理];W[ip];B[ho];W[ko];B[hp];W[jm]C[白棋征吃黑一子，黑难受。])(;B[kp]C[图4  黑棋消极（6分）黑棋飞过于保守]N[图4  黑棋消极（6分）];W[ko];B[lp];W[hp];B[hq];W[fp];B[eq];W[ff]CR[ko][hp][fp]C[白在下边先手利用后，再单跳抢占要点，黑棋大势落后。]))",

		//wqqlzwcs_21_4.sgf
		"(;AB[cd][cc][cf][dj][dl][cn][pd][pf][qc][qk][pq][po][il][io][ip][in][hq][fq][ep][er][fc][gd]AW[bo][dp][dq][dr][eq][en][iq][ir][jp][jo][km][mp][ok][dd][ec][fb][fd][fe][id][ld][nc][pb]LB[pi:a][oj:b][pl:c][pm:d]C[（中盘）黑先。白棋镇侵消黑右边时，黑棋应该如何下？在分析问题时，希望将下边白棋已是活棋的因素考虑在内。请在 a、b、c、d 中选择。]SZ[19](;B[pi]C[图1  平常下法（8分）黑棋飞是常识性的下法]N[图1  平常下法（8分）];W[ql]C[白棋靠下，当然];B[rl];W[rk];B[rj];W[pk];B[qj];W[rm];B[sk];W[qp];B[qq];W[qo];B[pp];W[pm]C[白棋有效整形后，黑棋略有不满。])(;B[oj]C[图2 黑棋不利（4分）黑棋靠]N[图2 黑棋不利（4分）];W[pk]C[白棋顶是好棋];B[pj];W[ql];B[qj];W[nk];B[rl];W[qm];B[rm];W[qn]C[白棋整形之后，黑棋不利。])(;B[pk]C[图3 正解（10分）黑棋顶是正解，这一下法由于将使对方走厚，因而在心情上并非情愿，但可以使右边转化成实空，黑棋充分]N[图3 正解（10分）];W[oj];B[pi];W[om];B[pn]C[白棋外势可利用的价值并不大。])(;B[pm]C[图4 黑棋不满（6分）黑补棋]N[图4 黑棋不满（6分）];W[qj];B[rj];W[rk]CR[qj]C[白棋靠下、扭断是常用下法];B[rl];W[pk];B[ql];W[ri];B[sk];W[ph]C[进行至此，黑右边被破坏，黑棋当然不满。]))",

		//wqqlzwcs_21_5.sgf
		"(;AB[br][bq][cp][co][cm][dn][eo][fn][fp][gp][fr]AW[do][dp][ep][cq][cr][er][bs][gr][hq][ir][io]C[（官子）黑先。黑棋如用平常的手法收官不能令人满意，如能动用打劫这样的非常手段，可以获取大便宜。]SZ[19](;B[es]C[图1 正解（10分）黑棋扳是绝妙的官子手筋]N[图1 正解（10分）];W[fq]C[白打吃，必然];B[dr];W[eq];B[cs]C[黑棋扑劫，这个劫对黑棋来说是无忧劫。])(;B[fq]C[图2 黑棋失败（10分）在实战中很可能会出现黑棋接这样的下法]N[图2 黑棋失败（10分）];W[fs]C[白棋渡过];B[eq];W[dq]C[结果黑棋失败。])(;B[es]N[图3  变化图]C[图3  变化图];W[ds]TR[es]C[黑棋扳时，白棋挡无理];B[eq];W[dq]C[这样，这里成为一个大劫，白无法承受。]))",

		//wqqlzwcs_21_6.sgf
		"(;AB[br][bq][bp][co][dp][eo][fo][gp]AW[cr][cq][dq][fp][ep][go][ho][hq][ir]C[（官子）黑先。在本题中，黑棋应怎样利用白棋的弱点收官？]SZ[19](;B[ds]N[图1  正解（10分）]C[图1  正解（10分）黑棋点问白应手是官子手筋];W[er]C[白棋必然退守];B[cs];W[es]C[黑棋先手渡过。])(;B[eq]C[图2  失败（0分）]N[图2  失败（0分）];W[fq]TR[eq]C[黑棋断，被白棋打吃之后，黑棋未占到便宜];B[er];W[fr];B[cs];W[es]C[与图1 相比，黑棋损 1 目左右。])(;B[ds]C[图3  变化图]N[图3  变化图];W[cs]TR[ds]C[黑棋点时，白棋挡不成立];B[eq];W[fq];B[er];W[fr];B[bs]C[白四子被吃。]))",

		//wqqlzwcs_21_7.sgf
		"(;AW[cq][bq][dq][er][fq][gq][gr][fo][go][ho][hp][ip][jq][kq][lq]AB[fr][eq][ep][fp][gp][dp][cp][dn][en][fm][hm][in][jp][jo][hq][iq][jr][ir]C[（手筋）黑先。黑棋如果现在就开始收气，黑棋将短一气。在本题中黑棋取胜的手筋是什么？]SZ[19](;B[gs]C[图1  正解（10分）]N[图1  正解（10分）];W[fs];B[hs]TR[gs]C[黑棋打吃、退是对杀的手筋];W[dr]C[白棋被迫接上，无奈];B[gn];W[fr];B[hn];W[hr];B[eo]C[对杀黑快一气。])(;B[gn]N[图2  失败（0分）]C[图2  失败（0分）黑棋直接收气];W[hr]C[白棋在这里紧气是好棋];B[hn];W[kr]C[对杀白快一气。]))",

		//wqqlzwcs_21_8.sgf
		"(;AB[bs][br][bq][cp][dp][do][fo][fp][hp][hq][hr]AW[cr][cq][eq][gq][gr][bp][bo][cn]C[（手筋）黑先。黑棋如何利用白棋形的弱点以扭转局势？]SZ[19](;B[er]N[图1 正解（10分）]C[图1 正解（10分）黑棋靠是急所，是对杀中的手筋];W[dr];B[ds];W[dq];B[fq]C[黑吃住白棋。])(;B[dr]N[图2  失败（0分）]C[图2  失败（0分）黑棋夹];W[dq];B[cs];W[er];B[ds];W[es]C[黑棋慢一气。])(;B[er]C[图3  变化图]N[图3  变化图];W[dq];B[fq]C[黑棋冲断];W[fr];B[ds]C[白棋不行。])(;B[dr]C[附图    黑不好]N[附图    黑不好];W[dq]TR[dr]C[黑棋夹时，白棋粘，必然];B[er]C[黑棋贴长也可吃掉白棋，但不如图1 简明和味道好，而且目数上也不便宜。]))",

		//wqqlzwcs_21_9.sgf
		"(;AW[cq][cp][co][ep][eo][en][fq][fr][cm]AB[bo][bn][cn][dm][cl][el][gm][fo][fp][gq][gr][eq][dq]CR[fq][fr]C[（死活）白先。角上白棋已经非常危险，白棋如何最大限度地利用两个死子来做活呢？]SZ[19](;W[dr]C[图1 正解（10分）]N[图1 正解（10分）];B[er];W[ds]CR[dr]LB[es:a][fs:b]C[白棋扳、立是正解，其后无论黑走 a 位还是 b  位，白均可活棋];B[fs]C[黑如果提子……];W[br]C[白棋虎是急所];B[aq];W[ar]C[白棋净活。])(;W[dr]C[图2  变化图]N[图2  变化图];B[er];W[ds];B[es]C[黑挡下];W[dp]C[白棋打，先手利用];B[fs];W[bs]C[白在一线跳是急所];B[cr];W[br];B[cs];W[bp]C[白棋弃子，仍可做活。])(;W[er]C[附图 白失败]N[附图 白失败];B[dr];W[cr]C[白棋这样利用，很容易想到];B[es];W[dp];B[fs];W[dn];B[ar]C[白被杀]))",

		//wqqlzwcs_21_10.sgf
		"(;AW[ar][bq][bp][dp][do][en][ep][fp][gm][hn][ho][hp][gq][er][ir][jr][kr][jp][jo][lp]AB[br][cr][dq][eq][fq][gp][go][fo][hq][hr][iq][ip][is]CR[gq][er]SZ[19]C[（死活）黑先。白棋的两个死子所在的位置对黑棋来说很不舒服，黑棋如何巧妙地确保做活？](;B[dr]N[图1 正解（10分）]C[图1 正解（10分）黑棋团是做活的唯一要点];W[es]C[白棋立下];B[bs]C[黑立下扩大眼位];W[ds]C[白必然破眼];B[fs]C[黑棋靠是要领，这样黑棋做活了。];W[hs]C[以下白棋如果扑];B[gr]C[黑提子即可。])(;B[fr]C[图2 失败（0分）黑棋拐下是恶手]N[图2 失败（0分）];W[es]C[白棋必立];B[bs];W[ds]C[黑棋没有两只眼。])(;B[dr]C[附图]N[附图];W[es];B[bs];W[ds];B[gr]LB[hs:a][fs:b][fr:c][gs:d]C[其实黑简单提子即可，白没棋。以下：白 a 则黑 b，与正解一样的图形；白 b 则黑 a ，仍然是双活；白 c  则黑 b 扑；白 d 更是没有必要考虑。此题比较完整的计算需要一定的计算能力，尤其是黑的失败图比较多。]))",
	],

	[

		//wqqlzwcs_22_1.sgf
		"(;AB[cc][db][fc][kc][fq][dr][iq][op][pp][qp][qo][ro][ql][pe][pd][pc][ob][oc][qh][ph]AW[cq][dp][cn][cd][dd][df][ge][nc][pb][qb][qc][qd][qf][qg][qn][nq][pq][qq][rq][rp]LB[hd:a][ch:b][cj:c][cl:d]C[（布局）黑先。在本题中，黑棋是优先考虑扩张自身还是打入白阵？请在 a、b、c、d 中选择。]SZ[19](;B[hd]N[图1 黑棋消极（6分）]C[图1 黑棋消极（6分）黑棋防守过于消极];W[he];B[id];W[dj]CR[he]C[白棋先手压后，抢占左边的要点，白棋非常满意。])(;B[ch]N[图2 黑棋不妥（6分）]C[图2 黑棋不妥（6分）黑棋打入选点不妥];W[cj]C[此时白棋逼攻很好];B[eh];W[gh]C[黑棋跳出时，白棋镇头，结果黑棋不利。])(;B[cj]N[图3  正解（10分）]C[图3  正解（10分）黑棋分投是正解];W[ch];B[cl]C[白棋逼时，黑棋拆一整形是要领];W[cr];B[hd]CR[cr]C[白在角上补棋时，黑再回到上边防守，结果好点都被黑棋占了。])(;B[cl]N[图4  白棋满足（6分）]C[图4  白棋满足（6分）黑棋逼攻角上白棋同样不妥];W[cj]C[白棋夹攻];B[el]C[黑棋跳出];W[fn]C[白棋则可继续追击，结果黑棋在逃跑时，其油侧势力被自然削弱。]))",

		//wqqlzwcs_22_2.sgf
		"(;AW[dd][dp][eq][cn][kq][mo][nq]AB[fq][fp][iq][pq][oo][qo][pd]LB[io:a][jo:b][ko:c][lp:d]C[（布局）黑先。如何处理下边是黑棋面临的问题，最有效的处理方法是什么？请在 a、b、c、d 中选择。]SZ[19](;B[io]C[图1  平常下法（8分）黑棋单跳是平常下法]N[图1  平常下法（8分）];W[ko]C[白补棋];B[fc]C[黑挂角];W[df];B[jd]C[双方均可下。])(;B[jo]N[图2   错失急所（6分）]C[图2   错失急所（6分）黑棋飞虽很积极……];W[ko]C[但白棋靠是先手，黑棋不满];B[jn];W[qi]C[白棋争得先手后，在右边分投，结果白棋满意。])(;B[ko]C[图3   黑棋无理（4分）]N[图3   黑棋无理（4分）];W[jp]TR[ko]C[黑棋走象步看似棋形的急所，但被白穿象眼后，黑棋不好下];B[jn];W[ip];B[hq];W[in]C[黑棋反而受攻。])(;B[lp]C[图4  正解（10分）黑棋直接穿象眼是正解]N[图4  正解（10分）];W[kp];B[lo];W[ko]C[白棋向中腹出头];B[ln];W[lq];B[mp]C[进行至此，黑棋的收获很大];W[io]C[白棋镇攻击黑棋];B[hn]C[黑可走象步，结果黑棋充分。]))",

		//wqqlzwcs_22_3.sgf
		"(;AB[cd][jp][mp][nq][or][op][oo][po][qo][pn][pj][ql][qm][pf][qd]AW[od][dp][oq][pq][pp][pr][qp][qn][rn][ro][pm][om][mm][nj][ed]LB[ne:a][ph:b][oh:c][oi:d]C[（中盘）黑先。黑棋如何攻击中腹的白棋是当前的焦点所在，同时黑棋还应在一定程度上考虑到自身的弱点。请在 a、b、c、d 中选择。]SZ[19](;B[ne]C[图1  黑棋不满（6分）黑棋肩 冲是声东击西的战术]N[图1  黑棋不满（6分）];W[qc];B[rc];W[pc];B[rb];W[lc]TR[ne]C[但白棋在上边轻易得到安定，从而黑肩冲一子成为疑问手。黑棋不能对中腹白棋实施有效的攻击是黑棋的不满。])(;B[ph]C[图2  正解（10分）黑棋单跳补右边是正解]N[图2  正解（10分）];W[qc]C[白棋托角，在上边安定自己];B[rc];W[pc];B[rb];W[lc];B[fq]C[黑棋在左下挂，伺机攻击中腹的白棋，结果黑棋充分。])(;B[oh]N[图3  弱点（8分）]C[图3  弱点（8分）黑棋飞的下法可以考虑];W[qc];B[rc];W[pc];B[rb];W[lc]C[但与正解相比，右边黑棋本身也存在弱点，因而不能赞成。])(;B[oi]C[图4  黑棋不满（6分）]N[图4  黑棋不满（6分）];W[ni]LB[qi:a]TR[oi]C[黑棋尖，被白棋压后，黑棋收获不大。黑的这手棋不仅使对方走强，而且自身也留有 a 位的弱点，因此不可取。]))",

		//wqqlzwcs_22_4.sgf
		"(;AB[pd][qc][pf][pj][pp][po][qo][rn][qm][nq][oq][gp][hp][fq][cq][cr][cp][dr][co][bn][dn][dm][em][di][ei][bi][ch][bg][ah][cf][ef][eg][fg][bd][bc][gf][hf][ie][id][ic][ib][hd][jc][kg]AW[cc][dd][fe][ff][fd][fc][hc][hb][dh][eh][fh][gh][gg][ci][dj][cj][dk][fk][bm][fm][gn][en][eo][do][dp][dq][er][fr][hq][ip][jq][pq][pr][qp][rp][ro][jd][kd][kc][kb][nc][mf][pb]LB[ig:a][ih:b][lh:c]C[（中盘）黑先。上边一块黑棋仍处于不安定的状态，黑棋最有效的处理方法是什么？请在 a、b、c 中选择。]SZ[19](;B[ig]C[图1 黑棋不满（6分）黑棋补弱点，虽然很厚，但过于迟缓]N[图1 黑棋不满（6分）];W[jf];B[jg]CR[jf]C[白先手与黑交换一手];W[mh];B[jj];W[lj]CR[mh]C[然后白棋继续攻击黑棋，黑很难与大本营取得联络。])(;B[ih]C[图2  正解（10分）黑棋飞是形]N[图2  正解（10分）];W[lh]C[白棋如果继续追攻的话……];B[kh];W[li]TR[kh]C[黑棋先手压，与白交换一手];B[jk]LB[jj:a]C[然后黑棋飞出，黑可以轻松解脱危机。])(;B[ih]C[图3  变化图]N[图3  变化图];W[jf]TR[ih]C[黑棋飞时，白棋破眼];B[hg]C[黑棋连接];W[jg];B[jh];W[kh]C[白棋冲断];B[ki];W[lh];B[jj]C[进行至此，黑棋的棋形具有弹性，结果黑棋充分。])(;B[lh]N[图4  黑棋难受（4分）]C[图4  黑棋难受（4分）黑棋尖出是不顾自身弱点的下法];W[jf]C[白棋的攻击极其严厉];B[ig];W[jg];B[jh];W[ih];B[je];W[kf]C[黑被分断，危在旦夕。]))",

		//wqqlzwcs_22_5.sgf
		"(;AB[br][bq][cp][dp][fp][ep][gq][hq][iq][jr][js][jp]AW[cq][cr][dq][eq][fq][gr][hr][ir][is]C[（官子）黑先。在本题中，黑棋应该如何收官？]SZ[19](;B[cs]N[图1  正解（10分）]C[图1  正解（10分）黑棋扳问白应手是官子要领];W[es]C[白必然后退];B[ds];W[fs]TR[ds]C[黑则可以爬进，先手压缩白空。])(;B[es]N[图2  失败（0分）]C[图2  失败（0分）黑棋点看似可以成立];W[ds]C[但被白尖顶以后，黑棋一无所获];B[fr];W[er]TR[fr]C[以后黑棋断时，白打吃即可。])(;B[cs]C[图3  变化图]N[图3  变化图];W[ds]TR[cs]C[黑棋扳时，白挡住无理];B[fr];W[er];B[fs]C[白被杀。]))",

		//wqqlzwcs_22_6.sgf
		"(;AB[dr][dq][ep][fp][do][co][bn][cm][em]AW[bo][cp][cq][dp][eq][er][fq][eo][fn][go][hq]C[（官子）黑先。在本题中，黑棋的问题并非只是吃住白棋一子，而是如何进入白棋的角地。]SZ[19](;B[bq]C[图1  正解（10分）黑棋夹，最大限度压缩白角是官子手筋]N[图1  正解（10分）];W[cr]C[为了避免纷争，白棋退让];B[bp]LB[br:a]C[黑棋吃住白一子，收获很大，以后黑棋还有 a  位的打。])(;B[bp]N[图2  失败（0分）]C[图2  失败（0分）黑棋简单打吃，无谋];W[bq];B[ao];W[aq]C[与图1 相比，黑棋相差太多。])(;B[bq]C[图3  变化图]N[图3  变化图];W[bp]TR[bq]C[黑棋夹时，白棋粘上顽强抵抗];B[cr];W[br];B[ar];W[aq];B[bs]C[角上形成劫争，这个劫白的负担很大。])(;B[cr]N[附图 为什么？]C[附图 为什么？黑棋直接拐可以成立];W[br];B[bq];W[bp];B[ar];W[aq];B[bs];W[as]C[角上成劫。白的先手劫，白一手即可消劫。而对黑来说，这是个两手劫。因此与图1 相比，得失要全盘考虑。选择图1 还是本图，是黑棋的权利。]))",

		//wqqlzwcs_22_7.sgf
		"(;AB[cr][cq][cp][co][dn][en][eo][fo][go][gp][gq][gr]AW[bq][bp][bo][bm][cn][dm][do][dp][ep][fp][dr][fr]C[（手筋）黑先。在本题中，黑棋的手筋应是什么？]SZ[19](;B[ds]N[图1 正解（10分）]C[图1 正解（10分）黑棋扳是手筋];W[es]C[白只有挡];B[dq];W[eq];B[fq]C[白棋被吃。])(;B[er]N[图2 失败（0分）]C[图2 失败（0分）黑棋挖似是而非];W[dq]C[白棋接上即可];B[fq];W[br]C[黑被吃。])(;B[ds]C[图3  变化图]N[图3  变化图];W[er]TR[ds]C[黑棋扳时，白如果连接的话];B[fs]C[黑棋扳，使白棋不入气];W[es];B[fq];W[cs];B[eq]C[白棋不行。]))",

		//wqqlzwcs_22_8.sgf
		"(;AW[cr][br][dr][er][cq][dp][do][co][bn][dm][dk]AB[bq][bp][bo][cp][dq][eq][ep][fr][es][gq][fn]C[（手筋）黑先。在本题中，黑棋在对杀中胜利的要点在何处？]SZ[19](;B[an]C[图1  正解（10分）黑棋扳长气是手筋];W[bm]C[白棋只能退];B[ar]C[然后黑棋扳];W[ao];B[ds];W[am];B[cs]C[对杀黑胜利。])(;B[an]C[图2  变化图 ]N[图2  变化图 ];W[am]TR[an]C[黑棋扳时，白棋挡无理];B[cn];W[bm];B[dn]C[白三子被吃。])(;B[an]C[图3  变化图]N[图3  变化图];W[bm];B[ar];W[ds]TR[ar]C[黑棋扳时，白棋可打吃做劫];B[bs];W[fs];B[gs];W[am]C[此劫对白来说是紧气劫，而对黑棋来说是缓气劫。还是黑的先手劫。]))",

		//wqqlzwcs_22_9.sgf
		"(;AB[cs][dr][ds][cr][fr][fq][gq][hq][ir][jr][kr]AW[bs][br][bq][cq][dq][ep][fo][go][hp][iq][jq][kq][lq][ls][lr][hr][gr]C[（死活）黑先。黑棋如果考虑得过于简单很可能会失败，以平常的手段是做不出两个眼来的。]SZ[19](;B[is]N[图1 正解（10分）]C[图1 正解（10分）黑棋立下是做活的唯一急所];W[ks]C[白棋破眼，必然];B[fs]C[黑棋立下重要];W[js];B[hs];W[gs];B[ir];W[er];B[eq];W[es];B[dr]C[黑棋巧妙成活。要马不停蹄地弃子。])(;B[hs]C[图2 失败（0分）]N[图2 失败（0分）];W[ks];B[gs]TR[hs]C[黑棋打吃、提子做活的想法是一相情愿];W[hr]C[白棋扑是手筋，黑棋不活。])(;B[fs]N[附图1]C[附图1黑棋单立是次序错误，在右边做不出一个眼来];W[is]LB[ks:a][js:b]C[白棋扳是要领，不能走 a、b 位，否则黑棋立下就还原成正解图。];B[gs]C[黑棋在右边没有眼。])(;B[eq]C[附图2黑棋扩大眼位]N[附图2];W[ks]LB[is:a]C[白棋冲，冷静，此时，黑已无暇于 a 位立。];B[gs];W[es]C[白棋破眼];B[hs];W[hr]C[白棋扑，黑被杀。]))",

		//wqqlzwcs_22_10.sgf
		"(;AB[br][bq][bp][co][cn][dn][en][fo][go][gp][hq][gq][iq][jr]AW[cr][cq][cp][do][eo][ep][fp][fr]TR[jr]C[（死活）黑先。在本题中，第一手棋的发现非常重要，而如何利用黑 K2 一子又是问题的关键。]SZ[19](;B[fs]N[图1 正解（10分）]C[图1 正解（10分）黑在底线托问白应手，非常巧妙];W[gr]C[白棋长];B[cs];W[ds];B[fq];W[eq];B[er]C[黑棋的次序很好];W[dr];B[gs]C[黑棋可吃住白棋。])(;B[fs]C[图2  变化一]N[图2  变化一];W[gr];B[cs];W[ds];B[fq];W[eq];B[er];W[gs]C[白棋拐下];B[dq]C[黑棋简单叫吃即可。])(;B[fs]C[图3  变化二]N[图3  变化二];W[gs]C[白棋打吃];B[gr]C[黑棋断];W[es];B[cs];W[ds];B[dq]C[白没有两眼。])(;B[dq]C[附图黑棋点是普通的感觉，那么究竟如何呢？](;W[eq]C[白棋紧夹，重要];B[dr];W[ds]C[进行至此，都是必然的应对];B[gr]C[黑棋挡下];W[fs]C[白棋立下即可];B[er];W[fq]C[双活。])(;W[eq];B[dr];W[ds];B[fs]C[黑棋现在托，已经晚了];W[gr];B[gs];W[hr];B[hs];W[is];B[ir];W[es]C[白棋做活。])))",
	],

	[

		//wqqlzwcs_23_1.sgf
		"(;AB[cc][dc][fc][oc][pc][qd][qf][qo][cf][dg][cq][cp][cn][fq][gp]AW[dp][eq][fp][fo][fr][ip][ce][dd][df][ef][cg][nc][nd][od]LB[hc:a][jd:b][og:c][cl:d]C[（布局）白先。白棋是先处理上边三子，还是脱先抢占左边的要点？请在 a、b、c、d 中选择。]SZ[19](;W[hc]C[图1 正解（10分）白棋拦，瞄着黑棋的弱点是正解]N[图1 正解（10分）];B[gd];W[hd];B[pq]TR[gd]C[黑棋先手尖出后，再于右下缔角];W[og]C[白棋可向中腹大跳，结果白棋充分。])(;W[jd]C[图2 白棋不满（8分）白棋拆三是遵循围棋基本原理的下法]N[图2 白棋不满（8分）];B[pq]C[黑在右下缔角];W[mq];B[ck]CR[mq]C[白在下边拆时，黑可抢占左边要点，结果白棋不满。])(;W[og]C[图3  方向错误（4分）白棋大跳是无视围棋基本原理的下法，方向明显错误。金角银边草肚皮。]N[图3  方向错误（4分）];B[ic]C[而黑拆二是好点。])(;W[cl]N[图4  黑棋满足（6分）]C[图4  黑棋满足（6分）白棋逼，瞄着黑棋的弱点，并极力扩张自己的左边];B[dm];W[dl]TR[dm]C[黑棋尖与白棋挡交换一手];B[jd]C[黑抢占上边大场，黑棋满意。]))",

		//wqqlzwcs_23_2.sgf
		"(;AW[bd][cd][dd][ed][fd][hc][gd][oq][qp][ql]AB[pd][qj][oj][dp][dj][cf][bc][cc][dc][fc][fb]LB[nc:a][ch:b][fq:c][ol:d]C[（布局）白先。白棋如何利用自身的厚势并保持局面的均势？请在 a、b、c、d 中选择。]SZ[19](;W[nc]N[图1  正解（10分）]C[图1  正解（10分）白棋挂角，在上边扩张是正解];B[pf];W[pb];B[qc];W[ld]TR[pf][qc]CR[pb][nc]C[黑如果补棋，则白将上边走强，然后白再去考虑以后的发展方向。])(;W[ch]N[图2  操之过急（4分）]C[图2  操之过急（4分）白在左边打入操之过急];B[dh]C[黑棋靠，取势];W[di];B[ei];W[ci];B[cj];W[dg];B[eh];W[cg];B[ej]C[黑棋构筑成厚势，可以满意。])(;W[fq]N[图3   黑棋满足（8分）]C[图3   黑棋满足（8分）];B[dn];W[ip]CR[fq]C[白在下边行棋，远离问题的焦点];B[mc]C[黑大飞不仅守住了右上角，而且限制了左上白势的发挥，黑棋可以满足。])(;W[ol]C[图4  闲棋（6分）白棋单跳几乎是一手闲棋]N[图4  闲棋（6分）];B[mc]C[黑大飞不仅守住了右上角，而且限制了左上白势的发挥，结果白棋不满。]))",

		//wqqlzwcs_23_3.sgf
		"(;AW[dc][dd][ch][eh][jc][pc][oc][nd][dm][co][dp][ep][eq][fp][fo][go][ho][in][jn][hl][gq][ip][jp][ml][nn][ok][pl][pm][pn][po][qo]AB[pd][qc][qb][pf][pi][qk][ql][qm][pq][qp][op][mp][oo][cj][ej][cl][bn][cn][dq][dr][er][fr][fq][gp][hp][hq][ir][kl][jm][kn][ln]LB[jd:a][lj:b][nj:c]C[（中盘）黑先。黑棋如何攻击右边的白棋是问题的关键。a、b、c 的攻法各有特点，a 位是声东击西，b 位和 c 位则是直接攻击。黑棋应该如何选择？]SZ[19](;B[jd]C[图1 正解（10分）黑棋靠问白应手是正解]N[图1 正解（10分）];W[ic]C[白棋如果长向这边……];B[ld]C[黑棋跳是连贯的下法];W[kd];B[ke];W[kc];B[mf]LB[lc:a][lj:b]C[以下 a 位和 b 位黑必得其一，白很难受。])(;B[jd]C[图2  变化图]N[图2  变化图];W[kc]TR[jd]C[黑棋靠时，白棋长向另一边];B[hd]C[黑棋则向另一侧跳];W[ic];B[gf]C[黑棋仍很充分。])(;B[lj]N[图3  黑棋不满（6分）]C[图3  黑棋不满（6分）黑棋直接攻击白棋];W[oi]C[白棋可以靠，进行处理];B[oh];W[pj];B[qj];W[ph];B[qi];W[ni]C[白棋可以轻松获得安定。])(;B[nj]N[图4  大同小异（6分）]C[图4  大同小异（6分）黑棋从另一边直接攻击白棋，结果同样不好];W[lk]C[白棋尖是很好的下法];B[jj];W[li];B[jh];W[lg]C[进行至此，黑棋很难再有攻击手段。]))",

		//wqqlzwcs_23_4.sgf
		"(;AB[cd][ec][lq][nq][oq][pq][qq][qk][ol][nd][od][qc][qd][qe]AW[dp][mp][np][op][pp][qp][qi][pj][mc][nc][oc][pc][ic]LB[nj:a][nk:b][ml:c][pk:d]C[（中盘）白先。白棋极欲以右下角的厚势为后盾强攻右边的黑棋二子，白棋最佳攻击法是什么？请在 a、b、c、d 中选择。]SZ[19](;W[nj]C[图1  白棋无谋（6分）白棋单跳是常识性的下法，此时显得无谋]N[图1  白棋无谋（6分）];B[ml]C[黑棋跳后，白很难再对黑棋实施攻击];W[lp];B[kq];W[lj];B[kl]C[进行至此，白棋不满。])(;W[nk]C[图2  正解（10分）由于有右下强大的外势策应，因此白棋飞封攻击黑棋是正解，]N[图2  正解（10分）];B[nl];W[ml]TR[nl]C[黑棋挺头时，白棋扳住是好棋];B[ok];W[oj];B[mk];W[nj];B[mm];W[ll]LB[lp:a]C[进行至此，黑棋陷入困境，而且 a 位也是白棋先手。])(;W[ml]N[图3  方向错误（6分）]C[图3  方向错误（6分）白棋镇攻击黑棋方向错误];B[nk];W[ni]C[白棋继续飞攻];B[mk];W[kl];B[kk]TR[mk]C[黑棋压、靠的处理手法可以成立。])(;W[pk]C[图4  最差点（4分）]N[图4  最差点（4分）];B[pl];W[ql]C[白棋断吃黑棋一子是典型的俗手];B[qm];W[rl];B[rm];W[rk];B[nm];W[pn];B[pm]C[黑棋整形后，到底谁攻谁还很难分清。]))",

		//wqqlzwcs_23_5.sgf
		"(;AW[ar][bq][cq][dq][dr][ep][fp][gq]AB[br][bp][cp][dp][dn][eo][gn][eq][er]C[（官子）黑先。黑棋如何利用角上黑棋一子进行收官？]SZ[19](;B[cs]N[图1 正解（10分）]C[图1 正解（10分）黑棋尖是官子手筋];W[cr]C[白棋只有打吃，无奈];B[bs];W[ds];B[ap];W[fr];B[aq];W[as];B[bs]C[白提去黑三子后，黑棋打吃，白二子已不能连回];W[es];B[br]C[黑棋收获很大。])(;B[cs]C[图2  变化图]N[图2  变化图];W[ds]TR[cs]C[黑棋尖时，白棋挡下无理];B[as]C[黑棋可以做劫。此劫对于白棋来说负担很大，而对黑棋来说则是无忧劫。])(;B[bs]N[附图  失败]C[附图  失败黑棋简单立下不行];W[es]C[白棋扳，吃住黑二子，角上没棋。]))",

		//wqqlzwcs_23_6.sgf
		"(;AB[br][bq][bo][cp][do][eo][fo][eq]AW[cr][dq][dp][ep][go][gp][gq][iq]C[（官子）黑先。黑棋如何下才能救回白阵中的黑棋一子？]SZ[19](;B[er]N[图1 正解（10分）]C[图1 正解（10分）黑棋单立是手筋];W[dr]C[白棋如果挡的话……];B[cs]C[黑棋在底线扳是绝妙的次序];W[ds]C[白棋挡……];B[fp]C[黑棋断，白棋被吃。])(;B[fp]N[图2 失败（0分）]C[图2 失败（0分）黑棋单冲是大恶手];W[fq];B[er];W[dr]C[没棋。])(;B[er]C[图3 变化图]N[图3 变化图];W[dr];B[cs];W[fr]C[进行至此，白棋最佳的防守方法是直接紧气吃黑二子。];B[ds];W[fq];B[es];W[fs];B[bs];W[fp]C[这是双方最佳进行，黑棋先手压缩白空。])(;B[ds]C[附图  失败黑棋点，缺乏深算]N[附图  失败];W[er];B[cs];W[es]C[与图3 相比，黑损。]))",

		//wqqlzwcs_23_7.sgf
		"(;AB[bq][dq][dp][co][bo][dn][en][fn][fp][go][gp][gq][iq]AW[dr][eq][fq][eo][ep][fo][do][gn][gm][cm][cn]C[（手筋）黑先。中腹的黑棋只有三口气，在此情形下，黑棋应该如何下？]SZ[19](;B[es]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是对杀的急所。所谓“黄鹰扑兔式”];W[gr];B[fs]CR[gr]C[白棋扳时，黑棋可以并，绝妙];W[gs];B[hr]C[白棋始终只有两气。])(;B[cr]C[图2 失败（0分）]N[图2 失败（0分）];W[gr]TR[cr]C[黑棋挡，白棋扳后可以长出一气];B[hr];W[dm]TR[hr]C[黑棋挡时，白直接紧气即可。])(;B[fs]N[图3 失败（0分）]C[图3 失败（0分）同样是在一路上点，本图黑棋点的位置错误];W[er]C[白棋简单接上即可在对杀中取胜利。]))",

		//wqqlzwcs_23_8.sgf
		"(;AB[bq][cq][dp][ep][eo][en][fq][gq][gr]AW[cp][co][dm][fm][fn][fo][fp][eq][dq][cr][fr]C[（手筋）黑先。黑棋以简单的方法紧气不行，如能做劫就是成功。]SZ[19](;B[cs]N[图1 正解（10分）]C[图1 正解（10分）黑棋夹是绝妙的手筋];W[br]C[白被迫长];B[dr];W[er];B[es]C[这样形成打劫。双方最善。])(;B[es]N[图2 失败（0分）]C[图2 失败（0分）黑棋点与气无关];W[dr]C[白棋简单接上即可。对杀黑棋气不够。4 气对 3 气，永远不够。];B[br];W[em])(;B[cs]C[图3 变化图]N[图3 变化图];W[ds]TR[cs]C[黑棋夹时，白打吃是大恶手];B[br];W[bs];B[er];W[dr];B[fs]C[白棋被杀。])(;B[cs]C[附图]N[附图];W[em]TR[cs]C[黑棋夹时，白棋直接紧气];B[dr];W[er];B[es]C[同样是打劫，白棋应该选择图1 的变化更为有利。]))",

		//wqqlzwcs_23_9.sgf
		"(;AW[cq][cp][co][dn][fn][fm][gl][im][in][jo][jp][jq][lq][fq][gq]AB[dp][fp][gp][gn][hn][hq][iq][ip][jn]C[（死活）黑先。黑棋要确保两只眼，必须经过精确的计算，只有充分利用周边的棋子才行。]SZ[19](;B[gr]C[图1 正解（10分）]N[图1 正解（10分）];W[fr];B[gs]TR[gr]C[黑棋扳、立，瞄着左右白棋的弱点];W[ir]C[白棋扳破眼];B[er];W[eq];B[dq]C[黑可吃住白数子而成活。])(;B[gr]C[图2  变化一]N[图2  变化一];W[fr];B[gs];W[dq]TR[gs]C[黑棋冷静立下时，白补棋];B[jr];W[kr];B[is]C[黑棋可做活。三眼两做。])(;B[gr]C[图2  变化二]N[图2  变化二];W[fr];B[gs];W[dq];B[jr];W[is]C[白棋点，强攻];B[ir];W[fs];B[io];W[hr];B[js];W[hs];B[kq];W[lp];B[lr]C[但黑棋可利用右侧白棋的弱点而有效处理。]))",

		//wqqlzwcs_23_10.sgf
		"(;AW[cp][do][dq][dr][en][go][ho][in][ip][jq][ir][ko][km]AB[er][eq][fp][gp][hp][hq][hr][io]C[（死活）黑先。黑棋如何利用右侧白棋的断点是关键。]SZ[19](;B[jr]C[图1 正解（10分）]N[图1 正解（10分）];W[kr];B[js]TR[jr]C[黑棋掖，然后下立是做活的必要次序];W[ks];B[hs]CR[ks]C[白棋打吃，黑棋立下先手利用];W[is];B[es]C[黑棋是板六的活形。])(;B[jr]C[图2 变化图]N[图2 变化图];W[kr];B[js];W[iq]C[白棋接];B[is]C[黑棋渡过是先手];W[lq];B[gr]C[黑棋团眼是做活的急所];W[fq];B[hs];W[fs];B[es];W[fr];B[ep]C[黑棋做活。])(;B[hs]N[图3 失败（0分）]C[图3 失败（0分）黑棋先立次序错误];W[es];B[jr];W[kr];B[js];W[iq]C[黑棋没有两只眼。]))",
	],

	[

		//wqqlzwcs_24_1.sgf
		"(;AW[dd][dp][dn][jc][qq][qp][qn][rn]AB[fq][jp][pq][po][pp][om][ql][pd]LB[cf:a][ci:b][cl:c][fo:d]C[（布局）黑先。黑棋是扩展自身还是进入左边？如果进入左边，最佳的位置又是什么？请在 a、b、c、d 中选择。]SZ[19](;B[cf]C[图1  正解（10分）黑棋挂是正解]N[图1  正解（10分）];W[fd]C[白棋一间跳应，普通];B[bd];W[cc];B[ci]C[黑棋在左边安定];W[ck];B[fo]CR[ck]C[白如在左边逼，黑可在下边单跳，黑棋好调。])(;B[ci]C[图2  黑棋不满（8分）黑棋分投过于平常]N[图2  黑棋不满（8分）];W[ck];B[cf];W[ce];B[df];W[fd];B[lc];W[ej]C[到此的进行都是可以预想的，下边黑势被自然侵消，黑棋不满。])(;B[cl]N[图3  操之过急（6分）]C[图3  操之过急（6分）黑棋逼攻左下白角，操之过急];W[ci]C[白棋夹，将黑棋赶向中腹是攻击要领];B[el];W[fn];B[gp];W[eq];B[gl];W[hn]C[白棋可以顺势牵制下边黑势，结果白棋好下。])(;B[fo]N[图4  白棋满足（6分）]C[图4  白棋满足（6分）黑棋跳，极力扩张下边的模样];W[dk]C[白棋搞拆二，诱使黑棋打入];B[cf];W[ce];B[df];W[fd];B[ci];W[bj];B[ei];W[fk]C[白棋在攻击黑棋的同时，可以侵消下边黑势，结果白棋满足。]))",

		//wqqlzwcs_24_2.sgf
		"(;AW[cd][ce][fc][dc][dp][cn][dr][qn][qf]AB[fq][jq][pq][cf][dg][de][ck][pd][qh]LB[ql:a][po:b][qp:c]C[（布局）黑先。面对白棋的大飞挂，黑棋应该如何应付？最有效的处理方法是什么请在 a、b、c 中选择。]SZ[19](;B[ql]C[图1  正解（10分）黑棋夹攻是正确的定式选择]N[图1  正解（10分）];W[qq];B[qp];W[pp];B[rq];W[qr];B[po];W[op];B[qo];W[rr];B[mp];W[no];B[pn];W[nq];B[mq];W[nr]CR[qf]C[黑棋先手处理右下角后，可抢先攻击右上角的白棋一子，结果黑棋有利。])(;B[ql]C[图2 变化图]N[图2 变化图];W[qq];B[pp]CR[qq]C[白棋托时，黑棋长不好];W[qp];B[po];W[rn];B[om]C[这样也是定式，但白棋却取得了宝贵的先手];W[qc]LB[rl:a]C[白棋抢占右上角，而右边的黑棋由于有 a 位的余味，价值并不大。])(;B[qp]N[图3  白棋满足（6分）]C[图3  白棋满足（6分）黑棋尖过于平常];W[of];B[nd];W[pi];B[ph];W[oh];B[qi];W[pj];B[qj];W[pk];B[ql];W[pl]C[白棋可以在中腹构成很厚的外势，结果白棋有利。])(;B[po]N[图4  白棋好调（6分）]C[图4  白棋好调（6分）黑棋肩冲仍然不能令人满意];W[rp];B[ql];W[pn];B[qo];W[ro];B[qq];W[nn];B[rm];W[rn];B[mp];W[pl];B[pk];W[ok];B[pj];W[qc]C[白棋抢先占据右上角，白棋好调。]))",

		//wqqlzwcs_24_3.sgf
		"(;AW[cr][cp][cq][cn][cm][fq][gp][hp][kp][kq][lr][mp][pp][pn][qq][qk][pd][oe][md][jd][hd][jg][de][db][cc][ec][ed][fe][ff][fg][ci]AB[dp][dr][eq][fp][fo][gq][dl][cl][em][kr][lq][mr][nq][np][no][pr][qd][qc][qf][ob][nc][lf][ji][hh][gf][ge][gd][fd][fc][eb][fa][gb][dc]LB[nd:a][ke:b][le:c][kf:d]C[（中盘）白先。白棋的实地并不落后，但如果上边的白棋处理得不好，白棋可能会很被动。白棋应该如何下？请在 a、b、c、d 中选择。]SZ[19](;W[nd]C[图1  白棋危险（4分）白棋连接是危险的下发]N[图1  白棋危险（4分）];B[ld];W[lc];B[kd];W[kc];B[mc]C[黑棋切断白棋的强手可以成立。白棋吃不住黑棋二子，面临巨大损失。])(;W[ke]C[图2  白受攻击（6分）白棋联络]N[图2  白受攻击（6分）];B[lh]C[黑棋跳，继续攻击];W[le];B[mf]C[白棋整条大龙都处于受攻的状态。])(;W[le]N[图3  正解（10分）]C[图3  正解（10分）白棋尖顶是最佳的处理方法];B[mf];W[kf];B[lh];W[me];B[nf];W[kb]C[白棋眼形充足，可以满足。])(;W[kf]N[图4  方向错误（6分）]C[图4  方向错误（6分）同样是尖顶，本图中白棋尖顶的方向错误];B[le];W[lg];B[mg];W[lh];B[ld]C[白棋右边三子几乎已被吃住。]))",

		//wqqlzwcs_24_4.sgf
		"(;AB[qd][oc][qh][pp][qn][dk][ej][ei][fk][fl][fm][gm][hm][im][hn][hp][ho][hq][io][eq][er][dr][cn][gj][cg][bg][ce][cd][dd][df][ec][eb][db][bb]AW[bc][cc][dc][ed][ee][ef][eg][eh][dg][ci][ch][gc][fj][fi][gl][gk][cr][dq][dp][co][bo][fp][iq][ip][jo][in][kn][jm][jl][il][ij][nq][qj][kd]LB[kf:a][le:b][oh:c]C[（中盘）黑先。黑棋应该如何侵消上边和中腹的白势？请在 a、b、c、d 中选择。]SZ[19](;B[kf]C[图1  最差点（4分）黑棋镇在感觉上似乎可以考虑]N[图1  最差点（4分）];W[nd]C[但白棋肩冲];B[od];W[nf]TR[kf]C[白棋跳，围攻，黑棋麻烦很大。因而黑棋镇是最差点。])(;B[le]C[图2  黑棋不满（8分）黑棋肩冲，其意图是在消白势的同时，伺机攻击右边的白一子]N[图2  黑棋不满（8分）];W[ke];B[lf];W[kf];B[lg];W[mc];B[nd]C[但进行至此，黑棋不可避免地成为后手];W[oj]C[结果黑棋不满。])(;B[oh]N[图3  这个正解（10分）]C[图3  这个正解（10分）黑棋单跳问白应手是正解];W[lh];B[pk]CR[lh]C[白棋如果围地，则黑可封住白一子。])(;B[oh]C[图4  变化图]N[图4  变化图];W[oj];B[mh]CR[oj]C[白棋跳，黑棋同样单跳就很好。黑棋不仅可以顺势侵消白势，而且还可伺机攻击右边白二子，结果黑棋充分。]))",

		//wqqlzwcs_24_5.sgf
		"(;AW[cq][bq][aq][dp][ep][fo][go][gp][gq][fq]AB[ap][bp][cp][do][eo][em][fn][gn][hn][hq][ho][hp][gr]SZ[19]C[（官子）黑先。黑棋的第一手棋虽很简单，但其后的进行却不简单。如何有效地利用白棋气紧的弱点是关键。](;B[er]N[图1 正解（10分）]C[图1 正解（10分）黑棋跳入是很多人都能考虑到的一手];W[fr];B[eq]CR[fr]C[但白棋冲下时，黑棋挤的手段却不容易发现];W[dq];B[fs];W[fp];B[hr];W[ds];B[es];W[dr];B[gs];W[bs]C[这是双方最佳进行。白地 5 目，黑先手。])(;B[dr]N[图2 失败（0分）]C[图2 失败（0分）黑棋点方看似可以考虑];W[er]C[但白棋虎后，其后黑棋的任何手段都不能成立。])(;B[er]C[附图  黑后手]N[附图  黑后手];W[fr];B[fs]LB[dq:a]C[黑棋直接渡为什么不好？以下，白棋走在 a 位就还原为图1。];W[eq];B[dr];W[dq]C[白棋只能接上];B[hr];W[cr];B[gs];W[cs];B[es]C[白地 5 目，但黑是后手。先手还是后手差别太大。]))",

		//wqqlzwcs_24_6.sgf
		"(;AW[cq][dq][er][fr][gs][hr][hq][jq][jr]AB[cp][dp][eq][fq][gq][gr][hp][ip][jp][kp][lq][lr]C[（官子）黑先。黑棋如果仅仅满足于二路扳粘，不能令人满意。如能正确利用对方气紧的弱点，大部分白子都将被黑棋吃掉。]SZ[19](;B[dr]N[图1 正解（10分）]C[图1 正解（10分）黑棋断是手筋];W[cr]C[白棋打吃，绝对];B[ds]C[黑棋立下是连贯的手法。];W[fs]C[白棋粘，顽抗];B[br]C[黑棋夹又是手筋];W[bq];B[cs]C[白棋全部被吃。])(;B[dr]C[图2 白被杀]N[图2 白被杀];W[cr];B[ds];W[cs]C[白棋打吃];B[bq];W[br];B[ar];W[es];B[bp]C[白棋依然做不出两只眼。])(;B[dr]C[图3  双方最佳进行]N[图3  双方最佳进行];W[cr];B[ds];W[bp]C[白棋扳];B[fs]C[黑棋扑];W[bo]C[白长出，这是双方最佳进行。]))",

		//wqqlzwcs_24_7.sgf
		"(;AB[cr][cq][dr][eq][ep][eo][dn][bn][bm]AW[bp][cp][dp][dq][er][fr][hq]C[（手筋）黑先。黑棋在角上的处理方式不同，双方对杀的结果也大不相同。]SZ[19](;B[ar]N[图1  正解（10分）]C[图1  正解（10分）黑棋单跳是对杀手筋];W[bq];B[br];W[ds];B[bo]C[对杀黑棋快一气。])(;B[bq]C[图2  失败（0分）]N[图2  失败（0分）];W[ap]TR[bq]C[黑棋挡时，白棋立下是急所];B[aq];W[ds];B[bo];W[ar]C[黑棋气不够。])(;B[bq]C[图3  失败（0分）]N[图3  失败（0分）];W[ap];B[es]C[黑棋扳];W[fs];B[cs]C[黑棋做劫];W[ar];B[aq];W[bs];B[co]C[黑棋只能和对方打缓气劫。大失败。]))",

		//wqqlzwcs_24_8.sgf
		"(;AB[br][cr][cq][dp][do][dn][dl][cl][cj]AW[bq][bp][cp][co][dq][ep][er][fq]C[（手筋）黑先。黑棋利用角的特殊性进行对杀的手筋是什么？]SZ[19](;B[ar]C[图1  正解（10分）黑棋立是对杀的急所]N[图1  正解（10分）];W[bn];B[ao]CR[bn]C[白棋尖时，黑棋点是连贯的好手];W[bl];B[bk];W[bm];B[aq];W[ap];B[cn];W[bo];B[al]C[对杀黑胜。])(;B[aq]N[图2  失败（0分）]C[图2  失败（0分）黑棋扳];W[ar]C[白棋扑];B[as];W[ap]C[双方下成打劫，黑棋失败。])(;B[dr]N[图3  失败（0分）]C[图3  失败（0分）黑棋打吃同样是没有意义的下发];W[ar]C[白棋扳，双方又形成打劫。]))",

		//wqqlzwcs_24_9.sgf
		"(;AB[ds][dr][eq][ep][fp][dp][bp]AW[bo][cn][eo][fo][go][gp][fq][er][es][gr][cq]CR[cq]C[（死活）黑先。白 C3 一子的位置很要命，从黑棋的棋形来看，好象活的希望不大，但是黑棋却有非常的做活手段。请问该如何下？]SZ[19](;B[cp]N[图1  正解（10分）]C[图1  正解（10分）黑棋接是绝对的一手];W[bq];B[ar]CR[bq]C[白棋下贴时，黑棋点绝妙];W[dq];B[bs]C[黑棋可活。])(;B[cp]C[图2  变化图]N[图2  变化图];W[cr];B[dq];W[bq];B[ar]C[黑棋点同样是急所，黑棋可活。])(;B[cp]C[图3  黑棋失败（0分）]N[图3  黑棋失败（0分）];W[bq];B[aq]C[黑棋扳，错误];W[ar];B[ap];W[cr]C[黑棋被杀。]))",

		//wqqlzwcs_24_10.sgf
		"(;AW[cr][cq][ds][er][co][do][dp][cm][en][fn][ho][hp][hq][hr]AB[cp][dq][dr][eq][ep][eo][fq][fr][gq][gp]TR[cp]C[（死活）黑先。黑棋上下都只有后手一只眼。黑棋如何利用黑 C4 一子做活？]SZ[19](;B[bp]C[图1  正解图（10分）]N[图1  正解图（10分）];W[bq];B[bs]TR[bp]C[黑棋长、点是绝妙的次序];W[fo]C[白棋如果破眼];B[ar]C[黑棋尖是好棋];W[bo];B[cs];W[ap];B[br]C[黑棋成功做活。])(;B[bp]C[图2  变化图]N[图2  变化图];W[bo];B[bs];W[br]TR[bs]C[黑棋点时，白棋曲进行抵抗];B[fo];W[es];B[cs]C[黑棋同样可活。])(;B[bp]C[图3  黑棋失败（0分）]N[图3  黑棋失败（0分）];W[bq];B[ar]C[黑棋点的位置不对];W[ap];B[bs];W[cs]C[黑棋不活。]))",
	],

	[

		//wqqlzwcs_25_1.sgf
		"(;AB[oq][qp][pd][bq][cq][dq][bp][fq][cn][bb][cb][cc][dd][ed][ec][ee][cf]AW[bc][cd][ce][de][df][ef][fe][dc][ch][bo][co][dp][cp][ep][cl][qj]LB[gc:a][qf:b][fp:c][go:d]C[（布局）白先。在布局阶段，黑棋的实地已处于领先地位，白棋应该如何下才能维持局面的平衡？请在 a、b、c、d 中选择。]SZ[19](;W[gc]C[图1 闲棋（4分）白飞封几乎是一手闲棋]N[图1 闲棋（4分）];B[ql];W[qf];B[qh];W[of];B[nc];W[pi];B[qe];W[rf];B[fp]C[黑棋先手处理右边后，抢占下边要点，局势黑棋有利。])(;W[qf]C[图2  方向错误（6分）白棋挂是方向错误]N[图2  方向错误（6分）];B[nc];W[rd];B[qc];W[ph]C[白棋虽可在右边下得很厚，但要落后手];B[fp]C[黑棋抢占下边要点之后，白棋不满。];W[fo];B[go];W[fn];B[gn])(;W[fp]C[图3  白棋不满（8分）]N[图3  白棋不满（8分）];B[gq];W[gp];B[hp];W[ho]C[白棋连压、扳，极力扩张左边];B[io];W[eq];B[er];W[dr];B[fr];W[ip];B[hq];W[hn];B[jo];W[jm]C[但黑棋下边也顺势走厚，因此白棋稍损。白棋过于偏重于左边，难以满意。])(;W[go]N[图4  正解（10分）]C[图4  正解（10分）白棋飞是正解];B[ql]C[黑棋如果在右边拆逼];W[gq]C[白棋先手利用很舒服];B[fr];W[qf]C[然后白再挂角，白棋充分可下。]))",

		//wqqlzwcs_25_2.sgf
		"(;AW[dd][oc][po][pn][qn]AB[qd][qo][qp][pq][nq][dp]LB[pf:a][qf:b][qg:c][qj:d]C[（布局）白先。考虑到右下角的白棋三子，白棋如何以最有效的方法进行定型？请在 a、b、c、d 中选择。]SZ[19](;W[pf]N[图1  白棋不满（6分）]LB[od:a]C[图1  白棋不满（6分）白棋走大斜，其意是诱使黑棋 a 位靠，进而与黑棋厮杀];B[pe]C[但黑棋尖是冷静的下法];W[oe];B[qf];W[pg];B[qg];W[ph];B[qh];W[pi];B[qj]C[结果黑棋不错。])(;W[qf]N[图2  白棋过激（6分）]C[图2  白棋过激（6分）白棋攻击角上黑子，进而处理右边，大方向是正确的，但一间夹是过激的下法];B[od];W[nd];B[oe];W[pc];B[qe];W[qc];B[qh]C[黑棋整形后，反击恰到好处。])(;W[qg]N[图3  正解（10分）]C[图3  正解（10分）白二间夹是正解];B[pe];W[pj]TR[pe]C[黑棋尖出时，白大飞展开，将右边变成自己的势力范围是很好的下法];B[lc];W[oe]TR[lc]C[黑棋夹击时，白靠出可以充分处理。])(;W[qj]N[图4  平常下法（8分）]C[图4  平常下法（8分）白棋拆是平常的下法];B[pe];W[md];B[pc];W[od];B[qh]C[但黑棋定型之后，白棋不能满意。]))",

		//wqqlzwcs_25_3.sgf
		"(;AB[dc][db][eb][fc][gb][gd][hd][pd][dq][eq][fp][iq][op][pp][qp][qo][ro][ql]AW[cc][dd][ed][ec][fd][fe][ge][cj][cq][cp][ep][eo][nq][pq][qq][rq][rp][qn]LB[ej:a][gj:b][pf:c]C[（中盘）黑先。在本题中，黑棋是选择扩张自身还是侵消左边的白势？请在 a、b、c 中选择。]SZ[19](;B[ej]N[图1  正解（10分）]C[图1  正解（10分）黑棋镇是正确的侵消方法];W[gj]C[白棋如果攻击黑棋……];B[el];W[cl];B[eh]LB[ci:a][gi:b][gk:c]C[黑棋可以两跳进行处理。其后，黑棋有 a、b、c 三点可下。])(;B[ej]C[图2  变化图]N[图2  变化图];W[dl]C[黑棋镇时，白在下边补棋];B[el];W[dm]C[黑棋与白交换一手];B[hk]C[然后黑棋大飞是轻快的手法。白棋外势非常强大时，黑棋如此轻快的下法是可行的。])(;B[gj]N[图3  白棋满足（6分）]C[图3  白棋满足（6分）黑棋侵消太浅，对白棋的影响不大];W[ej]C[白补棋后，白在左边已走强。])(;B[pf]N[图4  黑棋不满（8分）]C[图4  黑棋不满（8分）黑棋守角无疑是好点];W[ej]C[但被白占据要点之后，黑棋不能满意];B[if]C[此处是双方消长的形势要点];W[ob];B[pc];W[lc]C[但白棋在上边的打入手段可以成立，黑棋难成大空。]))",

		//wqqlzwcs_25_4.sgf
		"(;AB[dd][jc][pd][pj][dp][fp][lq][np][op][pp][qp]AW[cj][cn][mp][nq][nr][pq][qq][rq]LB[mn:a][mo:b][mq:c]C[（中盘）黑先。本题是让四子棋中出现的棋形。黑棋现在应该如何下才能主动地控制局面？请在 a、b、c 中选择。]SZ[19](;B[mn]C[图1  正解（10分）黑棋将右边的模样立体化是正解]N[图1  正解（10分）];W[mo]C[白棋如果挺头……];B[ln]C[黑棋长是连贯的行为];W[no];B[nn];W[oo];B[pm]C[黑棋利用弃子整形是很好的设想。])(;B[mn]C[图2  变化图]N[图2  变化图];W[lp]C[白棋压寻求变化];B[kp];W[kq];B[jq];W[kr];B[jp]C[黑棋充分可下。])(;B[mo]C[图3  黑棋不满（6分）同样是弃子，本图中黑棋扳不好]N[图3  黑棋不满（6分）];W[lp]C[白棋长后，白棋形很厚，而黑棋的外势由于仍有弱点，因而无法满意。])(;B[mq]N[图4  黑棋难战（6分）]C[图4  黑棋难战（6分）黑棋断，准备与白棋作战];W[mo];B[jp];W[on];B[qn];W[pk]C[到此都是可以预想的进行，黑棋战斗困难。因此黑棋以选择图1 那样简明的处理为好。]))",

		//wqqlzwcs_25_5.sgf
		"(;AB[bs][br][bq][cp][co][eo][do][fn][go][io][hp][iq][is][ir][er][eq]AW[cs][cr][cq][dp][ep][gp][fp][fq][fr][hq][hr]C[（官子）黑先。黑棋如何利用已被白吃住的黑二子进行收官？第一手棋是成败的关键。]SZ[19](;B[fs]N[图1 正解（10分）]C[图1 正解（10分）黑棋扳是手筋];W[gs];B[es];W[dq];B[gr];W[gq];B[hs];W[gr]C[这里形成共活，打劫白棋负担太重。白地 1 目，黑无目。黑先手。])(;B[es]C[图2 失败（0分）]N[图2 失败（0分）];W[dq]TR[es]C[黑棋单立，白棋粘即可];B[hs];W[gr]C[黑棋没有收获。])(;B[fs]C[图3 变化图]N[图3 变化图];W[es]TR[fs]C[黑棋扳，白棋扑];B[ds];W[dq]C[然后白棋粘，准备吃黑棋的接不归];B[hs];W[dr];B[gr]C[右侧白棋二子被吃，白棋仍然不行。白地 6 目半，黑地 4 目，白是先手。白棋应该选择此图。]))",

		//wqqlzwcs_25_6.sgf
		"(;AW[cs][cr][dq][eq][fp][fo][gq][gr][hq][hp]AB[br][bp][cq][dp][ep][en][fn][gn][ho][ip][iq][ir][hr]C[（官子）黑先。倒扑和渡过都是围棋的基本手法，黑棋应该如何下才能让白棋只能 2 目做活？]SZ[19](;B[es]N[图1  正解（10分）]C[图1  正解（10分）黑棋点是官子手筋];W[er]C[白棋顶是最佳防守];B[gs];W[fr];B[fs];W[go]C[白棋只能成两目空。])(;B[gs]C[图2  失败（0分）]N[图2  失败（0分）];W[fs];B[hs];W[er]C[黑棋简单扳粘的下法当然不能令人满意，与图1差别很大。白地 5 目。])(;B[es]C[图3 变化图]N[图3 变化图];W[fs]C[白棋尖阻渡无理];B[fr];W[gs];B[dr]C[白棋大损。]))",

		//wqqlzwcs_25_7.sgf
		"(;AB[bq][cq][dq][dr][fq][fr][gq][fo][eo][dn][cn][bm][cl]AW[bp][bo][bn][cp][dp][ep][eq][er][es]C[（手筋）黑先。黑棋如欲在对杀中取胜，必须在角上长出几口气来。黑棋应该如何下？]SZ[19](;B[ar]N[图1 正解（10分）]C[图1 正解（10分）黑棋尖，利用角的特殊性是手筋。做大眼长气];W[bs];B[ds];W[ap];B[aq]C[对杀黑棋快一气。白 6 气，黑 7 气（刀五 8 气，减去 1 气）])(;B[ds]N[图2 失败（0分）]C[图2 失败（0分）黑棋简单地挡要失败];W[ar]C[白棋点是急所];B[aq];W[br]C[黑棋被杀。])(;B[bs]N[图3 失败（0分）]C[图3 失败（0分）黑棋单跳同样不能长气];W[ar];B[aq];W[ds];B[cs];W[br]C[黑棋被杀。]))",

		//wqqlzwcs_25_8.sgf
		"(;AW[bp][cp][cq][cr][do][eo][fp][fq]AB[dp][dq][dr][co][bo][cm][dn]C[（手筋）黑先。目前黑棋三子只有四气，但黑棋如能下出手筋，可以下成打劫。请问该如何下？]SZ[19](;B[br]C[图1 正解（10分）黑棋夹是顽强的抵抗手段]N[图1 正解（10分）];W[bs];B[aq]CR[bs]C[白棋扳阻渡时，黑棋尖是连贯的手段];W[ap];B[ds];W[cs];B[ao];W[er];B[as]C[这样成为劫杀。])(;B[bs]N[图2 失败（0分）]C[图2 失败（0分）黑棋点不行];W[br];B[cs];W[er];B[aq];W[ar];B[ap];W[eq]C[对杀黑棋气不够。])(;B[ar]N[图3 失败（0分）]C[图3 失败（0分）黑棋点这里与对杀无关];W[ds];B[es];W[cs]C[白棋扳粘之后，黑棋明显不行。]))",

		//wqqlzwcs_25_9.sgf
		"(;AB[bs][br][cq][bp][dp][eo][fo][go][gp][io][jo][iq][jq][jr][js]AW[cr][dr][eq][ep][gq][gr][gs][ir][is]SZ[19]C[（死活）黑先。黑棋如欲吃住白棋，应该从何处着手？白棋在右侧有一只后手眼，因此黑棋应该留意。](;B[er]C[图1 正解（10分）黑棋嵌入是死活的急所]N[图1 正解（10分）];W[es]C[白棋打吃];B[fr];W[fs];B[dq];W[fq];B[er]C[黑棋扑，白棋不活。])(;B[er]C[图2 变化图]N[图2 变化图];W[fr]C[白棋换方向打吃];B[es];W[ds];B[dq];W[fs];B[er]C[黑棋仍可吃住白棋。])(;B[hr]C[图3 失败（0分）黑棋打，缺乏计算]N[图3 失败（0分）];W[hs];B[hq];W[fr]C[白棋可轻松做活。]))",

		//wqqlzwcs_25_10.sgf
		"(;AB[br][bq][cq][co][dn][fn][fp][gq][hq][iq][jq][jr][js]AW[cr][dq][eq][fq][gr][ir][hr][is]C[（死活）黑先。黑棋只有经过正确的计算才能吃住白棋，如果下成打劫或共活都将是黑棋的失败。]SZ[19](;B[fs]C[图1  正解（10分）黑棋点是急所]N[图1  正解（10分）];W[fr];B[dr]CR[fr]C[白棋粘，黑棋断吃即可。白被杀。])(;B[es]N[图2  失败（0分）]C[图2  失败（0分）黑棋点，似乎是点在急所上];W[ds];B[gs];W[fr];B[fs];W[dr]C[但进行至此，形成共活，黑棋失败。])(;B[fs]C[图3 变化图]N[图3 变化图];W[es]TR[fs]C[黑棋点时，白棋靠进行抵抗];B[gs]C[黑棋爬进是好棋];W[fr];B[dr]C[白不活。]))",
	],

	[

		//wqqlzwcs_26_1.sgf
		"(;AB[pd][pl][pq][po][cq][dq][fq][cn][dm]AW[dd][dn][en][cm][co][dp][lq][qo]LB[hq:a][iq:b][pn:c][pp:d]C[（布局）白先。白棋应以什么方法来处理其右下角和下边的白子？请在 a、b、c、d 中选择。]SZ[19](;W[hq]C[图1  正解（10分）白棋逼攻，最大限度地利用黑的弱点是正解]N[图1  正解（10分）];B[gp];W[hp];B[go]C[黑棋向中腹出头];W[pp]C[白棋再处理右边];B[op];W[qp];B[qq];W[pm];B[oo];W[qm];B[om];W[rk]C[白棋的行棋次序是常用的。结果白棋舒服。])(;W[iq]C[图2  白棋不满（8分）白棋拆二是最平常的下法]N[图2  白棋不满（8分）];B[qp]C[但黑棋虎，制住白棋一子，白棋不满。])(;W[pn]N[图3 方向错误（6分）]C[图3 方向错误（6分）白棋暂且不顾下边，而是先处理右边一子是方向错误];B[oo];W[qp];B[qq];W[pm];B[ol];W[ql];B[qk];W[rm];B[rl];W[qm];B[rk]C[白棋虽然在一定程度上得以处理，但有点生不如死的味道。])(;W[pp]N[图4 大同小异（6分）]C[图4 大同小异（6分）白棋挖的处理方法和图3 大同小异];B[op];W[qp];B[qq];W[pm];B[oo];W[qm];B[om];W[rk];B[jq]C[白棋虽处理好右边，但黑棋夹攻后，黑可主导大势。]))",

		//wqqlzwcs_26_2.sgf
		"(;AB[pp][pd][cn][ed][fc][gc][gd][ge][gf][gg]AW[cd][dc][ec][fd][fe][ff][fg][fh][dp][fb]LB[hi:a][ck:b][fp:c][fq:d]SZ[19]C[（布局）黑先。目前黑棋的最佳下法是什么？请在 a、b、c、d 中选择。](;B[hi]C[图1  方向错误（4分）黑棋飞在普通情况下，是外势扩张的要点]N[图1  方向错误（4分）];W[cl]TR[hi]C[但白棋夹击是绝好点，从而黑棋 H11 的飞成为疑问手];B[cq];W[cp];B[dq];W[ep];B[bp];W[bo];B[bq];W[co];B[fq];W[gb];B[ic];W[qf]CR[gb]C[白棋抢占了爬和挂角的要点后，黑棋不利。])(;B[ck]C[图2  正解（10分）黑棋拆二牵制白棋的外势是正解]N[图2  正解（10分）];W[co];B[dn];W[fp];B[ch]C[结果黑棋有利。])(;B[fp]N[图3  白棋满足（6分）]C[图3  白棋满足（6分）黑棋夹攻白棋角上一子];W[dn];B[dm];W[en];B[co];W[ep];B[bq];W[ck]C[经过定式化的次序后，白棋逼是绝好点，结果白棋满足。])(;B[fq]N[图4  大同小异（6分）]C[图4  大同小异（6分）黑棋双飞燕，结果与图3 大同小异];W[eo]C[此时白棋尖是好棋];B[cq];W[dm];B[dq];W[cm]C[白棋占取的左边很大，结果白棋好下。]))",

		//wqqlzwcs_26_3.sgf
		"(;AB[dd][dj][dp][eq][dn][jc][jp][kp][lp][mp][mq][nq][oo][jn][pe][pg][qg][rf][of][nf][nh]AW[fq][fp][ip][hp][jq][kq][lq][mo][pq][qo][qm][jl][gm][ie][oe][od][pc][qe][qf][pf][re]LB[df:a][hd:b][je:c]SZ[19]C[（中盘）黑先。白棋在上边侵消黑阵时，黑棋如何决定下一手棋？请在 a、b、c 中选择。](;B[df]N[图1  正解（10分）]C[图1  正解（10分）黑在左上角补棋是正解];W[ic]C[白棋靠下];B[ib];W[hc];B[hb];W[gc];B[jd];W[gf];B[fr];W[gr];B[cj]C[黑棋取得先手后，再在边上并，可以确保左边实地。])(;B[df]C[图2 变化图]N[图2 变化图];W[hd]C[白棋尖];B[ld]C[黑棋飞则是很好的下法];W[me]C[白棋单跳虽是棋形的急所……];B[md];W[ne];B[kf]C[但黑棋整形后，可伺机攻击上边白棋二子，结果黑棋舒服。])(;B[hd]N[图3  黑棋无谋（6分）]C[图3  黑棋无谋（6分）黑棋飞补无谋];W[cc]C[白棋立即点三三，使黑棋重复];B[cd];W[dc];B[ec];W[eb];B[fc];W[bd];B[be];W[bc];B[cf]C[白棋可以满足。])(;B[je]N[图4  最强攻击（6分）]C[图4  最强攻击（6分）黑棋靠];W[jf];B[if]C[黑棋断是周围黑棋强大时可以考虑的强攻方法，但在本题中并不适用];W[jd];B[ke];W[id];B[kd];W[gd]LB[df:a][kc:b]C[白棋拆一后，a、b 两点白棋必得其一，因而黑棋的攻击收效不大。]))",

		//wqqlzwcs_26_4.sgf
		"(;AW[dc][ce][jq][qj][mq][nq][oq][pp][qp][qn][ro]AB[nr][or][pq][qq][rq][rp][oc][qd][jc][cp][eq][cj]LB[je:a][oe:b][pf:c]C[（中盘）白先。白棋如何在牵制黑势的同时扩张自身？请在 a、b、c 中选择。]SZ[19](;W[je]N[图1  黑棋好调（6分）]C[图1  黑棋好调（6分）白棋镇是感觉错误];B[pg]C[黑棋斜拆是牵制白棋的绝好点];W[ni]C[白棋大飞扩张];B[in]C[黑棋侵消白阵，黑棋好调。])(;W[oe]N[图2  黑棋满足（6分）]C[图2  黑棋满足（6分）白棋镇，看似是棋形的急所];B[pf]C[但黑棋飞是好棋，结果白棋不好];W[nc]C[白棋靠虽是常用手法……];B[pc]C[但黑棋单退又是很好的应法];W[lc];B[gc]C[结果黑棋有利。])(;W[oe]C[图3  变化图]N[图3  变化图];B[pf];W[nc];B[nb]CR[nc]C[白棋靠下时，黑棋扳不好];W[ob]C[白棋断是常用的腾挪手法];B[pb];W[od];B[pc];W[mb];B[oa];W[hc]C[白棋争得先手后，在上边夹击，白棋反而有利。])(;W[pf]N[图4  正解（10分）]C[图4  正解（10分）白棋走此点扩张白势是正解];B[nf]C[其后黑棋如果飞镇……];W[ne]C[白棋搭又是正确的下法];B[oe];W[of];B[me];W[nd];B[od];W[ng];B[mf];W[mg]C[进行至此，白棋可以继续构筑外势。]))",

		//wqqlzwcs_26_5.sgf
		"(;AW[aq][bq][cq][cp][dp][eq][er]AB[ap][bp][co][bn][do][ep][fo][fq][fr]SZ[19]C[（官子）黑先。黑棋如何下才能最有效地压缩白角的目数？如果单在一路扳粘，白棋可成空 7 目。](;B[ds]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是最大限度压缩白空的官子手筋];W[dr];B[es];W[cs];B[fs]LB[bs:a]C[进行至此，白可脱先，黑棋走位是后手 5 目的官子。];W[br]C[黑棋先手收官。])(;B[ds]C[图2 变化一]N[图2 变化一];W[es]TR[ds]C[黑棋点时，白棋立下无理];B[cr]C[黑棋尖十分严厉];W[br]C[白棋挡];B[fs];W[dq];B[bs]C[白棋劫活，完全不能接受。])(;B[ds]C[图3 变化二]N[图3 变化二];W[es];B[cr];W[bs]C[白棋跳下可以避免打劫];B[fs];W[dq];B[br];W[ar]C[白棋后手做活，因此图1 是白棋的最佳选择。])(;B[dr]C[附图 黑棋失败黑棋夹，缺乏计算]N[附图 黑棋失败];W[ds];B[cr];W[br]C[黑棋一无所获。]))",

		//wqqlzwcs_26_6.sgf
		"(;AB[ap][ao][bo][co][do][ep][fp][gp][hq][hr][hs][dq]AW[aq][bp][cp][dp][br][eq][er][fq][gr][fs]C[（官子）黑先。白棋的棋形虽然不错，但只要能充分利用已被吃住的一个黑子，黑棋可以大幅压缩白空。]SZ[19](;B[cr]N[图1 正解（10分）]C[图1 正解（10分）黑棋尖是利用角的特殊性进行收官的手筋];W[dr]C[白棋打吃，绝对];B[bs]C[黑棋扳是连贯的好棋];W[cq];B[ar]C[黑棋抛劫，双方打劫。];W[cs]C[其后，如果白棋提子……];B[bq]C[黑棋也提子];W[as];B[aq]C[这样双方告一段落。白棋粘后，白地 8 目（提 3 子 5 目 + 3 目地）。])(;B[dr]N[图2 失败（0分）]C[图2 失败（0分）黑棋贴长缺乏计算];W[cr]C[白棋顶即可，黑棋已无任何手段];B[gq];W[gs]C[白棋的实空扩大大为 13 目。]))",

		//wqqlzwcs_26_7.sgf
		"(;AB[cr][cq][dq][ep][fp][go][gq][gr][jq][kq]AW[dr][er][fr][fq][gp][hp][iq]C[（手筋）黑先。在本题中，黑棋取得对杀胜利的手筋是什么？]SZ[19](;B[hs]C[图1 正解（10分）黑棋尖是绝妙的手筋]N[图1 正解（10分）];W[ir]C[白棋立下阻止黑棋联络];B[jr];W[is];B[ip]C[黑棋挤的手段可以成立。])(;B[ir]N[图2 失败（0分）]C[图2 失败（0分）如果是实战，黑棋扳的下法很容易出现];W[hr]C[但白棋挖后，黑棋缺乏应手。];B[hs];W[hq]C[黑棋失败。])(;B[jr]N[图3 失败（0分）]C[图3 失败（0分）黑棋立下远离问题的焦点];W[hr];B[gs];W[hq];B[ds];W[ho]C[白棋成功逸出，还捕获了黑棋三子。])(;B[hs]C[附图]N[附图];W[hr];B[js]CR[hr]C[白棋夹时，黑棋跳即可。白四子被吃。]))",

		//wqqlzwcs_26_8.sgf
		"(;AB[dr][dq][dp][cn][gp][gq][hr][iq][hn]AW[er][eq][fq][fo][fp][gr][dn][cm]CR[cm]C[（手筋）黑先。白棋扳时，黑棋如何在对方安定之前占取便宜？]SZ[19](;B[en]N[图1 正解（10分）]C[图1 正解（10分）黑棋搭是不给白棋任何机会的攻击手段];W[eo]C[白棋只好连接];B[dm]C[黑棋打。很难想到从外面打！];W[do];B[co]C[白棋困难。])(;B[co]N[图2 失败（0分）]C[图2 失败（0分）黑棋单退是缓手];W[fm]C[白棋跳，黑棋已不能有效攻击白棋。])(;B[dm]N[图3 失败（0分）]C[图3 失败（0分）黑棋断，看似手筋];W[en]C[白棋退是稳健的好手];B[co];W[dl]C[本图的结果与图1 相比，简直是天壤之别。]))",

		//wqqlzwcs_26_9.sgf
		"(;AW[bq][bp][cq][dq][eq][ds]AB[br][er][fq][gp][ep][dp][co][bo]LB[fr:a]C[（死活）黑先。a 位明显是黑棋的弱点，但黑棋不能因此放弃对白棋的进攻，如能下成打劫也是黑棋的成功。]SZ[19](;B[ap]N[图1 正解（10分）]C[图1 正解（10分）黑棋扳];W[ar]C[白棋扳，绝对];B[cs]C[黑棋尖很巧妙];W[bs]C[白棋只有扑劫，打劫是正解。])(;B[ap]C[图2 变化图]N[图2 变化图];W[ar];B[cs];W[fr]C[白棋断];B[gr]TR[cs]LB[fs:a]C[黑棋打吃时，白棋不能在 a 位立下];W[cr];B[bs];W[as];B[fs]C[白死。])(;B[ap]C[图3 失败（0分）]N[图3 失败（0分）];W[ar];B[bs]C[黑棋立错误];W[fr]C[白棋可断];B[gr];W[fs];B[gs];W[es]C[白棋成功做活。])(;B[cs]N[附图 黑棋失败]C[附图 黑棋失败黑棋单尖如何？];W[dr]C[白棋接，冷静];B[fr];W[ap]C[白立下扩大眼位];B[as];W[ar]C[白循环劫活。]))",

		//wqqlzwcs_26_10.sgf
		"(;AB[as][ar][br][bp][cq][dp][do][fp][gp][hp][ip][iq][ir][kr]AW[bs][cr][dr][dq][fq][gq][hq][hr]C[（死活）白先。在本题中，白棋看似可以轻松做活，其实不然。只有计算精确，方能解决问题。此题不难，训练计算能力的好题。]SZ[19](;W[gs]N[图1 正解（10分）]C[图1 正解（10分）白棋虎具有弹性，是死活的急所];B[fr]C[黑棋点，破眼];W[cs]C[白棋接上，扩大眼位];B[er];W[eq];B[es];W[fs];W[eq]C[共活。])(;W[fs]N[图2 失败（0分）]C[图2 失败（0分）白棋跳看似急所];B[cs]C[黑棋提子，冷静];W[hs];B[ds]C[白棋没有两眼。])(;W[cs]N[图3 白棋失败（0分）]C[图3 白棋失败（0分）白棋接，扩大眼位];B[gs]C[黑棋点是急所];W[hs]C[白棋必挡];B[fr];W[es];B[eq];W[er];B[ep]C[白死。]))",
	],

	[

		//wqqlzwcs_27_1.sgf
		"(;AW[dd][rs][rr][qq][qp][rp][rn][qn][ip][lp][nq][fp][fo][eq][dp][fr]AB[pd][qe][mc][qm][ql][rm][pn][po][pp][pq][pr][qr][cq][cp][cn][fq]LB[id:a][cl:b][mm:c][om:d]C[（布局）白先。右边黑势非常强大，对此白棋如何侵消？请在 a、b、c、d 中选择。]SZ[19](;W[id]N[图1 最差点（4分）]C[图1 最差点（4分）白在上边拆，虽可间接牵制黑势，……];B[mm]C[但黑棋扩张后，白棋被迫在右边打入是其面临的苦闷];W[pf]C[白棋肩冲是常见的侵消手段];B[qf];W[ph];B[nh];W[nf];B[lf]C[白棋面临苦战。])(;W[cl]N[图2 方向错误（6分）]C[图2 方向错误（6分）白棋逼，瞄着黑的弱点并开辟左边，但方向错误];B[dm];W[dl];B[mm];W[df];B[li]TR[mm]C[黑棋扩张右边，形势领先。])(;W[mm]N[图3 黑棋广阔（8分）]C[图3 黑棋广阔（8分）白棋此点可以说是此消彼长的形势要点];B[nl];W[ml];B[nk];W[mk];B[mj];W[lj];B[li];W[kj];B[mi]C[但是，进行至此，局势却是黑棋广阔。])(;W[om]N[图4  正解（10分）]C[图4  正解（10分）白棋刺是急所，利用对方的弱点来侵消黑势];B[pm];W[ok];B[pj];W[oj];B[pi];W[fc]C[白棋先手利用后，再守左上角，白棋充分可下。]))",

		//wqqlzwcs_27_2.sgf
		"(;AW[dp][fq][dc][ed][ee][fe][ff][gg][gh][hf]AB[cn][de][dg][ef][fg][fh][fi][gf][pd][pp]LB[jc:a][mc:b][pj:c][en:d]C[（布局）黑先。考虑左边白棋的布置，黑棋如何决定自己的下一步棋？请在 a、b、c、d 中选择。]SZ[19](;B[mc]C[图1  正解（10分）黑棋大飞守角，牵制左边白势是正解]N[图1  正解（10分）];W[kc]C[白棋如果拦的话……];B[kd];W[jd];B[ld];W[jc]C[黑棋可以先手利用];B[qj]C[然后黑抢先占据右边，黑棋可以满足。])(;B[jc]C[图2  黑棋无理（4分）黑棋的意图是更积极些，但实际上是无理棋]N[图2  黑棋无理（4分）];W[nc]C[白立即挂角是好棋];B[oc];W[nd];B[pf];W[ke]C[进行至此，黑棋困难。])(;B[pj]C[图3  方向错误（6分）黑棋扩张右边，但是方向错误]N[图3  方向错误（6分）];W[nc];B[pf];W[kd]C[从棋子的配置上分析，可以看出上边比右边的价值更大。])(;B[en]C[图4  大同小异（6分）黑棋在左边跳，放弃阻止上边白势的扩张，结果与图3 大同小异]N[图4  大同小异（6分）];W[co];B[bn]C[白棋先手与黑交换一手];W[nc];B[pf];W[kd]C[白再抢占上边要点，白棋可以满意。]))",

		//wqqlzwcs_27_3.sgf
		"(;AB[pd][pf][pj][pp][jp][ce][dh][ck][me][kf]AW[dq][co][hp][dc][ed][jd][if][ld][nc]LB[ql:a][pn:b][qn:c][qq:d]C[（中盘）白先。白棋如何打入黑阵才能不受黑棋的猛攻？请在 a、b、c、d 中选择。]SZ[19](;W[ql]N[图1  正解（10分）]C[图1  正解（10分）白棋打入是急所];B[qj]C[黑棋并是重视右上实地的下法，同时也不给白棋腾挪的余地];W[qp]C[白棋托是打开局面的手筋];B[qo];W[ro];B[po];W[rp]C[进行至此，白棋可以轻松处理。])(;W[pn]N[图2  白棋受攻（6分）]C[图2  白棋受攻（6分）白棋高挂];B[np]C[黑棋补后，白没有好下法];W[qp];B[qq];W[qo];B[rq];W[pl]C[进行至此，白棋已大致生根];B[qk]C[但黑棋继续攻击];W[ql];B[nk];W[mm];B[lk]C[白棋继续受攻，形势不好。])(;W[qn]N[图3  白棋不利（4分）]C[图3  白棋不利（4分）白棋挂角];B[ql]C[黑棋夹击是好棋];W[qq]C[白棋点三三];B[qp];W[pq];B[op];W[rp];B[ro];W[rq];B[qo];W[nq];B[np];W[mq];B[mp]C[黑棋构筑成强大的外势，白棋非常不利。])(;W[qq]N[图4  黑棋充分（6分）]C[图4  黑棋充分（6分）白棋直接点三三];B[qp];W[pq];B[nq];W[nr];B[mq];W[rp];B[ro];W[rq];B[qn];W[oq];B[op]C[进行至此，黑棋可以构筑强大的外势，白棋不舒服。从全局来看，黑棋的外势明显。]))",

		//wqqlzwcs_27_4.sgf
		"(;AB[pd][pf][pj][pp][jp][ce][dh][ck][me][kf][qn]AW[dq][co][hp][dc][ed][jd][if][ld][nc][ql]SZ[19]LB[ol:a][qj:b][rj:c]C[（中盘）白先。四周的黑棋非常强大，右边白棋一子应如何处理？请在 a、b、c 中选择。](;W[ol]N[图1  白棋不满（6分）]C[图1  白棋不满（6分）白棋单跳虽然也是一种感觉];B[qj]C[但黑棋并后，白棋不好。白棋在安定这二子时，可能会付出很大代价。])(;W[qj]N[图2  白棋无理（4分）]C[图2  白棋无理（4分）白棋托];B[qi]C[但黑棋扳后，白棋很难应];W[pi]C[白棋断无理];B[qh]C[黑棋冷静地退，白很难应。])(;W[rj]N[图3  正解（10分）]C[图3  正解（10分）白棋飞是最佳处理方法，由于周围黑棋过于强大，白棋尽快安定自己是明智的];B[qi];W[ri];B[rh];W[pk]LB[qh:a]C[进行至此，白棋由于可以瞄着黑棋 a 位的弱点，因而可以轻松处理。])(;W[rj]C[图4  变化图]N[图4  变化图];B[qk]CR[rj]C[白棋飞时，黑棋如果构筑外势……];W[rk];B[pl];W[qm];B[pm];W[rn]C[白棋生根];B[ro]C[黑棋连扳];W[rm];B[in]CR[rm]C[白棋粘时，黑棋脱先抢占要点，如此双方均势。]))",

		//wqqlzwcs_27_5.sgf
		"(;AW[cr][dq][er][es][cp][bp]AB[bo][co][bm][dp][eo][eq][fq][fr][fs]C[（官子）黑先。黑棋如何攻击白棋？如能正确利用对方气紧的弱点，必有所获。]SZ[19](;B[br]N[图1 正解（10分）]C[图1 正解（10分）黑棋靠是官子手筋];W[bs]C[白棋必须扳，补棋];B[ds];W[ar];B[dr];W[cq]C[黑可先手吃白二子。黑棋先手，提白 2 子，白地 4 目。])(;B[bq]N[图2 也是正解（10分）]C[图2 也是正解（10分）黑棋夹];W[aq]C[白棋如果扳……];B[br];W[bs]C[白棋还扳。白棋不能再扳了。];B[ar];W[ap];B[ds];B[ds]C[白棋被杀。])(;B[br]C[图3 变化图]N[图3 变化图];W[bs];B[ds];W[dr]TR[ds]C[黑棋打吃时，白棋粘是大恶手];B[bq]C[黑棋长后，白棋被杀。])(;B[bq]C[附图1 白棋的最佳防守]N[附图1 白棋的最佳防守];W[br]TR[bq]C[黑棋夹时，白棋只能挡];B[ap];W[ar]C[白棋立下弃子];B[cq];W[dr]C[黑棋先手，白空 4 目，黑提白 2 子。这是黑棋夹时，白棋的最佳防守。])(;B[bq]C[附图2   对图2 的疑问]N[附图2   对图2 的疑问];W[aq]LB[br:a]TR[bq]C[黑棋夹时，白棋只能在 a 位防守，扳已是错着。];B[br]LB[bs:a]C[黑长，当然。图2 中，白在 a 位扳，结果白全体被吃。];W[ar]LB[bs:a][cs:b]C[白棋当然要爬，以下黑 a 则白 b，黑没有任何收获。];B[cs]LB[dr:a][as:b]C[黑棋扳，必然。以下，白 a 接则黑 b 扑劫，白难以承受];W[cq]C[白棋打，绝对。此时，黑棋要么选择粘上双活，要么选择吃白二子。](;B[bs];W[dr]C[这样是双活。白后手双活])(;B[dr];W[bs];B[ds]C[白地 5 目，黑提白 2 子。黑棋不会选择此图。])))",

		//wqqlzwcs_27_6.sgf
		"(;AW[ap][bp][br][cq][dr][fq][fr][gr]AB[ao][bo][cp][dp][ep][fp][dq][gq][hp][hr]C[（官子）黑先。黑棋如能正确利用对方气紧的弱点，则官子收获会相当大。]SZ[19](;B[er]N[图1 正解（10分）]C[图1 正解（10分）黑棋挖是手筋];W[es];B[eq];W[ar]C[这是白棋的最佳防守];B[gs]C[黑棋可吃住白二子。])(;B[er]C[图2  变化 1]N[图2  变化 1];W[eq]TR[er]C[黑棋挖时，白棋不肯妥协];B[es]C[黑棋立下是强手];W[ds];B[bq]C[黑棋扑，绝妙];W[aq];B[bs]LB[ar:a][cr:b]C[黑棋托，a、b 两点必得其一，白棋陷入困境。])(;B[er]C[图3  变化 2]N[图3  变化 2];W[eq];B[es];W[ds];B[bq];W[cr]TR[bq]C[黑棋扑时，白棋只能粘，否则如图2 形成打劫活];B[ar];W[bs]C[白棋做活，黑吃白二子。白棋还是选择图1 的防守方法为好。]))",

		//wqqlzwcs_27_7.sgf
		"(;AB[br][bq][cq][dp][ep][dn][hp][ip][jp][kp][kq][lr]AW[cr][dr][fq][fo][go][hq][kr][jq][iq][ks]C[（手筋）黑先。白棋的棋形很薄弱，黑棋应以什么次序攻击白棋？]SZ[19](;B[fr]N[图1 正解（10分）]C[图1 正解（10分）黑棋托是痛击白棋弱点的手筋];W[er]C[白棋如果扳……];B[gp];W[fp];B[gq]C[黑棋冲下];W[gr];B[hr];W[fs];B[jr]C[黑棋收获很大。])(;B[er]N[图2  失败（0分）]C[图2  失败（0分）黑棋跨不是好棋];W[fr]C[白棋冷静防守，黑棋成效甚微。])(;B[fr]C[图3  变化图]N[图3  变化图];W[gr]TR[fr]C[黑棋托时，白棋换个方向扳];B[fp];W[gp];B[eq];W[gq];B[er]C[黑棋成果很大。白棋麻烦。]))",

		//wqqlzwcs_27_8.sgf
		"(;AW[br][cr][cq][dp][ep][gq]AB[dq][cp][bp][bq][cn][ck][iq][kq]C[（手筋）黑先。在本题中，白棋形存在重大的弱点，黑棋攻击白棋弱点的急所是什么？]SZ[19](;B[fr]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是手筋];W[gr]C[白棋如果挡下……];B[dr];W[er];B[eq];W[ds];B[es];W[bs];B[fq];W[fp];B[gs];W[hs];B[ar]C[黑棋可吃住白角。])(;B[er]N[图2  失败（0分）]C[图2  失败（0分）黑棋尖是受棋形束缚的恶手];W[fr]C[白棋尖顶是双方的急所，黑棋多送一子，没有任何收获。])(;B[fr]C[图3  变化图]N[图3  变化图];W[er]TR[fr]C[黑棋点时，白棋防守……];B[fq]LB[fp:a]C[黑棋冲。];W[eq];B[fp]C[白棋虽可吃住黑一子，但白棋必须忍受很大的牺牲。]))",

		//wqqlzwcs_27_9.sgf
		"(;AB[bs][cr][fr][gr][gq][fq][hq][hs][ep][fo][do][bo][co][ap]AW[ar][br][bq][bp][cq][dq][eq][go][hp][io][iq][ir][hr][is]C[（死活）白先。白棋如何利用黑棋形的弱点做活？如能下成打劫，即告成功。]SZ[19](;W[fs]N[图1  正解（10分）]C[图1  正解（10分）白棋托是解决问题的唯一头绪];B[gs];W[er];B[es];W[ds];B[fp];W[fs]C[本图是双方最佳进行，白棋劫活。])(;W[fs]N[图2  变化图]C[图2  变化图];B[er]C[白棋托时，黑棋冲不好];W[dr];B[cs]C[黑棋接上，企图杀白];W[es];B[fp];W[gs]C[但白棋可以成功联络。])(;W[ds]N[图3  失败（0分）]C[图3  失败（0分）白棋单跳];B[es];W[er];B[fs]C[黑可简单吃住白棋。])(;W[fs]C[附图 为什么说图1 是双方最佳？]N[附图 为什么说图1 是双方最佳？];B[es]CR[fs]C[白棋底线托时，黑棋打吃毫无意义];W[er];B[gs];W[ds];B[fp];W[fs]C[至此，结果与图1 完全一样，而黑棋多送一子。]))",

		//wqqlzwcs_27_10.sgf
		"(;AB[bs][as][aq][bq][cr][cp][dp][fp][ep][hp][hq][iq]AW[cq][dq][eq][dr][bp][bo][cn][cm][en][hn][io][ip][jq][kq]C[（死活）黑先。黑棋如何才能取得对杀的胜利？]SZ[19](;B[es]N[图1 正解（10分）]C[图1 正解（10分）黑棋点是急所，利用对方气紧的弱点];W[ds];B[fq]CR[ds]C[白棋立下时，黑棋收气，对杀黑快一气。])(;B[fr]N[图2 失败（0分）]C[图2 失败（0分）黑棋单跳是误算];W[ds];B[fq];W[cs]C[白棋反而吃住黑棋。])(;B[fq]N[图3 失败（0分）]C[图3 失败（0分）黑棋曲];W[es]C[白棋虎是好棋];B[fr];W[br];B[ar];W[cs]C[双方下成打劫。])(;B[fq]C[附图   对图3 的疑问]N[附图   对图3 的疑问];W[es];B[cs]CR[es]C[白棋虎时，黑棋团眼，白仍被吃。当然，黑棋应该选择图1的进行。]))",
	],

	[

		//wqqlzwcs_28_1.sgf
		"(;AW[cd][dc][fd][ci][cl][po][oo][op][pq][qp][rp][qr][rr][no][mp]AB[co][dq][ce][kd][pc][pn][qn][on][rq][lq][mq][nq][oq][nr][pr][os]LB[de:a][hc:b][qe:c][pi:d]C[（布局）黑先。黑棋是应该首先牵制左边的白势，还是扩张自己的右边？请在 a、b、c、d 中选择。]SZ[19](;B[de]N[图1 操之过急（ 4分）]C[图1 操之过急（ 4分）黑棋立即出动无理];W[ff]C[此时白棋单跳是好棋];B[dh];W[di];B[eh];W[ch]C[白棋攻击，黑棋很难受。])(;B[hc]N[图2 方向错误（6分）]C[图2 方向错误（6分）黑棋大飞拆，准备利用左侧黑棋一子对白棋有所作为，但是方向错误];W[pj]C[白棋夹击严厉];B[qh]C[黑棋反夹多少有点无理];W[pl];B[nn];W[mn];B[nl];W[mm];B[ol];W[nj]C[进行至此，结果黑棋难受。])(;B[qe]C[图3 黑棋不利（8分）黑棋缔角，并可于下侧的黑棋形成响应]N[图3 黑棋不利（8分）];W[pj]C[但白棋夹击仍然严厉，黑棋不舒服];B[qh];W[pl]C[黑棋不利。])(;B[pi]C[图4  正解（10分）黑棋大拆，重视右边是正确的下法]N[图4  正解（10分）];W[pe]C[白棋若高挂……];B[nd];W[qc];B[qb];W[qd];B[rb];W[qg];B[rh];W[ng];B[ni]C[黑棋采取攻势，黑棋比较舒服。]))",

		//wqqlzwcs_28_2.sgf
		"(;AW[cd][cc][eb][bf][cp][do][dq][dr][oc][pq][mq]AB[dd][de][dh][gd][qd][eq][ep][gp][jq][qo][qk]LB[mc:a][md:b][od:c][pe:d]C[（布局）黑先。黑棋应根据左上和右边的黑子布置来决定下一步棋。本图最有效的位置是什么？请在 a、b、c、d 中选择。]SZ[19](;B[mc]N[图1  黑棋不满（6分）]C[图1  黑棋不满（6分）黑棋一间低夹];W[md]C[白棋靠压进行处理];B[ld];W[nd];B[pf];W[lc];B[kc];W[lb];B[kd];W[mb]C[这是预想的进行，结果黑棋不满。])(;B[md]N[图2  正解（10分）]C[图2  正解（10分）黑棋一间高夹是正解];W[ne];B[pf]C[黑棋小飞是必然的下法。其后白棋没有好的手段是白棋的苦闷。];W[me];B[kd];W[ld];B[lc];W[le];B[kc]C[进行至此，黑棋在捞取实地的同时，还可攻击白棋。])(;B[od]N[图3  黑棋不满（6分）]C[图3  黑棋不满（6分）];W[nd];B[oe]C[黑棋压长是重视右边的下法];W[pc];B[qc];W[mc]LB[pj:a]C[但白棋在上边求得安定之后，白 a 位肩冲是绝好的侵消手段，黑棋不满。])(;B[pe]N[图4  平常下法（8分）]C[图4  平常下法（8分）黑棋尖是平常的下法];W[lc]C[白棋拆二后，双方形成持久战，黑棋以后有点难下。]))",

		//wqqlzwcs_28_3.sgf
		"(;AW[dc][ce][dj][dp][dn][jd][nc]AB[pd][pf][pj][qp][oq][oo][ip][fq]LB[ee:a][jn:b][kq:c][pl:d]C[（中盘）白先。黑白双方均采用大模样作战，其后白棋是继续扩张自身还是侵消甚至去攻击对方？请在 a、b、c、d 中选择。]SZ[19](;W[ee]N[图1  黑棋广阔（8分）]C[图1  黑棋广阔（8分）白棋跳，可以将自己的模样在一定程度上转化为实地，但步伐太慢];B[jj]C[黑棋占据双方不可放过的要点，结果黑棋广阔。])(;W[jn]N[图2  正解（10分）]C[图2  正解（10分）白棋吊，侵消黑势是正解];B[ko]C[黑棋如果飞补……];W[kn];B[lo];W[gn]C[白先手与黑交换一手，然后联络，白棋可以满足。黑棋下边虽已走强，但白棋的模样很大，白棋充分。])(;W[kq]C[图3  帮对方走棋（6分）白棋打入太深]N[图3  帮对方走棋（6分）];B[ko]C[黑棋飞封是绝好点];W[nq];B[np];W[mq];B[or];W[ir];B[ji]C[白棋虽可处理下边，但黑棋抢占大势的要点，黑棋充分。])(;W[pl]C[图4  白棋无理（4分）白棋在右边打入无理]N[图4  白棋无理（4分）];B[nl];W[ok];B[mj]C[黑棋猛攻];W[oj];B[pi]C[白棋难受。]))",

		//wqqlzwcs_28_4.sgf
		"(;AW[dd][cp][dn][bo][bq][po][pn][qn][mn][pc][qc][nc][qf][pg]AB[cq][dq][ep][hp][qp][qo][pq][nq][pk][pi][pf][of][pd][qe]LB[ml:a][ql:b][nn:c][no:d]C[（中盘）黑先。白棋向中腹二间跳谋求安定，黑棋如何下才能继续保持先行的效果？请在 a、b、c、d 中选择。]SZ[19](;B[ml]N[图1  黑棋失败（6分）]C[图1  黑棋失败（6分）黑棋攻击白棋的方向错误];W[mp]C[白棋肩冲很好];B[mq];W[lp]C[白棋不再受攻。])(;B[ql]N[图2  大同小异（6分）]C[图2  大同小异（6分）黑棋搜根];W[mp];B[mq];W[lp]C[白棋整形，结果与图1 大同小异。])(;B[nn]C[图3  黑棋无理（4分）]N[图3  黑棋无理（4分）];W[no];B[nm];W[lo];B[oo];W[op];B[on];W[pp])(;B[no]C[图4  正解（10分）黑棋刺是攻击的急所];W[nn];B[om];W[on]C[黑棋再刺，与白交换一手];B[ml]C[黑棋飞是攻击的要点，结果黑棋好下。]))",

		//wqqlzwcs_28_5.sgf
		"(;AB[ar][br][cq][dq][dp][ep][fp][gp][hq][hr][dn][cm][bm]AW[bq][bp][bn][co][dr][cr][eq][fq][gq][gr]C[（官子）黑先。黑棋如何利用接不归将右侧白棋四子纳入囊中？]SZ[19](;B[er]N[图1  正解（10分）]C[图1  正解（10分）黑棋断是官子手筋];W[es]C[白棋只能从底线打吃];B[cs];W[fr];B[bs]C[黑棋粘，冷静];W[ds];B[gs];W[aq]C[白棋只得如此紧气];B[hs];W[as];B[fs]LB[br:a]C[黑棋打吃，白接不归。])(;B[gs]N[图2  失败（0分）]C[图2  失败（0分）黑棋扳];W[es];B[fs];W[er]C[黑棋可以先手收官，但与图1 相比，差别很大。])(;B[fs]N[附图]C[附图黑棋点];W[es]C[白棋尖顶，与 图2 一样了。]))",

		//wqqlzwcs_28_6.sgf
		"(;AB[bq][cq][dq][ep][fp][gp][hq][iq][jq][jr]AW[dr][eq][fq][gq][hr][ir][dp][cp][bp][cn]C[（官子）黑先。黑棋如何利用角的特殊性来决定下一手棋？不管是活角还是下成打劫都是黑棋的成功。]SZ[19](;B[er]N[图1  正解（10分）]C[图1  正解（10分）黑棋断是利用角的特殊性的手筋];W[fr];B[ds]CR[fr]C[白棋打吃时，黑棋从底线反打是准备好的强手];W[cr]C[白棋如果长……];B[fs]C[这样形成整块白棋的生死大劫。])(;B[er]C[图2  变化一]N[图2  变化一];W[fr];B[ds];W[es]C[白棋提子];B[cr]C[黑棋挡是强手];W[cs];B[bs]C[黑棋打，顽强。这个劫通常白不能开。];W[ds]C[白棋妥协];B[ar]C[黑棋在角上做活。])(;B[er]C[图3  变化二]N[图3  变化二];W[es]C[白棋从底线打];B[ds]C[黑棋扑是手筋];W[cr]C[白棋长的话……];B[fs]C[黑棋提子];W[br];B[gr];W[aq]C[黑棋先手割掉白棋二子。]))",

		//wqqlzwcs_28_7.sgf
		"(;AB[cr][cq][cp][dr][dp][eo][fo][go][ho][ip][jp][gq]AW[dq][eq][er][fp][gp][hp][iq][jq]C[（手筋）黑先。黑棋看似对白棋已无手段，其实却能有所收获。]SZ[19](;B[hq]C[图1  正解（10分）黑棋断是攻击的出发点]N[图1  正解（10分）];W[fq];B[gr];W[fr]C[白棋强行抵抗];B[gs]C[黑棋立下是要领];W[hs];B[ir];W[fs];B[jr];W[hr];B[kq]C[白棋被全歼。])(;B[kp]N[图2  失败（0分）]C[图2  失败（0分）黑棋单长是顾忌到自身弱点的消极下法];W[hq];B[kq]C[黑棋收获不大。])(;B[hq]C[图3  变化图]N[图3  变化图];W[gr]C[白棋夹是最佳下法];B[fq];W[hr];B[ep];W[fr]C[将自己的损失减少到最小限度，是白棋的最佳下法。]))",

		//wqqlzwcs_28_8.sgf
		"(;AW[cr][cq][bq][dp][do][ep][fp][eq][gq][hq][iq]AB[dq][fr][er][dr][fq][gp][hp][cp][co][cn]C[（手筋）黑先。黑棋吃住中腹白棋五子的手筋是什么？]SZ[19](;B[gn]N[图1 正解（10分）]C[图1 正解（10分）黑棋跳，看似迟缓，却是吃住白棋的手筋];W[em]C[白棋飞，试图逃跑];B[en]C[黑棋跨是连贯的好手];W[dn];B[dm];W[fn];B[fo]C[白棋被吃。])(;B[fn]N[图2 黑棋失败（0分）]C[图2 黑棋失败（0分）黑棋飞封看上去似乎是手筋];W[en];B[em]C[白棋先手与黑交换一手];W[go]LB[fo:a][ho:b]C[然后白棋扳出，以下黑 a 则白 b。有征子问题了。];B[ho];W[gn]C[白棋逃出，黑棋失败。])(;B[gn]C[图3  变化图]N[图3  变化图];W[fn]C[白棋靠谋求出头];B[fm];W[em];B[fo]LB[en:a]C[黑棋打吃好手];W[en];B[dn];W[eo];B[el]C[黑棋可以征吃白棋。]))",

		//wqqlzwcs_28_9.sgf
		"(;AB[br][bq][bo][cp][ep][dp][fp][gp][ip][hq][ir][jq]AW[cr][cq][dq][eq][gq][gr][hr]C[（死活）白先。白棋看似已不可能做活，其实不然。第一手棋非常重要。]SZ[19](;W[ds]C[图1  正解（10分）白棋倒虎是急所]N[图1  正解（10分）];B[er];W[hs];B[fs];W[fq]C[共活，白棋活了。])(;W[hs]N[图2  白棋失败（0分）]C[图2  白棋失败（0分）白棋立，扩大眼位，错误];B[fq];W[fr];B[ds]C[黑棋冲、点是好次序];W[cs];B[er]C[白棋被杀。])(;W[fq]C[图3  失败（0分）]N[图3  失败（0分）];B[er];W[es];B[ds];W[fs];B[hs]C[白不活。此题不难，要计算全部变化，尤其是失败的变化，培养计算能力的好题目。]))",

		//wqqlzwcs_28_10.sgf
		"(;AB[br][bq][cs][cp][dp][eo][en][fn][gn][ho][hp][hq][hr][jr]AW[cq][dr][cr][eq][ep][fo][go][gp][gq][fs]CR[fs]C[（死活）黑先。白在底线下子谋求做活时，黑棋如何利用白棋的弱点而吃住白棋？]SZ[19](;B[ds]N[图1 正解（10分）]C[图1 正解（10分）黑棋爬是出乎意料的好手];W[es];B[fr]CR[es]C[白棋打吃时，黑棋点，白棋不活。])(;B[es]N[图2  失败（0分）]C[图2  失败（0分）黑棋靠看似急所];W[gr]C[但白棋有抵抗手段];B[ds];W[er];B[bs];W[fq]C[白棋净活。])(;B[fr]N[图3  失败（0分）]C[图3  失败（0分）黑棋跨];W[gr]C[白棋挡后，黑棋缺少后续手段];B[fq];W[ds];B[er];W[dq]C[黑棋仅仅是先手共活。]))",
	],

	[

		//wqqlzwcs_29_1.sgf
		"(;AB[qd][pq][qp][qo][dp][dj][de][df][cf]AW[ce][cd][dc][fc][oc][po][pn][qn][np]LB[ld:a][pe:b][pf:c][qg:d]C[（布局）黑先。黑棋如何处理右上角一子是问题的关键。在选择时，应将右下方白棋的外势考虑在内。请在 a、b、c、d 中选择。]SZ[19](;B[ld]LB[of:a]C[图1 黑棋不满（6分）黑棋夹攻，其意是让白棋在 a 位大跳，然后黑棋可在右边拆二]N[图1 黑棋不满（6分）];W[qg]C[但白棋反夹的下法可以成立，黑棋不能如愿。];B[od];W[pj];B[pc])(;B[pe]N[图2 大同小异（6分）]C[图2 大同小异（6分）];W[qh]TR[pe]C[黑棋尖时，白可不在上边行棋，而在右边反夹];B[nd];W[mc]C[白棋充分。由于抢占了价值很大的右边，结果白棋满意。本图与图1 大同小异。])(;B[pf]C[图3 白棋满足（6分）黑棋飞虽可考虑]N[图3 白棋满足（6分）];W[qh]C[但白棋可抢占价值很大的右边];B[pc];W[od];B[qf]C[黑棋补角];W[oh];B[nf];W[ld]C[进行至此，白棋两侧都得到了处理，白棋可以满意。])(;B[qg]C[图4 正解（10分）黑棋在右边拆二是正解，大家应该牢记，在右边价值极大时，这样的下法是唯一可考虑的。]N[图4 正解（10分）];W[ld];B[ge]))",

		//wqqlzwcs_29_2.sgf
		"(;AW[dd][cf][db][cp][co][dq][fq][or][qc][pd][pe][rd][of][nf][md]AB[fc][id][me][ne][oe][oc][nc][pc][pp][qn][ph][cn][do][dm][ci]LB[nq:a][oq:b][pq:c][pr:d]C[（布局）黑先。白棋在右下角潜入是常用的渗透手段，对此黑棋如何应最佳？请在 a、b、c、d 中选择。]SZ[19](;B[nq]C[图1 正解（10分）黑棋飞封构筑外势，是正确的定式选择]N[图1 正解（10分）];W[nr];B[mq];W[qq];B[pq];W[pr];B[qp];W[rq];B[nh]C[进行至此，白棋虽可在角上后手做活，但黑棋抢占要点，黑棋外势明显。])(;B[oq]C[图2  黑棋不利（6分）黑棋尖顶虽是攻击白棋的有力下法，但……]N[图2  黑棋不利（6分）];W[pr];B[nr];W[nq];B[mq];W[np];B[lr];W[qp];B[qq];W[pq];B[rp];W[op];B[qo];W[nn]C[进行至此是基本下法。从现在的配置来看，黑棋不利。])(;B[pq]N[图3  普通的进行（8分）]C[图3  普通的进行（8分）黑棋并是常用的下法];W[lq]C[不过黑棋多少有点不满。])(;B[pr]C[图4  白棋满足（6分）]N[图4  白棋满足（6分）];W[pq]TR[pr]C[黑棋靠下，白棋挖是常用手段];B[oq];W[qq];B[qr];W[op];B[nq];W[qp];B[po];W[nr];B[rr];W[mq];B[np];W[mo]C[进行至此，均是定式化的进行。白棋利用弃子构筑成很厚的外势，结果白棋有利。]))",

		//wqqlzwcs_29_3.sgf
		"(;AW[dc][de][ci][dp][dn][qo][po][ld][md][nc][pc][qc][pf][og]AB[gc][jc][kd][lc][of][oe][pd][pg][ph][pk][fq][jp][np][qp][pq]LB[rk:a][ql:b][pm:c]SZ[19]C[（中盘）白先。白棋如何处理右下角二子将是中盘胜负的关键。白棋应该怎样下？请在 a、b、c 中选择。](;W[rk]C[图1  白棋难受（4分）白棋二路潜入想轻快地进行处理]N[图1  白棋难受（4分）];B[qk];W[rl];B[rj]C[黑棋按常法应对];W[pm]LB[qm:a];B[ql];W[qm];B[rn]C[黑棋有严厉的攻击手段，结果白棋难受。])(;W[ql]C[图2  正解（10分）白棋拆二看似俗手，其实很好]N[图2  正解（10分）];B[qk];W[pl];B[ol];W[om];B[rl];W[rm];B[rk];W[nl];B[ok];W[nm]C[白棋充分。])(;W[ql]C[图3 变化图]N[图3 变化图];B[qk];W[pl];B[ol];W[om];B[nm]CR[om]C[白棋扳时，黑棋连扳];W[rk];B[rj];W[qj]CR[rk]C[白棋扳、断是手筋];B[pj];W[rl];B[qi]C[黑补棋];W[nl];B[ok];W[on]C[进行至此，结果仍是白棋充分。])(;W[pm]C[图4  白棋薄弱（6分）白棋高拆一虽是棋形的急所，但在本题中不合适]N[图4  白棋薄弱（6分）];B[ql]C[黑棋尖是严厉的攻击要点];W[mn];B[mp]C[黑棋一边捞取实地，一边采取攻势，黑棋可以满足。]))",

		//wqqlzwcs_29_4.sgf
		"(;AW[dd][dq][do][pc][qc][nc][nb][ol][ql]AB[lc][me][pd][od][qd][qk][pj][pp][qn][jp]LB[rk:a][rl:b][qm:c]C[（中盘）白先。本题是黑棋三连星布局中经常出现的棋形。白棋快步调处理的方法是什么？请在 a、b、c 中选择。]SZ[19](;W[rk]C[图1  正解（10分）白棋扳是正解]N[图1  正解（10分）];B[rj];W[pk];B[qj];W[oj];B[oi];W[nj];B[ni];W[mj]C[进行至此，黑棋虽可走强，但白棋的棋形也很厚，白棋充分可下。])(;W[rk]C[图2  变化图]N[图2  变化图];B[pk]CR[rk]C[白棋扳时，黑棋反击];W[qm]C[白棋顶是形];B[pn];W[rj]C[白棋进入黑阵去做活。])(;W[rl]C[图3  白重（6分）白棋下立过重]N[图3  白重（6分）];B[nk]C[黑棋飞攻严厉];W[nl];B[mk]C[黑棋可以掌握大势的主动权。])(;W[qm]C[图4  恶手（6分）]N[图4  恶手（6分）];B[pn]CR[qm]C[白棋顶，黑棋长。这样白棋顶即成为典型的俗手];W[nk];B[ni];W[lk]C[白虽可很容易地向中腹出头，却使两侧黑棋都顺势走强，白棋大损。]))",

		//wqqlzwcs_29_5.sgf
		"(;AW[bq][cq][dq][er][fr][gr]AB[bp][cp][dp][bn][dr][fq][eq][gq][hr][hp]C[（官子）黑先。如果从常识上来看，黑棋一子已无生还的余地。黑棋应该如何下？]SZ[19](;B[ds]N[图1  正解（10分）]C[图1  正解（10分）黑棋立下是解决问题的唯一头绪];W[cr]C[白棋只得紧气，没有其他的走法。];B[aq]C[黑棋再扳是很好的次序];W[es];B[gs]C[黑棋打时，白已不能提子];W[ar];B[fs];W[bs];B[ap];W[cs]C[白棋勉强成活。])(;B[br]N[图2  失败（0分）]C[图2  失败（0分）如果是实战，黑棋很可能这样收官];W[cr];B[aq];W[ds]C[黑棋如果仅仅满足于此，将是黑棋的失败。])(;B[ds]C[图3  变化图]N[图3  变化图];W[cr];B[aq];W[ar]TR[aq]C[黑棋扳时，白棋打是大恶手];B[cs];W[ap];B[bs]C[白棋由于两侧不入气，全部不活。]))",

		//wqqlzwcs_29_6.sgf
		"(;AB[ar][bq][bp][cp][dp][ep][fp][gp][ho][ip][jp][jq][jr][fq][er]AW[br][cr][cq][dq][eq][fr][gq][gr][hq][hp][iq][ir]C[（官子）黑先。黑棋利用已被吃住的一子压缩白空的手段是什么？]SZ[19](;B[is]C[图1 正解（10分）黑棋扳是平常的下法，却是正解]N[图1 正解（10分）];W[es]C[白棋只好退让];B[hs];W[gs]C[黑棋先手便宜。])(;B[is]C[图2  变化图]N[图2  变化图];W[es];B[gs]C[黑棋如果对打劫有信心，也可以更进一步];W[fs];B[hs];W[dr]C[黑棋比图1 还要便宜 1 目。])(;B[is]C[图3  变化图]N[图3  变化图];W[hs]TR[is]C[黑棋扳时，白棋挡下是大恶手];B[ds];W[dr];B[fs]C[下成生死大劫，白棋非常不好。]))",

		//wqqlzwcs_29_7.sgf
		"(;AB[br][cq][cp][co][do][en][dm][fq][fr][gp]AW[cr][dq][eq][dp][eo][fp][go][ho][ip][hq]C[（手筋）黑先。黑棋如何充分利用对方的弱点救出白阵中的三子？]SZ[19](;B[cs]N[图1 正解（10分）]C[图1 正解（10分）黑棋在底线打吃是手筋];W[dr];B[ds];W[fo];B[er];W[ep]C[由于自身存在弱点，白棋只好让黑棋先手联络。])(;B[ds]N[图2 失败（0分）]C[图2 失败（0分）黑棋飞失败];W[es]C[白棋搭下是严厉的反击手段];B[er];W[dr];B[fs];W[bs]C[白棋可以扳，黑棋大损。])(;B[cs]C[图3  变化图]N[图3  变化图];W[dr];B[ds];W[es]C[白棋打吃没有作用];B[bs]C[黑棋接上即可。]))",

		//wqqlzwcs_29_8.sgf
		"(;AW[eq][fq][iq][jq][co][cn][cl][dm]AB[cp][dp][ep][fp][dn][en][fl][jp][kp][kq]C[（手筋）黑先。在本题中，黑棋绝妙的破眼手筋是什么？白棋如果顽强抵抗，可以下成劫活。]SZ[19](;B[ir]C[图1  正解（10分）黑棋碰是攻击白棋弱点的手筋]N[图1  正解（10分）];W[jr];B[gr]CR[jr]C[白棋如果拐下，黑棋单跳是连贯的强手];W[gq];B[hq];W[hr];B[hs];W[hp];B[ip]C[进行至此，双方形成打劫。])(;B[ir]C[图2  变化图]N[图2  变化图];W[hq];B[jr]CR[hq]C[白棋如果退，黑棋也接回，同时保持着对白棋的攻击。])(;B[ir]C[图3  变化图]N[图3  变化图];W[jr];B[gr];W[gq];B[hq];W[hp]C[白棋不扑而直接打吃是大恶手];B[hr];W[ip];B[gp];W[fr];B[dq];W[fs];B[es]C[对杀白负。]))",

		//wqqlzwcs_29_9.sgf
		"(;AW[br][bq][bp][bo][co][cr][eo][fn][fp][gp][hq][iq][jq][jr][ds]AB[cq][cp][dp][ep][dr][fq][gq][hr][ir][es]CR[ds]TR[es]C[（死活）白先。白棋扳时，黑棋挡，黑棋存在什么弱点？]SZ[19](;W[eq]N[图1  正解（10分）]C[图1  正解（10分）白棋断是急所];B[er];W[gr];B[fr];W[gs]C[黑棋两侧不入气，被杀。])(;W[er]N[图2  失败（0分）]C[图2  失败（0分）白棋断打];B[cs]LB[fr:a][eq:b]C[一下，白 a 则黑 b，成劫];W[fs];B[fr]C[双方下成打劫，白棋失败。])(;W[eq]C[图3  变化图]N[图3  变化图];B[fr]C[黑棋立，求变];W[gs]C[白棋点眼即可吃住全部黑棋。]))",

		//wqqlzwcs_29_10.sgf
		"(;AW[br][dr][dq][dp][do][eo][fo][gn][hn][in][jo][jp][iq][ir][kr]AB[ds][er][eq][ep][fp][go][ho][ip][hq][hr][is]C[（死活）白先。白棋应该如何攻击黑棋？]SZ[19](;W[es]C[图1  正解（10分）]N[图1  正解（10分）];B[fs];W[hs];B[gs];W[hp]C[白棋连续扑入，黑棋无法成活。])(;W[hp]C[图2  失败（0分）白棋先扑次序错误]N[图2  失败（0分）];B[gp];W[io];B[gr];W[fq];B[hs];W[fs];B[es];W[fr]C[白棋仅仅下成共活。])(;W[es]C[图3  变化图]N[图3  变化图];B[gq]CR[es]C[白棋扑时，黑棋曲];W[fr]LB[fs:a][hp:b]C[白棋扳是急所，其后 a、b 两点必得其一，黑棋不活。]))",
	],

	[

		//wqqlzwcs_30_1.sgf
		"(;AW[dd][kq][ij][gj][hj][ei][ch][nc][gp][ep][dp][cp][co][bo]AB[bp][bq][cq][dq][fr][cn][dj][fk][gk][hk][jl][kd][pd][pq][qo]LB[qc:a][ne:b][qf:c]C[（布局）白先。白棋如何最大限度地利用左侧白棋的外势？应该考虑到中腹的黑棋仍是浮棋。请在 a、b、c 中选择。]SZ[19](;W[qc]C[图1 最差点（4分）白棋点三三过于追求实地]N[图1 最差点（4分）];B[pc];W[qd];B[pe];W[pb];B[ob];W[qb];B[oc];W[qf]C[进行至此，定式暂告一段落];B[ic]C[黑棋在上边拆，左侧白外势的光芒尽失。])(;W[ne]C[图2  正解（10分）白棋向中腹单跳，采取攻击性的态势是正解]N[图2  正解（10分）];B[pf]C[黑必然补棋];W[id]C[白棋夹击很严厉];B[oc];W[nb]C[黑棋先手与白交换一手];B[kf]C[然后黑棋跳起];W[ng];B[kh];W[ph];B[ob];W[lg];B[kg];W[jk]C[进行至此，黑棋两块棋都受攻，白棋好调。])(;W[ne]C[图3  变化图]N[图3  变化图];B[hc]CR[ne]C[白棋跳时，黑棋不补角，而是在上边拆];W[pf];B[qf];W[qg];B[qe];W[pg];B[pb]C[白棋先手将黑棋封在角上，黑棋痛苦];W[fc]C[白棋逼攻，结果仍是黑棋有利。])(;W[qf]N[图4  白棋不利（6分）]C[图4  白棋不利（6分）白棋双飞燕没有抓住要害];B[nd];W[md];B[ne];W[qc];B[oc];W[qd];B[nb]C[到此是可以预想的进行，白棋明显不利。]))",

		//wqqlzwcs_30_2.sgf
		"(;AB[cq][cp][do][dl][ci][cf][bd][oc][rp][qp][ro][qn][po][pm][on][mn][ln][oq][pq]AW[cr][dq][er][fp][mp][mo][oo][pp][op][no][nq][qq][qr][dd][cc][fd][kc][qc]LB[pe:a][qe:b][pf:c][qf:d]C[（布局）黑先。黑棋如何处理右上角一子是问题的关键。应该考虑到右下黑棋的强大外势。请在 a、b、c 、d 中选择。]SZ[19](;B[pe]C[图1  黑棋不满（4分）黑棋飞，是取外势时的常用下法]N[图1  黑棋不满（4分）];W[qe];B[pf];W[qf];B[pg];W[qg];B[ph];W[qh];B[pi]C[但进行至此，右边被白棋抢占];W[ke]C[然后白再抢占上边要点，黑棋不满。])(;B[qe]C[图2  次选方法（8分）黑棋一间夹，是最大限度地利用右下外势的作战方法]N[图2  次选方法（8分）];W[pd];B[pf];W[od];B[nf];W[md]C[但白棋获得的实地实在太大，因此黑棋在选择这一进行时，应该慎重。])(;B[pf]N[图3  黑棋不利（6分）]C[图3  黑棋不利（6分）黑棋大飞准备与对方作战];W[rf]C[但白棋大飞的手法可以成立，黑棋不利。])(;B[qf]N[图4  正解（10分）]C[图4  正解（10分）黑棋二间反夹是正解];W[pd];B[of];W[od];B[ld]C[白棋谋求出头时，黑棋肩冲又是好下法];W[lc];B[mc];W[ne];B[md];W[nf];B[kd];W[jc];B[jd];W[ic];B[id];W[hd];B[he];W[gd];B[og]LB[pc:a]C[这是预想的进行，结果黑棋有利。以后黑棋走 a 位，角上白棋还无根。]))",

		//wqqlzwcs_30_3.sgf
		"(;AB[dp][dn][dk][ci][dc][fd][jd][qn][pl][qi][rp]AW[fq][jp][pp][np][qq][ei][de][pd][oc][qf]SZ[19]LB[cc:a][fe:b][ch:c]C[（中盘）白先。左上白棋如何以最有效的方法定形？请在 a、b、c  中选择。](;W[cc]N[图1 白损（6分）]C[图1 白损（6分）白棋托整形不好];B[cb];W[cd];B[bc];W[cg]C[到此是常识性的下法];B[dh]C[黑棋穿象眼，白棋痛苦];W[dg];B[eh]C[白棋中腹一子受损。])(;W[fe]N[图2 帮对方走棋（4分）]C[图2 帮对方走棋（4分）白棋靠，黑棋上边则顺势走强，白损];B[ge];W[ff];B[ed];W[gf];B[he]C[黑棋大大走厚，而白棋缺仍处于不安全状态。])(;W[ch]C[图3 正解（10分）白棋靠问黑应手是正解]N[图3 正解（10分）];B[bh];W[bi]TR[bh]C[黑棋如果扳，白棋断是常用下法];B[bj];W[di];B[cj];W[bg];B[ai];W[cc]C[白棋争得先手后于角上托];B[cb];W[cd];B[bb];W[cg]C[白棋满足。])(;W[ch]C[图4  变化图]N[图4  变化图];B[di];W[dh];B[eh]C[黑棋断无理];W[bi];B[bj];W[bh]C[白棋扳粘是稳健的下法];B[ck];W[fe]C[白棋好调。]))",

		//wqqlzwcs_30_4.sgf
		"(;AW[dc][cb][eb][cp][co][cn][dq][dr][hq][qj]AB[cd][cc][de][ci][dp][do][eq][jq][pp][pd]C[（中盘）黑先。左下角黑棋如何处理，将决定局势的有利和不利。黑棋最有效的下法是什么？请在 a、b、c 中选择。]SZ[19]LB[fo:a][gp:b][hp:c](;B[fo]C[图1  黑棋不满（6分）黑棋补棋是受棋形束缚的下法]N[图1  黑棋不满（6分）];W[ho]C[白棋单跳];B[fm]C[黑棋只好出头];W[jo]C[进行至此，黑棋不利。])(;B[hp]C[图2  正解（10分）黑棋靠，利用左边三子是正解]N[图2  正解（10分）];W[gp];B[ho];W[iq];B[jp];W[fq];B[jn]C[进行至此，虽然弃去三子，但黑棋可以构筑外势，结果黑棋充分。])(;B[hp]C[图3  变化图]N[图3  变化图];W[iq];B[ip];W[jr]CR[iq]C[白棋顶、扳的下法不好];B[gq]C[黑棋扳二子头是急所];W[kq];B[jp];W[lr];B[gr]C[黑厚。])(;B[gp]N[图4  白棋满足（4分）]C[图4  白棋满足（4分）黑棋肩冲，试图出动三子，不好];W[hp];B[ho];W[jp];B[kq];W[io];B[hn];W[gq];B[fp];W[jm];B[hl];W[jk]C[白棋掌握主动权。]))",

		//wqqlzwcs_30_5.sgf
		"(;AB[bq][bp][cq][dq][ds][er][fr][fq][fp][gp]AW[bs][bo][cp][dp][ep][eq][cn][fo][go][hp][gq][gr][fs][iq]CR[bs]C[（官子）黑先。白棋点时，黑棋必须考虑做活，而且应连官子都考虑在内。]SZ[19](;B[br]N[图1  正解（10分）]C[图1  正解（10分）黑棋顶是正解];W[gs];B[dr]C[黑棋接是要领];W[cs];B[ap];W[ar]C[这里形成共活。])(;B[br]C[图2  黑棋失败（0分）]N[图2  黑棋失败（0分）];W[gs];B[cs]C[黑棋顶不好];W[dr];B[cr];W[es];B[as]C[黑棋五子被吃，黑棋不行。])(;B[cs]N[图3  失败（0分）]C[图3  失败（0分）黑棋直接顶，同样不行];W[gs];B[br];W[dr]C[结果与图2 相同。]))",

		//wqqlzwcs_30_6.sgf
		"(;AB[bq][cp][dq][cr][do][dm][fn][fo][gp][gq][gr]AW[eq][ep][fp][go][gn][gm][hp][hq][hr][jr]C[（官子）黑先。本题的问题不是黑棋能否吃住白棋三子，而是如何吃围目数最多。]SZ[19](;B[fs]N[图1 正解（10分）]C[图1 正解（10分）黑棋尖是官子手筋];W[hs];B[gs]C[以后黑无须补棋，这是黑棋尖吃的效果。])(;B[er]N[图2 失败（0分）]C[图2 失败（0分）如果是实战，很容易走出扳的下法];W[gs];B[fr]C[但白棋先手扳，白棋便宜。])(;B[fs]C[图3  变化图]N[图3  变化图];W[er]TR[fs]C[黑棋尖时，白棋出动];B[es]C[白棋没有任何手段，反而损失了一个劫材。]))",

		//wqqlzwcs_30_7.sgf
		"(;AW[br][ar][cq][dq][er][dr][fq][fp][jq][dk][cl][bn]AB[bq][bp][ep][eq][dp][cp][dn][fr][gr]C[（手筋）黑先。被白棋二子分断的黑棋面临非常不利的战斗，黑棋最佳的处理方法是什么？]SZ[19](;B[go]C[图1 正解（10分）黑棋封是手筋]N[图1 正解（10分）];W[fo];B[fn];W[gp];B[hp]C[黑棋强硬地扳，不给白棋任何机会];W[ho];B[gn];W[hq];B[ip];W[gq];B[iq];W[hr];B[ir];W[gs];B[eo];W[fs];B[in]C[黑棋利用弃子构筑起强大的外势。])(;B[fo]C[图2 失败（0分）黑棋如果未能发现弃子的下法，而扳二子头]N[图2 失败（0分）];W[hq]C[白棋单跳后，黑棋不满。]))",

		//wqqlzwcs_30_8.sgf
		"(;AW[br][bp][cp][cq][dq][ep][hq][dn][dl]AB[bq][dp][do][co][eq][er]C[（手筋）黑先。黑棋如能吃住切断自己的白棋一子当然更好，如果吃不住，也应使局势对自己有利，请问黑棋应该如何下？]SZ[19](;B[fo]C[图1  正解（10分）黑棋枷是手筋]N[图1  正解（10分）];W[fp];B[gp];W[fq];B[gq];W[fr];B[gr];W[dr];B[eo];W[es];B[go]C[黑棋外势厚壮。])(;B[eo]C[图2  失败（0分）]N[图2  失败（0分）];W[fp];B[fo];W[gp]C[黑棋大损。])(;B[gq]N[图3  黑棋失败（0分）]C[图3  黑棋失败（0分）黑棋碰虽然也是一种手法……];W[eo]C[但是黑棋损失太大，黑棋不行。]))",

		//wqqlzwcs_30_9.sgf
		"(;AW[br][bq][bp][dp][do][en][fn][gn][ho][hp][hq][hr]AB[cq][dr][eq][ep][fo][go][gp][gq][fs]C[（死活）白先。第一手棋是白棋吃住黑棋的关键，只有经过深思熟虑才行。]SZ[19](;W[ds]C[图1  正解（10分）白棋在底线托是急所]N[图1  正解（10分）];B[gr];W[fq]C[白棋点即可吃住黑棋];B[es];W[fr]C[黑棋不活。])(;W[fr]C[图2  白棋失败（0分）白棋直接跨，失误]N[图2  白棋失败（0分）];B[gr];W[fq];B[ds];W[er];B[dq]C[黑棋可以下成共活，白棋失败。])(;W[ds]C[图3 变化图]N[图3 变化图];B[cs]CR[ds]C[白棋托时，黑棋扳下寻求变化];W[cr];B[es];W[fr];B[gr];W[fq]C[黑棋仍死。]))",

		//wqqlzwcs_30_10.sgf
		"(;AW[br][dr][dq][dp][do][eo][fo][gn][hn][in][jo][jp][ir][iq][kr]AB[ds][er][eq][ep][fp][go][ho][io][ip][hq][hr]C[（死活）白先。本题中，白棋吃住黑棋的急所是什么？]SZ[19](;W[gq]N[图1 正解（10分）]C[图1 正解（10分）白棋急所一击];B[gr];W[gp];B[hp];W[hs]C[黑死。])(;W[gp]N[图2 失败（0分）]C[图2 失败（0分）白棋先打吃次序错误];B[gq];W[hp];B[fr]C[黑棋可弃子做活。])(;W[gq]C[图3 变化图]N[图3 变化图];B[gp]C[黑棋接抵抗];W[gr];B[hs];W[gs];B[es];W[is];B[hp];W[fr]C[黑棋不能活。]))",
	],

	[

		//wqqlzwcs_31_1.sgf
		"(;AW[dd][oc][qp][op]AB[dq][co][jq][qd][ld]LB[nd:a][pd:b][of:c][qg:d]C[（布局）白先。目前白棋在右上有许多定式可以选择，但白棋在下棋时应将右下缔角的因素考虑在内。请在 a、b、c 、d 中选择。]SZ[19](;W[nd]C[图1  平常下法（6分）白棋尖是最简单的定式选择，但从右下角白棋的布置考虑，右边的价值很大]N[图1  平常下法（6分）];B[pf];W[qb];B[qj]C[进行至此，黑棋抢占右边，白棋不满。])(;W[pd]C[图2  大同小异（6分）白棋尖顶的下法与图1 大同小异]N[图2  大同小异（6分）];B[qe];W[qc];B[rc];W[qb];B[qh];W[pe];B[pf];W[of];B[pg]C[到此是预想的进行，黑棋仍然可以占据价值很大的右边。])(;W[of]C[图3  黑棋满足（6分）白二间跳]N[图3  黑棋满足（6分）];B[qg]C[黑棋在右边出头，白棋缺少对策];W[jd];B[lf];W[ph];B[qh];W[pi];B[qi];W[pj];B[qk]C[进行至此，黑棋满足。])(;W[qg]C[图4 正解（10分）白棋反夹是充分认识到右边价值的下法]N[图4 正解（10分）];B[pe];W[pj]TR[pe]C[黑棋尖，白在右边围，右边白棋棋形比较理想];B[pc];W[lq]C[这是双方均可下的下法。]))",

		//wqqlzwcs_31_2.sgf
		"(;AB[pd][pp][qn][fc][ck][cn][cq][cp][fq][gp]AW[dd][id][eq][fp][dp][dr][fo][ip][kp][nq]LB[cc:a][cf:b][df:c][fe:d]C[（布局）黑先。黑棋如何根据左边棋子的布置来决定下一手棋？请在 a、b、c 、d 中选择。]SZ[19](;B[cc]C[图1  黑棋低位（6分）黑棋点三三最容易想到]N[图1  黑棋低位（6分）];W[dc];B[cd];W[de];B[db];W[eb];B[cb];W[ec];B[cf]C[左边黑棋偏于低位];W[nc]TR[ck]C[白棋挂后，白棋满意。])(;B[cf]C[图2  大同小异（6分）黑棋双飞燕，结果与图1 大同小异]N[图2  大同小异（6分）];W[fd];B[gd];W[fe];B[cc];W[ec];B[cd];W[fb]C[这是预想的进行，左边黑棋扁于低位。])(;B[df]C[图3  正解（10分）黑棋高夹是正解]N[图3  正解（10分）];W[fd];B[gd];W[fe];B[ec];W[de];B[cb];W[ge]C[双方形成实地与外势的转换，但由于左下黑棋对白棋外势形成牵制，因此黑棋好。];B[qf])(;B[fe]C[图4  平常的进行（8分）黑棋单跳]N[图4  平常的进行（8分）];W[df];B[db];W[cc];B[ib]C[到此是最平常的进行];W[qf]C[但白棋争得先手后，在右上挂，白棋充分可下。]))",

		//wqqlzwcs_31_3.sgf
		"(;AB[db][fc][hd][hk][fk][dk][ck][dj][fq][dr][jq][ip][io][iq][oq][qp][ql][ph][pg][pf][oe][pd][qd][re][oc][mc]AW[dd][cc][df][cj][ci][di][fi][cq][dp][dn][cm][jp][kp][jn][lm][qj][qh][qg][rf][qe][rd][rc][qc][pc]LB[jd:a][ie:b][if:c]SZ[19]C[（中盘）白先。白棋对上边黑势不可能无动于衷，白棋限制黑势的有效下法是什么？请在 a、b、c  中选择。](;W[jd]C[图1  白棋无理（4分）白棋打入过深]N[图1  白棋无理（4分）];B[if]C[黑棋飞封攻击，白棋不好下];W[jf];B[jg];W[kf];B[kg]C[白棋岌岌可危。])(;W[ie]C[图2  正解（10分）白棋肩冲是正确的侵消方法]N[图2  正解（10分）];B[id]C[黑补棋];W[ke];B[jd];W[kh]C[白棋可以维持大势的平衡。])(;W[ie]C[图3  变化图]N[图3  变化图];B[he]CR[ie]C[白棋肩冲时，黑棋挺头];W[if];B[hf];W[ig]C[白棋总是先黑一步走想中腹];B[jc];W[jk]TR[jc]LB[qn:a]C[黑棋在上边补棋时，白棋镇攻击。白棋由于还瞄着 a 位的打入，局势白好。])(;W[if]C[图4  白损（6分）]N[图4  白损（6分）];B[je];W[jf];B[ke]))",

		//wqqlzwcs_31_4.sgf
		"(;AW[cd][ed][gc][di][cq][dq][cp][co][cm][dm][gq][qo][op][np][mp][lq][mm]AB[dp][do][dn][eq][er][fo][hp][iq][nq][oq][pq][rq][ic][ie][pd][pf][pi][pl]LB[kc:a][pb:b][pc:c][qc:d]C[（中盘）白先。黑白双方的外势和实地都很均衡，问题是白棋如何牵制右上一带黑棋的大模样？请在 a、b、c 、d 中选择。]SZ[19](;W[kc]C[图1 代价太大（4分）]N[图1 代价太大（4分）];B[ke]CR[kc]C[白棋打入时，黑棋镇是好棋，白棋危险。以后白棋为了做活，势必要付出很大代价。])(;W[pb]N[图2 白棋不满（6分）]C[图2 白棋不满（6分）白棋二路打入，希望在对方阵营中尽快安定];B[pc]C[黑棋顶是攻击要点];W[ob];B[qb]C[白棋很难处理。])(;W[pc]C[图3 正解（10分）白棋托是最佳下法]N[图3 正解（10分）];B[qc];W[oc];B[qb];W[od];B[pe];W[lc];B[le];W[kb];B[jb];W[mb]C[白棋的打入取得了成功。])(;W[qc]C[图4  生不如死（4分）白棋点三三，实利虽然很大，但白棋只能后手做活]N[图4  生不如死（4分）];B[pc];W[rd];B[rf];W[pb];B[ob];W[rb];B[pa];W[qb]C[白棋只能后手做活，白棋不满];B[mk]C[黑棋争得先手后，抢占中腹要点，黑棋占压倒性优势。]))",

		//wqqlzwcs_31_5.sgf
		"(;AW[bq][cp][dp][fp][fq][hq]AB[dq][bo][cn][do][eo][gn][ck]C[（官子）黑先。黑棋如何追攻白棋形的弱点？由此也可以感受到角部下法的复杂多变。]SZ[19](;B[br]C[图1 正解（10分）黑棋靠是手筋]N[图1 正解（10分）];W[cr];B[aq]C[黑棋扳是连贯的好手];W[bs];B[bp];W[cq];B[ep];W[eq];B[ar]C[黑棋可以大幅度压缩白空。])(;B[ep]C[图2 失败（0分）]N[图2 失败（0分）];W[eq];B[bp]TR[ep]C[黑棋冲、挤的下法缺少妙味];W[cq];B[aq];W[ar];B[ap];W[bs]LB[co:a]C[黑棋虽可先手收官，但成效不大。以后白 a 时，黑棋还要补棋。 ])(;B[br]C[图3 变化图]N[图3 变化图];W[cq]TR[br]C[黑棋靠时，白棋团];B[aq];W[ap];B[ar]C[黑棋扳粘是好次序];W[bp];B[cr];W[eq];B[dr];W[ep];B[er];W[fr];B[es]C[黑棋可以在如此小的范围内做活，真是绝妙。]))",

		//wqqlzwcs_31_6.sgf
		"(;AB[cr][cq][dp][bp][bo][bn][cm][dm][em][jq][jo][kr][js]AW[cp][co][dn][eo][fo][gm][ho][gq][hq][dq][dr]LB[br:a]C[（官子）黑先。在本题中，黑棋如果稍有犹豫，白棋则有 a 位夹的手段，因此黑棋应在白棋动手之前，先手压缩白空。]SZ[19](;B[eq]C[图1 正解（10分）]N[图1 正解（10分）];W[er];B[fr]C[黑棋连扳是手筋，不给白棋任何机会];W[fq];B[ds];W[ep];B[es];W[do]C[黑棋可以先手压缩白空。])(;B[ds]C[图2 失败（0分）黑棋扳虽是先手官子]N[图2 失败（0分）];W[fr]C[白补棋后，与图1 相比，黑棋失败。在目数上差别很大。])(;B[eq]C[图3 变化图]N[图3 变化图];W[ds]C[白棋为了避免图1 的变化而立下];B[ep]LB[do:a][er:b]C[黑棋粘即可。以后 a、b 两点黑必得其一。]))",

		//wqqlzwcs_31_7.sgf
		"(;AW[bq][cq][dq][dr][bp][ep][fp][gp][hq][kq]AB[cp][dp][bo][cn][eq][fq][gq][hp]C[（手筋）黑先。在本题中，黑棋一步也不能退让，黑棋摆脱危机的手筋是什么？]SZ[19](;B[go]C[图1 正解（10分）黑棋扳紧气是绝妙的手筋]N[图1 正解（10分）];W[ho];B[ip];W[gn];B[hr]C[黑棋可征吃白一子。])(;B[ip]N[图2 失败（0分）]C[图2 失败（0分）黑棋单长不行];W[gr]C[白棋可以扳];B[hr];W[iq]C[黑棋困难。])(;B[iq]N[图3 失败（0分）]C[图3 失败（0分）黑棋打吃同样是不负责任的下法];W[hr];B[ho];W[fn]C[黑棋失败。]))",

		//wqqlzwcs_31_8.sgf
		"(;AB[bq][co][cn][cm][bk][dj][fo][fp][fq]AW[dp][ep][dr][dn][dm][dl][fm][ho][hq]C[（手筋）黑先。黑棋如何利用对方的弱点整形，并同时向中腹出头？]SZ[19](;B[fn]N[图1 正解（10分）]C[图1 正解（10分）黑棋顶，不仅瞄着对方的弱点，而且还伺机向中腹出头];W[en]C[白棋双，必然];B[hn];W[io];B[gm]C[黑棋可以整形出头。])(;B[gn]LB[fn:a]N[图2 失败（0分）]C[图2 失败（0分）黑棋尖出不好，白棋下在 a 位是先手，使黑棋下成愚形。])(;B[fn]C[图3 变化图]N[图3 变化图];W[gm]TR[fn]C[黑棋顶时，白棋长强封黑棋无理];B[do];W[eo];B[en]C[对杀黑胜。]))",

		//wqqlzwcs_31_9.sgf
		"(;AW[cr][er][eq][dp][do][en][fn][gn][ho][io][jp][jr][jq]AB[eo][fo][go][fq][gr][hp][iq][ir][is]C[（死活）白先。白棋只有找出正确的下法，才能吃住黑棋。第一手棋非常重要。]SZ[19](;W[gs]N[图1 正解（10分）]C[图1 正解（10分）白棋托是急所];B[hs];W[hq]TR[hs]C[黑棋挡时，白棋点，黑不能活];B[gq];W[fp])(;W[hq]N[图2 失败（0分）]C[图2 失败（0分）白棋直接点，看似急所];B[fp]C[但黑棋有接的抵抗手段];W[ip];B[gq]C[成劫，白棋失败。])(;W[gs]C[图3 变化图]N[图3 变化图];B[fp];W[gq]TR[fp]C[黑棋若接，白棋点即可吃住黑棋。]))",

		//wqqlzwcs_31_10.sgf
		"(;AW[br][cr][bp][dp][do][en][fn][go][hp][ip][jp][jq][jr][lr]AB[dr][dq][ep][fo][fr][gq][iq][ir]C[（死活）白先。在本题中，黑棋看似已经完活，但只要白棋进攻得当，黑棋仍然要死。]SZ[19](;W[gs]N[图1 正解（10分）]C[图1 正解（10分）白棋点是急所];B[hr];W[is];B[hs];W[hq];B[gr];W[fp];B[eq];W[es];B[ds];W[fs]C[白棋已吃住黑棋。])(;W[is]N[图2 失败（0分）]C[图2 失败（0分）白棋先扳不行];B[gs]C[黑棋倒虎是要领];W[hr];B[hq];W[es];B[ds];W[hs];B[fp]C[黑活。])(;W[gs]C[图3 变化图]N[图3 变化图];B[is]CR[gs]C[白棋点时，黑棋立下抵抗];W[hq];B[hr];W[gr];B[fs];W[fq];B[hs];W[gr]C[白棋以绝好的次序吃住黑棋。]))",
	],

	[

		//wqqlzwcs_32_1.sgf
		"(;AW[dd][dp][cn][ip][iq][hq]AB[fq][eo][hp][ho][pp][pd]LB[kp:a][kq:b][lq:c][mq:d]C[（布局）黑先。黑棋以什么方法攻击下边白棋三子最好？请在 a、b、c 、d 中选择。]SZ[19](;B[kp]C[图1 黑棋不妥（6分）黑棋夹攻不妥]N[图1 黑棋不妥（6分）];W[io];B[hn];W[in];B[hm];W[mp]CR[io][in]TR[hn][hm]C[白棋在左边连挺两手之后，在下边夹击很好];B[kn];W[kq]TR[kn]C[黑棋跳出，白棋托可取得联络，结果黑棋不满。])(;B[kq]C[图2 黑棋难受（4分）黑棋低夹更始不能让人满意]N[图2 黑棋难受（4分）];W[io];B[hn];W[np]CR[io]TR[hn]C[白棋贴与黑棋长交换一手后，在右下高挂非常严厉];B[ko];W[in];B[hm];W[lp];B[kp];W[im]C[黑棋难受。])(;B[lq]N[图3 黑棋薄弱（8分）]C[图3 黑棋薄弱（8分）黑棋二间夹，攻击白棋];W[io];B[hn];W[jm];B[hl];W[jk]LB[nq:a]C[白棋抢先向中腹出头很好，以后白棋还可瞄着 a 位的弱点，因此白棋好下。])(;B[mq]N[图4  正解（10分）]C[图4  正解（10分）黑棋大飞是正确的攻击方法];W[io];B[hn];W[in];B[hm];W[jl]C[白棋向中腹出头];B[do];W[co];B[dq];W[cq];B[ep];W[cp]C[黑棋在左下角先手利用，机敏];B[hk]C[然后再抢占中腹要点，黑好调。]))",

		//wqqlzwcs_32_2.sgf
		"(;AW[dd][dg][cp][ld][ne][pc][po][pn][qn][qm][ql][pk][pj][ol]AB[cn][nc][qd][qc][pe][ph][pi][qj][qk][rl][pl][pq][qp][qo][nq]LB[ck:a][cl:b][eq:c]C[（布局）白先。白棋如何对付左下挂角的黑棋一子？请在 a、b、c 中选择。]SZ[19](;W[ck]N[图1 白棋不满（8分）]C[图1 白棋不满（8分）白棋通过夹攻来扩张左上，方针是正确的];B[dp];W[dq];B[eq]TR[dp]CR[ck]C[黑棋靠、连扳是腾挪的手筋，结果白棋二间夹一子成为疑问手];W[do];B[ep];W[co];B[cq];W[bq];B[dr]C[到此均是预想的进行，白棋略不满。])(;W[cl]N[图2  正解（10分）]C[图2  正解（10分）白棋紧夹，不给黑棋任何余地是正解];B[dp];W[dq];B[eq];W[cq];B[ep];W[co];B[dn];W[do];B[eo];W[en];B[dl];W[bn]C[黑棋战斗不利。])(;W[cl]C[图3  变化图]N[图3  变化图];B[dp];W[dq];B[cq]CR[dq]C[白棋扳时，黑棋断];W[bq];B[cr];W[do];B[ep];W[co];B[br];W[fo];B[eo];W[en];B[eq];W[dn]C[白棋可以在价值极大的左边扩张，结果白棋有利。])(;W[eq]N[图4 白棋不利（6分）]C[图4 白棋不利（6分）白棋守角];B[ck]C[被黑棋拆二后，白棋不满。];W[ci];B[jd]CR[ci]C[白棋拦时，黑可抢占上边要点。]))",

		//wqqlzwcs_32_3.sgf
		"(;AB[cd][ec][cj][cp][co][dn][pp][op][pm][oc][pc][qd][qf]AW[nc][od][md][ic][bq][cq][dp][ep][jq][pq][qq][ro]LB[bd:a][ch:b][di:c]C[（中盘）白先。本题是职业棋手对局中出现的棋形。白棋最有效地侵消左边黑势的方法是什么？请在 a、b、c 中选择。]SZ[19](;W[bd]N[图1  正解（10分）]C[图1  正解（10分）白棋托问黑应手是常用下法];B[be];W[ce]TR[be]C[黑棋如果外扳，则白棋断是手筋];B[bc];W[dd];B[cc];W[bf];B[ad];W[dg]C[白棋可以成功处理。])(;W[bd]C[图2  变化图]N[图2  变化图];B[bc];W[dd]CR[bd]TR[bc]C[白棋托时，黑棋如果内扳，则白棋夹是先手利用];B[cc];W[df]C[白棋单跳很好，由于白棋形状比较轻灵，因而不易受攻。])(;W[ch]N[图3  白棋无谋（6分）]C[图3  白棋无谋（6分）白棋打入是无谋的表现];B[cf]C[黑棋拆一虽显得很小，但却是攻击白棋的急所];W[eh];B[ej]C[白棋由于无根，只有向中腹逃跑。])(;W[di]N[图4  白损（6分）]C[图4  白损（6分）白棋肩冲虽是好点，但由于会使对方顺势走强，因此难以赞同];B[ci];W[dh];B[dj];W[fi];B[ej];W[gg]LB[cl:a]C[黑棋由于解消了 a 位的弱点，从而可以满足。]))",

		//wqqlzwcs_32_4.sgf
		"(;AB[cc][bc][dd][fd][jd][oc][qd][qg][pp][qn]AW[cp][fq][cj][ce][cd][df][ff][kp][ql][qi]LB[cl:a][fo:b][ip:c]C[（中盘）黑先。白棋左下一带的棋形很宽广，黑棋如何限制左下白棋规模以维持大势均衡？请在 a、b、c  中选择。]SZ[19](;B[cl]C[图1  黑棋不满（6分）黑棋直接打入不成立]N[图1  黑棋不满（6分）];W[cn]C[白棋拆一是攻击的急所];B[el];W[ej];B[gl]C[黑虽可向中腹出逃，但由于黑棋无根，因此可以说黑棋的打入失败了。])(;B[fo]C[图2  正解（10分）黑棋镇是侵消的要点，也是正解]N[图2  正解（10分）];W[do];B[dq];W[cq];B[gq];W[gr];B[fr];W[er];B[fp];W[eq];B[hr];W[fs];B[ip]C[黑棋的打入取得了成功。])(;B[fo]C[图3  变化图]N[图3  变化图];W[fp]C[白棋顶是困守下边的下法];B[eo];W[dp];B[ho];W[ip];B[el]C[黑棋轻松整形，黑棋的侵消同样取得了成功。])(;B[ip]N[图4  方向错误（6分）]C[图4  方向错误（6分）黑棋打入的方向错误];W[fo];B[in];W[nq]C[白棋有利。]))",

		//wqqlzwcs_32_5.sgf
		"(;AW[ar][br][bq][dq][eq][fr][gr]AB[aq][ap][bp][cp][dp][ep][fq][gq][hq][hs][hr]SZ[19]C[（官子）黑先。黑棋要吃住整块白棋不可能，但如果次序正确可以将白地限定在 2 目。](;B[cq]C[图1  正解（10分）]N[图1  正解（10分）];W[cr];B[es]TR[cq]C[黑棋冲、点是官子手筋];W[ds];B[gs];W[bs];B[fs];W[dr]C[白棋只有 2 目，而且两个白子还在黑棋嘴里。])(;B[fs]N[图2  失败（0分）]C[图2  失败（0分）黑棋底线夹，看似手筋];W[es];B[gs];W[er];B[cq];W[cr]C[但白棋可以成空 5 目。])(;B[fs]C[图3  变化图]N[图3  变化图];W[es];B[gs];W[er];B[cr]C[黑棋求变];W[cq];B[bs];W[ds];B[cs]C[双活，但黑棋是后手。])(;B[es]N[附图]C[附图黑棋直接点如何？];W[cq]C[白棋只能接，走其他地方都不妙下面，黑棋需要考虑先手的价值了：取先手？还是最大限度压缩白地？ 图1 的走法最好。]))",

		//wqqlzwcs_32_6.sgf
		"(;AW[cr][dq][dp][co][cn][bm][cl][ck][dk]AB[dm][dn][do][cm][dl][ep][eq][er][dr][iq]C[（官子）黑先。黑棋如果能正确利用白棋的弱点，可取得相当大的官子收益。其中行棋次序非常重要。]SZ[19](;B[bn]N[图1  正解（10分）]C[图1  正解（10分）黑棋断是官子手筋];W[bo];B[cq];W[cp];B[bq];W[br];B[ar]C[黑棋可以利用白棋的不入气而吃住白棋二子。白棋没有选择余地。])(;B[cq]N[图2  黑棋失败（0分）]C[图2  黑棋失败（0分）黑棋先断打];W[cp];B[bq];W[br];B[bn]C[黑棋再断];W[bp];B[bl];W[bk]C[白棋可以弃边守角，黑棋失败。])(;B[bn]C[图3  变化图]N[图3  变化图];W[bp]TR[bn]C[黑棋断，白棋尖，试图守角];B[cp]C[黑棋扑是手筋];W[bo];B[cq];W[bq];B[br];W[ar];B[bs]C[本图结果与图1 大同小异。]))",

		//wqqlzwcs_32_7.sgf
		"(;AB[cq][co][cp][bm][gp][hp][ip][jp][kq]AW[dq][dp][do][dn][gq][hq][iq]C[（手筋）黑先。在本题中，黑棋如何攻击整块白棋？]SZ[19](;B[er]N[图1  正解（10分）]C[图1  正解（10分）黑棋点是急所];W[dr]C[白棋如果立下阻渡……];B[fq];W[fp];B[gr]C[黑棋吃住白三子。])(;B[fr]N[图2  失败（0分）]C[图2  失败（0分）黑棋点的位置不对];W[fq];B[dr];W[er];B[es];W[eq]C[白棋眼形丰富。黑棋失败。])(;B[er]C[图3  变化图]N[图3  变化图];W[fr]C[白棋尖顶];B[dr]C[黑棋渡过，收获已经不小];W[eq];B[fp];W[fq]C[白棋大块还没有活干净。]))",

		//wqqlzwcs_32_8.sgf
		"(;AW[dq][dp][co][fp][fo][gq][hq][iq][ir][is][hp]AB[cn][eq][fq][gp][ho][ip][jq][jr][gr][hr]C[（手筋）黑先。黑棋如连回一子，白棋两打之后，黑子将被征吃。黑棋如何下才能巧妙地逃脱被征？]SZ[19](;B[eo]C[图1  正解（10分）黑棋靠在这里，是巧妙的引征]N[图1  正解（10分）];W[ep];B[go];W[io];B[jp];W[hn];B[gn];W[gm];B[fn]C[白已无法征吃黑棋。])(;B[go]N[图2  失败（0分）]C[图2  失败（0分）黑棋单接不行];W[io];B[jp];W[hn]C[黑棋被征吃。])(;B[eo]C[图3  变化图]N[图3  变化图];W[go]C[白棋提子];B[ep]C[黑棋成功出头。]))",

		//wqqlzwcs_32_9.sgf
		"(;AB[br][cr][dr][cq][cp][dp][ep][fq][hq][hr]AW[cs][bs][ar][bq][bp][bo][co][do][eo][fp][gp][hp][ip][iq][ir][dq]LB[gq:a]C[（死活）白先。白棋如果 a 位冲，吃住黑棋二子，不能令人满意。白棋应该如何利用黑棋的弱点吃住全部黑棋？]SZ[19](;W[fr]N[图1  正解（10分）]C[图1  正解（10分）黑棋夹是棋形的要点];B[gq]C[黑棋只得连接];W[es]C[白棋尖是绝妙的手筋];B[ds];W[hs];B[gs];W[eq];B[er];W[eq]C[白棋扑，黑棋难免一死。])(;W[fr]C[图2  变化图]N[图2  变化图];B[gq];W[es];B[ds];W[hs];B[as]CR[hs]C[白棋扳时，黑棋提子];W[gs]LB[eq:a][bs:b]C[白棋长入，冷静，以下 a、b 两点白必得其一，黑棋同样被杀。]))",

		//wqqlzwcs_32_10.sgf
		"(;AB[bq][bp][cp][dp][dq][dr][ds]AW[bs][ap][bo][co][do][eo][ep][eq][er][es][bm]C[（死活）白先。白棋只有经过细致的计算才能杀死黑棋。第一手棋和第三手棋非常重要。]SZ[19](;W[br]N[图1 正解（10分）]C[图1 正解（10分）白棋顶是急所];B[ar];W[as];B[aq];W[cr]C[黑棋气紧，不入气];B[ao];W[cs]C[黑棋被杀。])(;W[ar]N[图2 白棋失败（0分）]C[图2 白棋失败（0分）白棋走在一二路上，看似急所];B[aq];W[cr];B[br];W[ao];B[as]C[双方下成打劫，白棋失败。黑的先手劫，缓气劫。])(;W[cr]N[图3  失败（0分）]C[图3  失败（0分）白棋尖如何？];B[ar]LB[br:a][cs:b]C[黑棋也尖，以后 a、b 两点白只能走到一处，共活。]))",
	],

];
 
                

